{
  "subreddit": "buildapc",
  "collection_date": "2025-06-05T14:17:05.660492",
  "total_posts": 222,
  "posts": [
    {
      "id": "1l3rsn8",
      "title": "Thinking of switching to 4K — will I actually notice a big difference?",
      "content": "I’m thinking of upgrading my monitor to **4K**, but not sure if it’s going to be worth it.\n\nRight now, I’m using an **Acer VG270P** — it’s a **1080p, 27-inch, 144Hz** monitor. I mostly play **single-player story games** like God of War, RDR2, The Last of Us (sometimes on PC, sometimes on PS4 Pro). I also watch a lot of movies on my monitor.\n\nIf I upgrade to a **4K 27-inch monitor**, will I **notice a big visual difference** for gaming and movies? Or is the jump from 1080p to 4K on a 27-inch screen not that huge, especially considering the price?\n\nWould love to hear from people who’ve made a similar upgrade!\n\nEdit- Here are my PC Specs\n\n* **CPU:** AMD Ryzen 5 3600\n* **RAM:** 32.0GB DDR4 @ 1599MHz\n* **Motherboard:** MSI B450M PRO-VDH MAX\n* **Graphics:** NVIDIA GeForce GTX 1660 SUPER (2GB)\n* **Storage:** 931GB KINGSTON SA2000M81000G (SSD)\n* **Display:** VG270 P (1920x1080 @ 144Hz)",
      "author": "BadKarma6996",
      "created_utc": 1749103286,
      "upvotes": 37,
      "upvote_ratio": 0.79,
      "num_comments": 176,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3rsn8/thinking_of_switching_to_4k_will_i_actually/"
    },
    {
      "id": "1l3e108",
      "title": "First build in 8 years - did I completely waste money on this GPU choice?",
      "content": "Alright PC master race, I need some reality checks because I'm second-guessing every decision I made 😅  \n  \nFinally saved up enough to upgrade from my ancient FX-6300 build (RIP you beautiful disaster). Set myself a $1,800 budget and here's what I ended up with:  \n  \n\\- Ryzen 7 7700X  \n  \n\\- RTX 4070 Super  \n  \n\\- 32GB DDR5-6000  \n  \n\\- B650 motherboard  \n  \n\\- 1TB Gen4 NVMe  \n  \n\\- 750W Gold PSU  \n  \nThe thing is... I originally planned on getting a 4060 Ti to save money, but when I got to Micro Center the sales guy convinced me the 4070 Super was \"way better value for 1440p gaming.\" Ended up spending an extra $200 I didn't really have lmao  \n  \nNow I'm eating ramen for the next month wondering if I actually needed that extra power. I mostly play stuff like Cyberpunk, Baldur's Gate 3, and whatever's free on Epic. Coming from a GTX 970, literally anything would've been an upgrade 💀  \n  \nDid I get finessed by the Micro Center employee or is the 4070 Super actually worth the price jump? Part of me thinks I should've stuck with the 4060 Ti and used that $200 for a better monitor instead of my current 1080p setup.  \n  \nAlso wtf is up with DDR5 prices? Spent almost $150 on RAM when I remember buying 16GB DDR4 for like $60 a few years ago. This hobby really said \"your wallet? what wallet?\" 🤣  \n  \nAnyone else constantly question their build choices after the fact? Or am I just overthinking because I can see my bank account crying from here?",
      "author": "Tough-Walrus-9792",
      "created_utc": 1749063810,
      "upvotes": 216,
      "upvote_ratio": 0.92,
      "num_comments": 106,
      "flair": "Discussion",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3e108/first_build_in_8_years_did_i_completely_waste/"
    },
    {
      "id": "1l36s40",
      "title": "Just dropped a screw in my psu",
      "content": "Was just building a new pc and I dropped a screw into my psu. I see other people have had the same problem but mine doesn’t seem to come out…\n\nI’ve taken it out and tried shaking it but nothing is moving inside or falling out. I’m like 99.999% sure it’s in the psu as I watched it drop in and then It’s not on the floor around.\n\nWhat’s the best option?\n\nI would also like to preface that this is a brand new PSU so unplugged and has not been powered, so shouldn’t be causing issues currently… shouldn’t be…\n\nUpdate - against many suggestions I have in fact tried it because I simply couldn’t see or hear anything screws screws after like 30minutes of shaking. All seems to be okay… for now… \nI have also ordered a new PSU that will be here Friday to be on the safe side THANKS",
      "author": "joecarter42069",
      "created_utc": 1749046811,
      "upvotes": 339,
      "upvote_ratio": 0.93,
      "num_comments": 170,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l36s40/just_dropped_a_screw_in_my_psu/"
    },
    {
      "id": "1l3n1g1",
      "title": "Built a PC for my gamer girl fianceè's 30th birthday but it didn't go so well.",
      "content": "Long story short: My fianceè is big into gaming and has been playing on a trusty old rtx3070 legion 5 laptop for the past 4 years getting 20-30 fps at best. She plays heavily modded games and uses our 98 inch tv that has a port to support 120 Hz @4K.\n\nBuilt her a PC for her 30th hoping to bring more enjoyment. The build is as follows:\n\nRyzen 9 9950X3D\n\nRtx 5090 Aorus Master ICE\n\nX870E Aorus Pro Ice Motherboard\n\nCorsair Dominator DDR5 6400 MHz - 4 x 48GB\n\nSamsung 9100 Pro 2TB - 1x\n\nSamsung 990 Evo Plus 2TB - 3x\n\nAsus ROG Strix 1000w Platinum PSU\n\nAorus Waterforce X II 360 ICE AIO\n\nLian Li Strimers for MB, CPU and GPU\n\n10 x Lian Li Infinity Fans - 4x exhausts/6x intakes\n\nHyte Y70 Ifinity Touch case\n\nID-Cooling Frost x45\n\nAfter everything has been assembled the PC would fire up, case and GPU fans spinning and lighting up, RGB at the motherboard turned on, AIO display would turn on but no monitor signal - regardless of whether HDMI is plugged in to GPU or MB. Red CMOS light on MB lights up at the DRAM led and lots of random numbers were displayed.\n\nTested all the configurations, took out second and fourth RAM stick counting from CPU, then took out first and third and not a thing changed. Eventually I let it run for about two hours and it finally displayed BIOS. Managed to install windows but even after that was done PC would take ages to boot - between 5 and 15 minutes. RAM was running on 3600 MHz and although I didn't expect 6400Mhz out the box it's still a bit slow.\n\nAny idea what am I doing wrong?\n\nWindows is installed on 9100 Pro and with all the other components I would like it to boot instantenously. The red light on CMOS is gone but two digit display still displays different numbers at times.\n\nI've taken a couple of pictures in case I'm missing something here. \n\nHelp! I'm running out of time before her birthday...\n",
      "author": "FunNefariousness6980",
      "created_utc": 1749087363,
      "upvotes": 32,
      "upvote_ratio": 0.63,
      "num_comments": 76,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3n1g1/built_a_pc_for_my_gamer_girl_fianceès_30th/"
    },
    {
      "id": "1l3rnmk",
      "title": "GPU and GPU never fully utilized for years",
      "content": "As the title says, my GPU and CPU are never fully utilized, I tried to fix it multiple times and troubleshooted with friends, sadly to no avail.\n\nCurrently i'm mostly playing Black Desert, which I believe is well optimized or should at least use as much GPU/CPU as it can get. I saw streamers getting over 200FPS with a 4080 on the highest graphics settings, so believe this is good enough for a Test.\n\nMy Build:\n\n|Part|Model|\n|:-|:-|\n|CPU|CPU AMD Ryzen 7 5800X3D GPU |\n|GPU|MSI RTX 3080 VENTUS 3X OC|\n|RAM|4 \\* corsair cmw32gx4m2d3600c18|\n|Motherboard|GIGABYTE X570 AORUS ULTRA|\n|SSD1 (OS and most Games) installed in |Crucial P5|\n|SSD2 (Games not fitting SSD1)|WD SN850|\n|PSU|Corsair HX850i|\n\nHere's also a Screenshot of my Taskmanager, MSI Afterburner(just downloaded, didn't really use yet) and HWInfo. [https://imgur.com/a/maHYT9y](https://imgur.com/a/maHYT9y)\n\nI only just realized that my SSD with my OS has half the max speed my SSD has I use as a backup, but I think this doesn't matter to the Topic.\n\nPlease tell me if I can do anything gto give oyu more Information, I'm really desperate and thought multiple times about upgrading to a 9070XT, which, I would guess, would not solve my issue.\n\n",
      "author": "dasnerft",
      "created_utc": 1749102764,
      "upvotes": 11,
      "upvote_ratio": 0.65,
      "num_comments": 49,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3rnmk/gpu_and_gpu_never_fully_utilized_for_years/"
    },
    {
      "id": "1l3uybc",
      "title": "Help me choose please? 5070 ti or 9070 xt?",
      "content": "Hello everyone I’m new to this subreddit. Even new to building pc. I only have a laptop with rtx 2060max q and I wanna upgrade to a pc. Since the price for both 5070 ti and 9070 xt are kinda similar. Which one do you guys think is a more bang for your buck gpu? I’m open to suggestions on which parts to get with it too if it’s ok? If not that’s fine I just can’t decide which gpu to get. Please help? 🙏 ",
      "author": "_Tsukuyomi-",
      "created_utc": 1749116181,
      "upvotes": 5,
      "upvote_ratio": 0.86,
      "num_comments": 29,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3uybc/help_me_choose_please_5070_ti_or_9070_xt/"
    },
    {
      "id": "1l3s665",
      "title": "Should I switchmy 3060ti for a 9060XT?",
      "content": "Hi everyone,\nI've been using a gaming X trio 3060ti since launch for a mix of 1080p and 1440p which, so far, has been pretty much flawless (I've only experienced vram issues in monster hunter wilds); however, with the launch of the 9060XT and the fact that after a week it could be selling for far more than it's worth, I've been wondering if it's worth replacing my GPU whilst I can get one for what it's actually worth.\nFrom benchmarks I saw that it's roughly between a 7700XT and a 7800XT but with the benefit of more vram and fsr4; I'd say the main reasons I'm looking at it is the vram and the fact that its dx12 performance on Linux would be better than the 3060ti (until Nvidia actually fixes their drivers - apparently they now, just, know about this issue lol).\nI'm not looking to get a 9070 or XT, it's too expensive. 🫥.\nThanks!",
      "author": "lgcas",
      "created_utc": 1749104692,
      "upvotes": 5,
      "upvote_ratio": 0.78,
      "num_comments": 36,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3s665/should_i_switchmy_3060ti_for_a_9060xt/"
    },
    {
      "id": "1l3mheo",
      "title": "First PC build after 10 years",
      "content": "Tried my best doing some research and this is the best build I could come up with for ~2000 EUR. Is there anything you would recommend I change in this build from personal experiences? I've had a gtx 960 build for 10 years, it has served me incredibly well but it is time to lay it to rest, (or sell it if I'm able to). The only components I have not yet purchased are the motherboard, ram and psu. Any help is appreciated and yes I am aware that if anyone says anything it is mostly their personal opinion, thank you in advance! https://ro.pcpartpicker.com/list/N3CsC8",
      "author": "PiiK0N",
      "created_utc": 1749085706,
      "upvotes": 13,
      "upvote_ratio": 0.93,
      "num_comments": 8,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3mheo/first_pc_build_after_10_years/"
    },
    {
      "id": "1l32p0b",
      "title": "What does people mean when they say its not faster but \"More Efficient\"?",
      "content": "So I ordered 265k few days ago after having a salad in my brain trying to get the best CPU I can for my budget .. I do lot's of video/audio editing (beyond gaming) and therefore AMD is out of the picture.\n\nI read it before and now some friend told me \"yea you should've bought older generation blah blah faster but blah blah 265k is more efficient\", when I asked my so called \"expert\" friend, he couldn't even explain to me what does it even mean .. and here I am .. :D\n\nI honestly couldn't find any good reason to buy an older generation CPU, when the prices are almost identical to the older generation .. but hey, I am dying to know the answer :)\n\nThanks a lot.",
      "author": "Eliran1991",
      "created_utc": 1749035029,
      "upvotes": 119,
      "upvote_ratio": 0.77,
      "num_comments": 137,
      "flair": "Discussion",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l32p0b/what_does_people_mean_when_they_say_its_not/"
    },
    {
      "id": "1l3pnso",
      "title": "GPU for $300 -ish",
      "content": "Basically the title. I'm doing a build soon and wondering what's the best gpu for around $300. I don't mind if it's brand new or used.",
      "author": "guisuper2",
      "created_utc": 1749095601,
      "upvotes": 5,
      "upvote_ratio": 0.73,
      "num_comments": 21,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3pnso/gpu_for_300_ish/"
    },
    {
      "id": "1l2zng1",
      "title": "I tried zip-tying a CPU cooler to my GTX 960. It got hotter. So I made a mount. Now it’s colder than stock.",
      "content": "Had a spare CPU cooler and figured I’d chuck it on my 960 for a laugh.  \nUsed zip ties at first, looked cursed but kinda held. Ran Firemark and it actually hit 50c, which was worse than the stock cooler at 40c.  \nGuessing the contact was trash.\n\nSo I designed a bracket and printed it properly. Screwed it down nice and flat.  \nSame test, dropped to 27°C.  \nHonestly shocked it worked that well.\n\nPut it all in a video if anyone wants to see the temps or just the janky zip tie attempt. [https://youtu.be/wESf4rLelh8](https://youtu.be/wESf4rLelh8)",
      "author": "Tra5hL0rd_",
      "created_utc": 1749022974,
      "upvotes": 146,
      "upvote_ratio": 0.9,
      "num_comments": 27,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l2zng1/i_tried_ziptying_a_cpu_cooler_to_my_gtx_960_it/"
    },
    {
      "id": "1l3j7ji",
      "title": "Shaving ~$100 off parts list while keeping as much performance as possible",
      "content": "Hey everyone, trying to build a pc for my bf and I have this put together. I'm looking to shave $100 or so off this list without impacting performance as much as possible. Any suggestions are much appreciated. Only caveats, the case is off limits unless there's something *very* similar for cheaper, and it needs 2TB SSD storage. Thank you!\n\nEDIT: I didn’t meant to include a Windows license in the list, I know there’s cheaper ways. So just ignore that, still need $100 off. Thanks :)\n\n[PCPartPicker Part List](https://pcpartpicker.com/list/6czzgn)\n\nType|Item|Price\n:----|:----|:----\n**CPU** | [AMD Ryzen 7 7800X3D 4.2 GHz 8-Core Processor](https://pcpartpicker.com/product/3hyH99/amd-ryzen-7-7800x3d-42-ghz-8-core-processor-100-100000910wof) | $384.99 @ Amazon \n**CPU Cooler** | [Thermalright Frozen Notte ARGB 72.37 CFM Liquid CPU Cooler](https://pcpartpicker.com/product/9VmNnQ/thermalright-frozen-notte-argb-7237-cfm-liquid-cpu-cooler-frozen-notte-360-white-argb-d1) | $56.59 \n**Motherboard** | [Asus TUF GAMING B850-PLUS WIFI ATX AM5 Motherboard](https://pcpartpicker.com/product/sRG2FT/asus-tuf-gaming-b850-plus-wifi-atx-am5-motherboard-tuf-gaming-b850-plus-wifi) | $229.99 @ Amazon \n**Memory** | [Corsair Vengeance RGB 32 GB (2 x 16 GB) DDR5-6000 CL36 Memory](https://pcpartpicker.com/product/kTJp99/corsair-vengeance-rgb-32-gb-2-x-16-gb-ddr5-6000-cl36-memory-cmh32gx5m2e6000c36) | $91.99 @ Newegg \n**Storage** | [Western Digital WD_Black SN850X 2 TB M.2-2280 PCIe 4.0 X4 NVME Solid State Drive](https://pcpartpicker.com/product/crKKHx/western-digital-wd_black-sn850x-2-tb-m2-2280-pcie-40-x4-nvme-solid-state-drive-wds200t2x0e) | $153.00 @ Amazon \n**Video Card** | [Gigabyte WINDFORCE OC SFF GeForce RTX 5070 12 GB Video Card](https://pcpartpicker.com/product/PxG2FT/gigabyte-windforce-oc-sff-geforce-rtx-5070-12-gb-video-card-gv-n5070wf3oc-12gd) | $609.99 @ Newegg \n**Case** | [Corsair 3500X ARGB ATX Mid Tower Case](https://pcpartpicker.com/product/T8V2FT/corsair-3500x-argb-atx-mid-tower-case-cc-9011279-ww) | $109.99 @ Amazon \n**Power Supply** | [Corsair RM750e (2025) 750 W Fully Modular ATX Power Supply](https://pcpartpicker.com/product/jfHp99/corsair-rm750e-2025-750-w-fully-modular-atx-power-supply-cp-9020295-na) | $99.99 @ Amazon \n**Operating System** | [Microsoft Windows 11 Home OEM - DVD 64-bit](https://pcpartpicker.com/product/dKkWGX/microsoft-windows-11-home-oem-dvd-64-bit-kw9-00633) | $119.99 @ Amazon \n | *Prices include shipping, taxes, rebates, and discounts* |\n | **Total** | **$1856.52**\n | Generated by [PCPartPicker](https://pcpartpicker.com) 2025-06-04 18:30 EDT-0400 |",
      "author": "FireFright8142",
      "created_utc": 1749076451,
      "upvotes": 9,
      "upvote_ratio": 0.74,
      "num_comments": 35,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3j7ji/shaving_100_off_parts_list_while_keeping_as_much/"
    },
    {
      "id": "1l3kp5o",
      "title": "Any recommendations for upgrades?",
      "content": "I have a prebuild that I'm looking to upgrade pieces of it sometime soon. I don't have a crazy budget but I'm thinking in the $200-700 range all together. Pipe dream but I'm hoping to have something that'll run GTA 6 at (at least)  low settings haha. Any recommendations? Thanks!\n\nProcessor: AMD Ryzen 7 2700 Eight-Core Processor             3.20 GHz\n\nRAM: 16GB\n\nGraphics Card: NVIDIA GeForce RTX 2060\n\n",
      "author": "Bubbly-Watch-4142",
      "created_utc": 1749080492,
      "upvotes": 7,
      "upvote_ratio": 1.0,
      "num_comments": 5,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3kp5o/any_recommendations_for_upgrades/"
    },
    {
      "id": "1l38rqk",
      "title": "Upgrading from 5800x & 3070 Ti --- 5070 Ti or 5080?",
      "content": "I'm going to upgrade to 9800x3d rig but I can't really decide if I should get a 5080 or 5070 ti. I currently have 5800x, 3070 ti, 32gb ram with dual 980 Pro 1TB Nvme's. I play games at 1440p/165hz and lately more and more games do not run above 60-70 fps hence wanting to upgrade. The price of the 5080 is almost double in some cases leading me to believe its not worth it since I think the performance upgrade is only \\~10-15%? Games i'd like more fps in... Satisfactory, Space Marines 2, and future games.\n\n\n\nLastly, will GIGABYTE X870E AORUS ELITE support the 5080 or 5070 ti and two nvme's properly? I will have a 1000 watt psu. Having the nvme's is important for me to edit photos in lightroom and videos in premiere pro.\n\n  \nThank you",
      "author": "jdead121",
      "created_utc": 1749051550,
      "upvotes": 28,
      "upvote_ratio": 0.87,
      "num_comments": 38,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l38rqk/upgrading_from_5800x_3070_ti_5070_ti_or_5080/"
    },
    {
      "id": "1l3enfa",
      "title": "14700k or 9900x?",
      "content": "Hey pc lovers. I will be doing pc by my self for gaming and video editing (davinci resolve). And I know that lga 1700 is probably will not get one more generation of CPUs, but in my country right now 14700k cost for $100 less than 9900x. And its crazy because in most cases I think this CPU is better than 9900x. And I have no money for GPU now, so for the next 6 month I belive my new CPU will be working with my 3060 :) \nWhat would you do? \nThank you",
      "author": "Wooden-Arrival-9501",
      "created_utc": 1749065276,
      "upvotes": 10,
      "upvote_ratio": 0.85,
      "num_comments": 13,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3enfa/14700k_or_9900x/"
    },
    {
      "id": "1l3baj6",
      "title": "[US] tips to get a 9060XT at MSRP tomorrow?",
      "content": "I’ve been out of the PC market for almost a decade and trying to get back in but the constant out of stock/way over MSRP has been killing me (I just watched a 9070XT go from $720 - already more than I wanted to spend - to $899 overnight). So I heard there is a good chance to buy these cards when they come out at MSRP before they go out of stock, and the 9060XT at $350 has more than enough performance for me. \n\nSo what are some tips and tricks to pick one up at launch tomorrow? Does anyone know what time they go on sale? Should I be looking at sites like Asus that tell direct to customer or looking at PCPartPicker (not sure how fast it updates). Any advice or tips or securing a new card at MSRP in the US is greatly appreciated thanks",
      "author": "csccta",
      "created_utc": 1749057415,
      "upvotes": 9,
      "upvote_ratio": 0.74,
      "num_comments": 20,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3baj6/us_tips_to_get_a_9060xt_at_msrp_tomorrow/"
    },
    {
      "id": "1l3cql5",
      "title": "5070ti - Do I need a fan cable",
      "content": "I noticed my 5070ti's fans were not spinning. Checked the card and I can see next to the 12pin power cable there is an empty 3 pin header.\n\nI was only idling on desktop so booted a game up and the fans did not spin. I am now paranoid that I've not plugged in the fans for the graphics card. Checked the boxes and I definitely didn't receive a cable but looks like I need a female to female fan cable, is this correct? ",
      "author": "Twobithoe",
      "created_utc": 1749060798,
      "upvotes": 6,
      "upvote_ratio": 0.65,
      "num_comments": 12,
      "flair": "Build Complete",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3cql5/5070ti_do_i_need_a_fan_cable/"
    },
    {
      "id": "1l33qq6",
      "title": "Best budget AMD processor to pair with a 5070?",
      "content": "I'm a bit new to this and I'm trying to build my first pc. Out of my research I was able to learn that bottleneck calculators al bs and I shouldn't be relying on them to find an answer to this question. So I ask you guys and I really wanna know what you think",
      "author": "Objective-Growth-935",
      "created_utc": 1749038482,
      "upvotes": 11,
      "upvote_ratio": 0.77,
      "num_comments": 54,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l33qq6/best_budget_amd_processor_to_pair_with_a_5070/"
    },
    {
      "id": "1l344mx",
      "title": "Need Feedback on My PC Build - Did I Cut Corners Where It Matters? Total Cost: $1493",
      "content": "Hey everyone,\n\nI recently put together a PC build with a budget of $1493, and I’m looking for some feedback. I tried to be as cost-effective as possible (Even buying the different parts from different sellers as to get the best deal), but I want to make sure I didn’t cut corners in critical areas. Here’s what I’ve got:\n\n[PCPartPicker Part List](https://pcpartpicker.com/list/Mrqcv4)\n\n|Type|Item|Price|\n|:-|:-|:-|\n|**CPU**|[AMD Ryzen 7 7800X3D 4.2 GHz 8-Core Processor](https://pcpartpicker.com/product/3hyH99/amd-ryzen-7-7800x3d-42-ghz-8-core-processor-100-100000910wof)|311.91$|\n|**CPU Cooler**|[Thermalright Peerless Assassin 120 SE 66.17 CFM CPU Cooler](https://pcpartpicker.com/product/hYxRsY/thermalright-peerless-assassin-120-se-6617-cfm-cpu-cooler-pa120-se-d3)|37.35$|\n|**Motherboard**|[ASRock B850M-X R2.0 Micro ATX AM5 Motherboard](https://pcpartpicker.com/product/BspD4D/asrock-b850m-x-r20-micro-atx-am5-motherboard-b850m-x-r20)|132.73$|\n|**Memory**|[Silicon Power XPOWER Zenith RGB Gaming 32 GB (2 x 16 GB) DDR5-6000 CL30 Memory](https://pcpartpicker.com/product/4ZCZxr/silicon-power-xpower-zenith-rgb-gaming-32-gb-2-x-16-gb-ddr5-6000-cl30-memory-sp032gxlwu60afdf)|113.36$|\n|**Storage**|[ADATA LEGEND 900 1 TB M.2-2280 PCIe 4.0 X4 NVME Solid State Drive](https://pcpartpicker.com/product/fddG3C/adata-legend-900-1-tb-m2-2280-pcie-40-x4-nvme-solid-state-drive-sleg-900-1tcs)|72.75$|\n|**Video Card**|[Zotac GAMING SOLID OC GeForce RTX 5070 12 GB Video Card](https://pcpartpicker.com/product/QKXMnQ/zotac-gaming-solid-oc-geforce-rtx-5070-12-gb-video-card-zt-b50700j-10p)|648.74$|\n|**Case**|[Antec AX61 ELITE ATX Mid Tower Case](https://pcpartpicker.com/product/k9GhP6/antec-ax61-elite-atx-mid-tower-case-ax61-elite)|52.81$|\n|**Power Supply**|[Deepcool PM850D 850 W 80+ Gold Certified ATX Power Supply](https://pcpartpicker.com/product/pjZXsY/deepcool-pm850d-850-w-80-gold-certified-atx-power-supply-r-pm850d-fa0b-us)|110.63$|\n|Generated by [PCPartPicker](https://pcpartpicker.com) 2025-06-04 08:15 EDT-0400|||\n\nI’m particularly concerned about the balance between performance and cost. Did I make any significant compromises that could affect the overall performance or longevity of the build? Any suggestions for improvements or alternatives would be greatly appreciated!\n\nThanks in advance for your help!\n\n**EDIT:** Since there was some confusion about the prices and the stores I got the items from, I've edited the table to include prices for each item. (The $20 gap is due to some shipping costs and similar fees.) The main source of the items was \"www.tradeinn.com,\" but some items also come from local deals in shops in my region (for example, the CPU). I don’t care about aesthetics at all (seriously, I really don't), and the only reason I got those RGB RAM modules was because I wanted 6000 MHz/CL30 for maximum performance—and they were the cheapest option I found. I really, really appreciate all of the helpful comments and would be glad for more of your helpful opinions and thoughts now that you can see the price brackets.\nThank you again!",
      "author": "Legitimate-Square-21",
      "created_utc": 1749039674,
      "upvotes": 7,
      "upvote_ratio": 0.73,
      "num_comments": 39,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l344mx/need_feedback_on_my_pc_build_did_i_cut_corners/"
    },
    {
      "id": "1l31z89",
      "title": "24\" or 27\" for 1080p monitor?",
      "content": "I wanted to buy a 27\" 1080p monitor but I heard it can be a bad idea because of pixel density. My PC is optimised for 1080p.  What's your opinion?",
      "author": "lukkylc",
      "created_utc": 1749032445,
      "upvotes": 11,
      "upvote_ratio": 0.86,
      "num_comments": 31,
      "flair": "Peripherals",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l31z89/24_or_27_for_1080p_monitor/"
    },
    {
      "id": "1l2fcxh",
      "title": "Just upgraded to the most hated GPU of 2025",
      "content": "I was running an EVGA 3060 ti and upgraded to a triple fan PNY 5070 OC version.  Ran the Deus Ex Mankind Divided benchmark at ultra settings and 2560x1080 resolution.  The monitor is an 29\" VA Acer EI292CUR.  Here are the results:\n\n3060 ti = 73.5/54.5 avg/min fps\n\n5070 = 147.3/102.4 avg/min fps\n\nSo, the 5070 doubled the performance of the 3060 ti.\n\nThe 5070 was purchased from Bestbuy for the MSRP of $549.  I have a Corsair 650W PSU and the 5070 is running just fine with that amount of power.  Note as this PSU is an older model it was necessary to use the included 2x8 pin to 12 pin adapter to connect power to the 5070.\n\nAnother note, the PNY instructions said to remove the VGA driver before removing the old GPU but I skipped that step and had no problems.\n\nI don't have many of the newer games but could run a GTA V benchmark with max settings if anyone is interested.",
      "author": "Psychological-Leg610",
      "created_utc": 1748965682,
      "upvotes": 229,
      "upvote_ratio": 0.75,
      "num_comments": 157,
      "flair": "Build Complete",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l2fcxh/just_upgraded_to_the_most_hated_gpu_of_2025/"
    },
    {
      "id": "1l2tazs",
      "title": "5070 vs 9070 XT for 1440p/UWQHD",
      "content": "Currently I have an RTX 2070 which it’s starting to show it’s age and a 1440p monitor. I’m thinking of getting an Oled UWQHD, but with the monitor I might need to also change the GPU. I want to play AAA games on ultra graphics with Ray tracing and don’t mind stuff like DLSS or frame gen(2x). I know the 9070 XT is closer to the 5070 ti making it more “suitable” for UWQHD, but I know it lacks in ray tracing performance. Also the price difference between the 9070 XT and 5070 is about currently $40-$50.\nIs the 9070 XT a better option because of its better “raw” performance and higher Vram, or is the 5070 enough with upscaling and frame gen? Also which one would be more future proof?",
      "author": "ShaD0w_zNup3r",
      "created_utc": 1749000813,
      "upvotes": 32,
      "upvote_ratio": 0.85,
      "num_comments": 43,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l2tazs/5070_vs_9070_xt_for_1440puwqhd/"
    },
    {
      "id": "1l3wdts",
      "title": "Wanting to \"future proof\" a bit. Can anyone help out?",
      "content": "Hi all! \n\nDue to recent life changes, I have about $1500 that I'm willing/able to use to upgrade my PC. My last PC was built about a decade ago - it has served me really well, but I feel like it's starting to show its age. I have made some upgrades (new CPU/motherboard). That said, with how computer prices are these days, I'm not sure how much of an upgrade I can afford within my budget.\n\nReally hoping to have hardware that's somewhat \"future proof:\" it'll be at least five years before I'm willing to spend on something like this again, and ideally closer to a decade.\n\nCurrent specs:\n\nCPU - 3700 X\n\nGPU - 1070 ti\n\nMotherboard - ROG STRIX B450-F\n\nI figure I can probably get something around a 5060/5070ti. Is that worth it?\n\nThanks!",
      "author": "sophisticaden_",
      "created_utc": 1749121476,
      "upvotes": 2,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3wdts/wanting_to_future_proof_a_bit_can_anyone_help_out/"
    },
    {
      "id": "1l3vzof",
      "title": "Is it possible to run dual GPUs from different brands on a B450M DS3H Motherboard?",
      "content": "1st of all: I don't want financial advice, just technical.\n\nNow, like I mentioned in the title, I have a B450M DS3H Motherboard and I've been using it with a Ryzen 7 1700X and a Radeon RX 570 with a 600W psu. I just bought a GTX 1660 Super that will arrive today (or tomorrow) and it's to replace the RX570. \n\nBUT! I remembered that I read that some people used dual GPUs. I looked around and it seems that it used to be more common than now, but almost nobody does it anymore. Still, if it were possible, I would like to know if I can \"install\" both GPUs. \n\nI honestly don't care much of using both at the same time (I don't game at all, I just don't want to throw away a perfectly fine RX 570 that I can't sell because of how old it is), but I read that if you run a Virtual Machine and you also happen to have two GPUs you can make GPU \"passthrough\" to use one on your host machine and another on your VM (this would be very convenient since sometimes I need to boot into my Windows partition just to use After Effects for some simple stuff for my job, and then go back to my Linux installation).\n\nMy real questions, I guess, are:\n\n* Is it possible to run different dual GPUs on a B450M DS3H Motherboard?\n* If it is, how do I physically install both GPUs on the same mobo?\n* Once installed, will my psu wattage suffice? I tried looking on online tools but none lets me add more than one GPU to the calculator.\n\nIf you read until here, thank you! And if you can help in any way, double thank you!\n\nPS: if it helps clarifying anything, I live in a 3rd world country. Yes, I know my proc and GPUs are old, but this is a first step into upgrading my whole system. ",
      "author": "RedditorAccountName",
      "created_utc": 1749120110,
      "upvotes": 2,
      "upvote_ratio": 1.0,
      "num_comments": 2,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3vzof/is_it_possible_to_run_dual_gpus_from_different/"
    },
    {
      "id": "1l3vs1g",
      "title": "Please help me decide what CPU to get - Intel 14th gen still not trustworthy?",
      "content": "Hey guys, I'm sorry I know similar posts have already been made but I'm hoping that some people will be willing to please help me out anyway\n\nDon't care about upgradeability so was looking to get an Intel i5-14600K but I'm concerned about the issues with it - even though fixes have apparently been done there's still debate about whether it's truly fixed.\n\nPrices (in my country) atm are:\n\n* i5 14600K - $355\n* 9600X - $385\n* 9600 - $359\n* 7600X - $350\n* 7600 - $309\n* 7500F - $300\n\nWhat would you guys get in my position?\n\nThe 14600K has noticeably better benchmarks than all the current AMD alternatives, but will I actually notice that in a game? Will the difference only be like 3 fps?",
      "author": "Total_Speed_61",
      "created_utc": 1749119328,
      "upvotes": 2,
      "upvote_ratio": 0.63,
      "num_comments": 21,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3vs1g/please_help_me_decide_what_cpu_to_get_intel_14th/"
    },
    {
      "id": "1l3v4e1",
      "title": "Asrock B450M and A520M Pro4 compatibility with SSD's?",
      "content": "Hi. So my question is in regards to SSD compatibility with Asrock motherboards, specifically the B450M Pro4 and A520M Pro4 ones.\n\nI've come across multiple cases of people's newish SSD's not being recognized by Asrock B450(M) boards and in one instance the person having contacted their support and being directed to this: [https://www.asrock.com/support/qa/Technical%20NNotes%20-%20Storage%20Device%20Compatibility.pdf](https://www.asrock.com/support/qa/Technical%20NNotes%20-%20Storage%20Device%20Compatibility.pdf)\n\nThe technical note is fairly recent one, dated October 17, 2024, but it doesn't specify which Asrock boards are affected. So is it (still) a thing that good budget SSD's such as Kioxia Exceria Plus G3 and WD SN580 don't work on some Asrock boards? I tried going through PC PartPicker builds with B450M Pro4 and A520M Pro4 boards, and they all seemed to have some older SSD. Both boards are very highly rated on Amazon and such, so you'd think such compatibility issues would've been more prominently featured on user reviews, but I'm just not sure anymore.\n\nSo anyone with actual experience or knowledge on this particular subject? Help would be much appreciated.",
      "author": "suprassed",
      "created_utc": 1749116851,
      "upvotes": 2,
      "upvote_ratio": 0.75,
      "num_comments": 4,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3v4e1/asrock_b450m_and_a520m_pro4_compatibility_with/"
    },
    {
      "id": "1l3thdv",
      "title": "Which CPU for RTX 5070ti?",
      "content": "Hi everyone, I was planning on upgrading my current GPU (GTX 1080 8gb) into an RTX 5070ti. Obviously I also have to change CPU (currently i7 8700k which would give me bottleneck) and therefore MOBO because mine doesn't support am5 sockets.   \n  \nI was planning on getting a ryzen 9 7900x but I know some people who bought it and regretted not getting a ryzen 7 7800x3d instead.   \nOther people suggest getting a ryzen 7 7700 at 170€ from aliexpress and save the money for a bigger upgrade in 2-3 years.\n\nAny advice? ",
      "author": "21elia_",
      "created_utc": 1749109928,
      "upvotes": 2,
      "upvote_ratio": 0.75,
      "num_comments": 5,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3thdv/which_cpu_for_rtx_5070ti/"
    },
    {
      "id": "1l3wikg",
      "title": "Idk what’s happening",
      "content": "So this is my first build, i wanted to turn it on but as soon as i put the psu kabel in the pc my ram led’s turn on without pressing the power button to start the pc up. It also makes a weird soft beeping zooming noise.\nAnyone that could help me out please? I can send a video in messages if needed. Can’t post vids in here\n",
      "author": "ScallionPuzzled8852",
      "created_utc": 1749121947,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3wikg/idk_whats_happening/"
    },
    {
      "id": "1l3whw9",
      "title": "GPU shows lines, and flickers the display, but works perfectly fine after a restart.",
      "content": "We have an ROG STRIX RX 5700 that works fine, but if the computer was completely shut down from the power supply, then it starts, it shows lines along the sides on the display, then the display flickers.\n\nWe tried reinstalling the drivers (AMD software version 25.5.1, driver version 32.21001.9024), but the issue persisted. It's not overheating, because the GPU only reaches 83°C.\n\nIt would only stop that when we restart the machine. Then it works perfectly fine without any issues. \n\nWhat could have caused this? Is it a problem with this exact driver version? Is it a problem that happens with this exact model? Is the GPU failing? \n",
      "author": "OmerKing916",
      "created_utc": 1749121881,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3whw9/gpu_shows_lines_and_flickers_the_display_but/"
    },
    {
      "id": "1l3whew",
      "title": "Help me choose a GPU",
      "content": "So im building a new PC thats mainly going to be used for 1080p esport and occasionally some singleplayer games\nAlso my monitor is 180hz 1080p.\nI have a \nCpu - Ryzen 5 7600 \nMotherboard - Gigabyte b650m s2h\n32 gb ram dddr5\n\nI dont really care if its nvidia or radeon.\n\nThanks!\n\n\n\n",
      "author": "BadVVolfa",
      "created_utc": 1749121832,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3whew/help_me_choose_a_gpu/"
    },
    {
      "id": "1l3w6bf",
      "title": "How to set up refurbished laptop SSDs etc",
      "content": "I posted yesterday but couldn't respond to the answers I got, so posting again \n\nI am about to buy my first refurbished laptop which has a 256 SSD.  I currently have a 512 SSD in my current laptop.\n\nWhat I want to do is install windows from the new laptop, but obviously transfer everything (including virtual comp Linux set up if possible) from my old laptop.  I initially thought about using the old 512 SSD in the new laptop but I'm worried I might mess something up/lose data so I'm happy to buy another SSD if I have to.\n\nI'm reading lots of things about installing fresh copies of Windows (not even sure what that means), formatting SSDs and now, all these other things I might need to do to make sure the refurbished laptop is 'safe' to use etc and I'm getting concerned that I am not going to be able to do it right, as I find some of it confusing \n\nIs this process manageable for a tech novice? And what would be the simplest way to do it?\n\nMy biggest concern right now is how to use Windows from the new SSD, but obviously get the data from the old SSD onto the new laptop.\n\nIs it possible to say replace the windows files on the old SSD with the windows files on the new SSD and just put the old SSD into the new laptop?  I ask this because the biggest problem I have is how to use the version of Windows which comes with the new laptop, but also copy over everything I need from my old SSD \n\nGrateful for any advice.. ",
      "author": "DellBottoms",
      "created_utc": 1749120760,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3w6bf/how_to_set_up_refurbished_laptop_ssds_etc/"
    },
    {
      "id": "1l3w666",
      "title": "ARGB Controllers",
      "content": "Hello, I was wondering if anyone knew of any quality aRGB controllers with a good number of ports on them. It does not need to be a 4-pin PWN fan hub, I’m looking for one for aRGB. Other than Nollie, are there any other good controllers out there that have 10+ ports? I’m working with a full case with a fair number of fans and an aRGB air cooler.\n\nDoes anyone have any good recommendations for aRGB controllers? ",
      "author": "Stargazer-Helios-11",
      "created_utc": 1749120748,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3w666/argb_controllers/"
    },
    {
      "id": "1l3w5yv",
      "title": "Need advice on what to upgrade",
      "content": "I've had my PC for a little over six years now and I wanted to get some new harddrives (Have been using a 500 GB SSD and an additional 2 TB HDD for things not needed as often and want to switch to using only SSDs.)\n\nAs these things go, this got me thinking about upgrading some more. The GPU would be what I would start with, but I need some advice if sticking to the CPU and Motherboard are even worth it at this point or if a new build would be more sensible. Here is what I have: \n\nCPU: AMD Ryzen 5 2600 6x 3.40GHz\n\nGPU: NVIDIA GeForce GTX 1660\n\nMotherboard: B450 TOMAHAWK\n\nPSU: Corsair CX550\n\nCurrently running with 16GB DDR4 RAM",
      "author": "100dolphins",
      "created_utc": 1749120727,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3w5yv/need_advice_on_what_to_upgrade/"
    },
    {
      "id": "1l3w1ja",
      "title": "Unsure what to upgrade (Monitor vs PC parts vs consoles)",
      "content": "Apologies if this question is unrelated to this subreddit but I wasn't sure where to post it.\n\nI have a 24\" 1080p IPS 240hz where I've been using it with my PC, PS5 original and Switch OLED. I was wondering if upgrading to an 27\" 1440p OLED is a worthwhile upgrade over upgrading my current PC parts or consoles (to PS5 Pro/Switch 2).\n\nMy current specs for my PC are as follows:\n\n* GPU: Strix 3080 10GB\n* CPU: 5900X\n* RAM: 32GB 3600MHz\n* PSU: Corsair AX1000\n\nIn relation to budget, I can only do one upgrade for now (i.e. pick monitor, PC parts or consoles). I use all devices equally and I don't have much preferences when it comes to gaming on which platforms.\n\nThanks and I appreciate your assistance.",
      "author": "Fozzeneric",
      "created_utc": 1749120299,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 2,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3w1ja/unsure_what_to_upgrade_monitor_vs_pc_parts_vs/"
    },
    {
      "id": "1l3w04y",
      "title": "I can't change my white Galax 5070 Ti's RGB colors no matter what i do.",
      "content": "I bought a 5070 Ti from Galax a couple months ago. I saw alot of people changing the RGB colors of the GPU but i can't do the same. I tried Xtreme Tuner App (which is the one in the Galax's official website), Signal RGB, which a lot of ppl recommended for various RGB things and both didn't work at all. ",
      "author": "733116",
      "created_utc": 1749120157,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3w04y/i_cant_change_my_white_galax_5070_tis_rgb_colors/"
    },
    {
      "id": "1l3vqsr",
      "title": "help me upgrade my pc?",
      "content": "is my pc out of date\n\nI have a ryzen 7 3700x,  rtx 3070 gpu, 16gb ram, 1tb hdd, 500gb ssd m.2 \n\nIs this a good setup in 2025 and what would you look at upgrading first?\n\nany help would be appreciated",
      "author": "eminemsgoat",
      "created_utc": 1749119197,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 5,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3vqsr/help_me_upgrade_my_pc/"
    },
    {
      "id": "1l3vo0q",
      "title": "Upgrading GPU from rtx3060 to rtx5070",
      "content": "Hey guys do you think it is worth to pay €630 for rtx 5070?\n\nI've been trying these new skyrim modlists lately, and they are insanely good, only problem is my 3060 is half assing it at 30-40fps @ 1080p which is not optimal in my opinion.",
      "author": "shamiro",
      "created_utc": 1749118910,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 2,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3vo0q/upgrading_gpu_from_rtx3060_to_rtx5070/"
    },
    {
      "id": "1l3vf4k",
      "title": "Is this a good UPS to get?",
      "content": "I'm thinking of getting the Eaton a 1500 VA 900 W UPS for my rig, as my previous APC 1200VA 650W UPS just dies the minute power goes out. I'm not sure if this is due to a defect in the unit itself or overdraw. However I'm not sure if the Eaton is enough or too much.\n\n  \nMy PC has a ryzen 5600x,  4080 super, 32gb ddr ram, 1 1tb SSD, 2 4tb HDDs, 3 fans, and one NHD-15 noctua CPU cooler.  I have one mech KB, one mouse, a 42\" LG C2 TV as a monitor, an IFI zen DAC and an HD600 as peripherals. I can be persuaded to not plug in the TV into the UPS. I just want my UPS to give me a few minutes to shut my PC down when power goes out, I don't need it to power my rig beyond 3 minutes. Any help is appreciated.",
      "author": "Borsch3JackDaws",
      "created_utc": 1749117991,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 4,
      "flair": "Peripherals",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3vf4k/is_this_a_good_ups_to_get/"
    },
    {
      "id": "1l3uyf0",
      "title": "bon plan ?",
      "content": "es que cette configuration est bien pour des jeux comme Inzoi ou gourmand en graphique ?\n\n* 1 x Montage PC VIP + Installation de Windows \n*  1 x Microsoft Windows 11 Famille - 64 bits (version Clé USB)\n*  1 x DDR5 Kingston Fury Beast - 32 Go (2 x 16 Go) - 5600 MHz - CAS 36\n*  1 x AMD Ryzen 7 7700 (3.8 GHz)\n*  1 x be quiet! Pure Power 12 M - 750W\n*  1 x MSI PRO B650-S WIFI\n*  1 x INOVU FM 1600 - Blanc\n*  1 x Kingston NV3 1 To\n*  1 x MSI MAG CORELIQUID A13 Blanc - 360 mm\n*  1 x Aerocool P500C - Blanc\n*  1 x MSI GeForce RTX 5070 VENTUS 2X OC\n*  1 x Advance GTA 220 - Noir (AZERTY)\n*  1 x MSI MAG 255XF\n* le tout pour 2130 euros environ ",
      "author": "Clemax2709",
      "created_utc": 1749116192,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 0,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3uyf0/bon_plan/"
    },
    {
      "id": "1l3uvrl",
      "title": "ASRock B850M Pro-A WiFi or MSI B650M GAMING PLUS WIFI",
      "content": "Price this same 145€.\n Setup: Ryzen 7700, Thermalright Peerless Assassin 120 SE, Lian Li DAN A3",
      "author": "exyvL",
      "created_utc": 1749115888,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3uvrl/asrock_b850m_proa_wifi_or_msi_b650m_gaming_plus/"
    },
    {
      "id": "1l3ut0s",
      "title": "First PC build in 10 years - feedback appreciated! (9070 xt build)",
      "content": "After 10 years, I'm looking to replace my current build (GTX 980 ti, i7-4790K, 16GB RAM) with something that can hopefully last the next 10 years. I am based in the UK\n\nMy budget is around £2000 but I am flexible if there are any good swaps that will help the build last longer - I am very much interested in future proofing this build.  I'm not married to any brands, perhaps except NZXT \n\nI would appreciate a general review of the build. \n\nCouple of quick questions:  \n\n* is a 750W PSU sufficient?\n* I don't fully understand the differences between all of the 9070 xt cards/manufacturers , I picked this one as it seems reasonably priced. Should I be looking at any alternatives? \n\n[https://uk.pcpartpicker.com/user/LMedza/saved/9ZbJt6](https://uk.pcpartpicker.com/user/LMedza/saved/9ZbJt6)\n\nAny thoughts would be much appreciated!\n\n",
      "author": "Medza",
      "created_utc": 1749115569,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 11,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3ut0s/first_pc_build_in_10_years_feedback_appreciated/"
    },
    {
      "id": "1l3u66c",
      "title": "Need advice with upgrade",
      "content": "A couple years ago i bought a prebuild knowing only a little about pc parts. I noticed while gaming my pc keeps getting hotter and hotter by the day so I thought it was time to look into upgrading it. the site I bought it from didn't give me a detailed list of parts so I'm sorry if the specs are unclear.\n\n* Motherboard: AMD B550GTQ\n* CPU: AMD Ryzen 7 5700X\n* GPU: Nvidia Geforce RTX 4060 8GB\n* RAM: 128GB DDR4 (I use all 4 slots)\n* SSD: 4TB M.2 SSD\n* Case: Sharkoon TK4\n* Cooler: BOX\n* Power: 600 Watt - (80Plus)\n\nI was looking to upgrade my case and cpu cooler.\n\nI got recommended:\n\nCase: Fractal Design Meshify 2 Compact\n\nCpu Cooler: Noctua NH-U12S chromax black\n\nAre these decent upgrades or should i look for others (if so which ones)\n\n(Note: I do not care for looks or RGB. i just want to play more carefree)",
      "author": "selfdoubter101",
      "created_utc": 1749112882,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 5,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3u66c/need_advice_with_upgrade/"
    },
    {
      "id": "1l3u5ov",
      "title": "Help me improve my part list",
      "content": "[https://de.pcpartpicker.com/list/wgPbfd](https://de.pcpartpicker.com/list/wgPbfd)\n\nMy friend wants a new PC primarily for gaming. His Budget is 1000-1500€. I put this together but I've been out of the game for a while, so any input is very welcome :)\n\nI'm especially unsure with the processor choice, I've read that the 7900x is overpriced for gaming. Maybe I could use another one and squeeze in a better graphics card?",
      "author": "Dr_4gon",
      "created_utc": 1749112827,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 8,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3u5ov/help_me_improve_my_part_list/"
    },
    {
      "id": "1l3m7z2",
      "title": "First Full PC Build – Would Love Your Thoughts Before Final Assembly!",
      "content": "Hey all! First time posting here, and I’m finally pulling the trigger on my own custom build after years of sticking with prebuilt or budget machines. Would love to hear any feedback or suggestions before I finish assembly as it’s something I’m boutta cross off my bucket list!! Trying to balance gaming, maybeeee streaming, light 3D work for fun (Blender/C4D), and general multitasking.\n\nHere’s the current build I’m going for that best suits my needs:\n\nCPU: AMD Ryzen 7 7700X\n\nCPU Cooler: Noctua NH-D15 chromax.black\n\nGPU: Gigabyte Radeon RX 7600 XT GAMING OC 16GB\n\nMotherboard: Gigabyte B650 Gaming X AX v2\n\nRAM: G.Skill Flare X5 DDR5-6000 (2×16GB)\n\nStorage: Crucial P3 Plus 2TB NVMe Gen4\n\nPSU: MSI MAG A750GL PCIE5 80+ Gold (Fully Modular)\n\nCase: NZXT H7 Flow (Black)\n\nCase Fans: Arctic F12 5-pack (PWM, Black)\n\nCPU/MOBO/RAM I’m getting from Micro Center as a bundle for $399.99!! Thought that was a hell of a deal ngl\n\nMain Uses:\nGaming (Warzone, Battlefield, AC: Shadows, Battlefront 2, Ready or Not to name a few)\n\nLots of multitasking (Discord, Spotify, Chrome for work… the basics yk? 🤣)\n\nConcerns:\n\nI only have a TV that maxes at 60Hz, but I’ll likely move to a 1440p 144Hz monitor soon. Just have limited space in my small room so working with what I got for now. Any recommendations here would be appreciative!\n\nI know the NH-D15 is a big boy — already confirmed it fits in the H7 Flow, but curious if anyone has  firsthand experience with sagging long-term or clearance issues.\n\nGPU clearance should be fine (checked case specs), but if anyone has run this combo and ran into issues, I’m all ears.\n\nThinking about adding a secondary HDD later on for archived games — open to suggestions on the best bang-for-buck 2TB+ options.\n\nAny feedback is welcome — thermal paste considerations, fan placement advice, or even just moral support as I prepare to build this beast 😂\n\nThanks in advance!\n",
      "author": "Primary_Brain_9790",
      "created_utc": 1749084940,
      "upvotes": 4,
      "upvote_ratio": 0.99,
      "num_comments": 3,
      "flair": "Build Ready",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3m7z2/first_full_pc_build_would_love_your_thoughts/"
    },
    {
      "id": "1l3tpet",
      "title": "Does the i5-14400f make sense at this price?",
      "content": "I would like to upgrade my aging existing desktop. Can get a motherboard and cpu combo of an MSI H610 DDR4 board with the Intel i5-14400f for a bit less than 170 euro. On paper seems like a reasonable deal? Already have a nice set of DDR4 3200Mhz ram which this mobo supports. \n\n  \nNot much of a gamer so it is more for general productivity, but do play an occasional game. Have an RX 580 8Gb for such times (I know, also really showing it's age).",
      "author": "LeFlubbes",
      "created_utc": 1749110834,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 5,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3tpet/does_the_i514400f_make_sense_at_this_price/"
    },
    {
      "id": "1l3tfla",
      "title": "Which GPU",
      "content": "Rtx 5070 or 7800xt",
      "author": "Infinite-Ad7127",
      "created_utc": 1749109725,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 5,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3tfla/which_gpu/"
    },
    {
      "id": "1l3squg",
      "title": "CPU and Ram Allocation in Proxmox?",
      "content": "Hello All,\n\nI am building a mini PC from Minisforum MS-01 with i9-12900H, 32GB ram and 1TB NVMe only.\n\nI have already installed Proxmox as my hypervisor and plan to run the following VMs:\n- Window 11 Pro\n- Ubuntu\n- pfSense with Snort\n- TrueNAS\n- Maybe Veema \n\nHow should I allocate the CPU (# of cores?) and RAM?\n\nAny advise will be appreciated.",
      "author": "WinterDue530",
      "created_utc": 1749106941,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 0,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3squg/cpu_and_ram_allocation_in_proxmox/"
    },
    {
      "id": "1l3m16m",
      "title": "Need help with some part alternatives",
      "content": "Hi,\n\nI plan on building my PC at earliest this month or next month at latest. It doesn’t look like the ARCTIC Liquid Freezer III 420mm is in stock and I planned on using that as my AIO for my 9950x3d (parts list here: https://pcpartpicker.com/list/zw8VTM). I saw some people saying to go with the Lian Li Galahad II Lite, but I’m not sure if that’s a good idea or not for my case (the new Fractal Meshify 3 XL). What would be a good alternative for the Liquid Freezer III 420mm for my setup if not the Lian Li I mentioned?\n\nAdditionally, my setup would include the AIO radiator fans up top as exhaust, the front three 140mm stock fans as intake and one fan opposite that at the back for exhaust. However, the ARCTIC P12 Max is also out of stock. What would be a good alternative for that?\n\nThanks so much.",
      "author": "Cheesehead1267",
      "created_utc": 1749084378,
      "upvotes": 3,
      "upvote_ratio": 0.8,
      "num_comments": 9,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3m16m/need_help_with_some_part_alternatives/"
    },
    {
      "id": "1l3s5zc",
      "title": "Should I upgrade my cpu or gpu?",
      "content": "My game lags whenever I record on obs and freezes briefly (3-5secs) when I try to edit on premiere pro. I have a AMD Ryzen 5 2400g and a AMD Radeon 5600XT. Im leaning towards a better cpu to handle these tasks better but don’t know which one to get. My MOBO is a micro ATX Asus GL10DH.\n\n\nThanks for reading and grateful for all your help!",
      "author": "sunderedsky",
      "created_utc": 1749104671,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 17,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3s5zc/should_i_upgrade_my_cpu_or_gpu/"
    },
    {
      "id": "1l3oad3",
      "title": "If a PC keeps crashing after 48+ hours running 24/7, but doesn't crash in normal day to day use, would you just use and not continue to diagnose?",
      "content": "Built a PC with the following components: 3600, RX 6800, Aorus B550i Pro AX, 16 GB Corsair LPX 3600 C18 kit, Cooler Master 650W PSU and a Corsair AIO.  GPU is running with a riser in a Meshroom S V2 case.  We are also running the latest BIOS version possible for the mobo.\n\nAs part of a testing regimen we usually leave the PC running for at least 72 hours to test for stability.  We don't do anything unusual within these hours, just normal usage, the only difference is the PC is not shut down.  We find that with this setup we can't get past 48+ hours without it crashing at least once.\n\nThe event viewer (before yesterday) seems to consistently give this error:\n\nGetCACaps\n\nGetCACaps: Not Found\n\n{\"Message\":\"The authority\\\\\"amd-keyid-907d65e9b562315997dd5ad086b2b7598957b92c.microsoftaik.azure.net\\\\\"does not exsit.\"}\n\nNot fully sure of what this was, we tried these things:\n\nRun RAM at 3600 MHz (blue screen)\n\nRun RAM at 3200 MHz (crash after 48+ hours)\n\nRun RAM at 3000 MHz (crash after 48+ hours)\n\nRun RAM at 2133 MHz (crash after 48+ hours)\n\nDDU GPU driver, re-install drivers (crash after 48+ hours, did this with each RAM frequency change above)\n\nThe latest run now after DDU also crashed on us, but the error logs don't give any reference to anything anymore, except say \"unexpected crash\".\n\nAt this point these are the only things we haven't done:\n\nReplace GPU riser cable\n\nReplace RAM sticks with different set\n\nReplace CPU\n\nRe-install Windows\n\nBefore we do anything more, obviously we know there's something wrong with the PC, but we also know most people won't leave the PC running for 24 hours.\n\nWe just need some advice here, what's the most likely culprit for these crashes, and is it worth chasing it down knowing it won't really crash in normal use?  The rig can run normally anything (benchmarks, games, etc.) without crashing as long as we don't leave it on for more than 48 hours.\n\nSorry for the long post, would appreciate any advice.\n\nTLDR:  PC can't reach 72 hours left on 24/7 without crashing, but ok on normal use.  Can't diagnose why; wondering if it's worth pursuing the issue or just use as is.\n\n  \nEDIT:  By the way our first suspect is that the RAM sticks are faulty because activating XMP usually results in an immediate blue screen on boot.  So I guess that's the reason why even at 2133, the rig will crash but I am not totally sure.  Hoping the issue resolves after changing to a different kit.\n\nEDIT2:  Want to clarify my comment about leaving PCs on 24/7, I meant not everyone may do that.  Didn’t mean to generalise.",
      "author": "blazerMFT",
      "created_utc": 1749091123,
      "upvotes": 2,
      "upvote_ratio": 0.75,
      "num_comments": 11,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3oad3/if_a_pc_keeps_crashing_after_48_hours_running_247/"
    },
    {
      "id": "1l3s4he",
      "title": "M2 screw broke",
      "content": "Hi all,\n\nNever thought I would be here for such topic after so many PC's that I have built but here we are.  \nYesterday during instalation of the M2's I have somehow broken the screw, do you guys know what could be done here to possibly fix this? \n\n  \nFor now it's not big of a deal, because it broke on the PCI 5 slot which I don't have use for yet, but eventually I'd like to use it ;)\n\n  \n[imgur.com/a/36OtQq7](http://imgur.com/a/36OtQq7)",
      "author": "Arthevariel",
      "created_utc": 1749104502,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3s4he/m2_screw_broke/"
    },
    {
      "id": "1l3ktac",
      "title": "Help! Frames stuttering with discord and game open",
      "content": "As title suggests I’m encountering some stuttering In game and I’m not quite sure what to do. What really confuses me is early in game (several hours of progress) there was no stuttering whatsoever? Is it something wrong with my specs?\n\nSpecs are as follows:\n\nGTX 1650\ni7-900 CPU\n\nNot really sure what else to look for? If you need more info to go off please ask and I’ll find it",
      "author": "averysoggypotato",
      "created_utc": 1749080815,
      "upvotes": 3,
      "upvote_ratio": 0.8,
      "num_comments": 4,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3ktac/help_frames_stuttering_with_discord_and_game_open/"
    },
    {
      "id": "1l3km12",
      "title": "Should i settle for worse?",
      "content": "Soo im pretty new to PC building since im 14. My dad has been helping me build my first ever pc. I currently have:\nRX 570 4GB\nRyzen 5-5600\n16GB DDR 4 2133Mhz RAM\nB550 PHANTOM GAMING 4 Motherboard\n27\" 1080P Full HD Monitor\n\nAnd a bunch of fans inside the case as usual.\nNow, i've purchased my cpu about a month ago and its great, plus new RAM is on the way (3600mhz to be exact). But, of course, i want an new GPU. now, i have been researching and i initially wanted to get an RX 6600 but it is pretty expensive. So i was wondering if i should get an new GTX 1660 Super for 80€, and settle for that for a while until i save up and get an newer GPU, or if i should save up more and get the RX 6600.",
      "author": "vazdusnimjehur",
      "created_utc": 1749080241,
      "upvotes": 4,
      "upvote_ratio": 0.83,
      "num_comments": 7,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3km12/should_i_settle_for_worse/"
    },
    {
      "id": "1l3n6d7",
      "title": "Fans doesn't turn off when power off the pc.",
      "content": "I have a motherboard GA-AB350M-DS3H V2 its only have a 2 4pin pwm connectors for fans (CPU\\_FAN and SYS\\_FAN) i add an ID-COOLING Fan Hub HA-08 for more fans (6 total); cpu fan its connected to the CPU\\_FAN motherboard connector and the fanhub to the SYS\\_FAN motherboard connector and since i add the fanhub when i shutdown the system the fans and rgb keeps on including the cpu and gpu fans and rgb. i have no idea what could it be or how to make them to power off when shoutdown the system.\n\nI check bios settings (it has the lattest bios version install) and change ERP enable (it wasnt) and dissable wake on lan but didnt help.",
      "author": "Muted_Funny_7971",
      "created_utc": 1749087770,
      "upvotes": 2,
      "upvote_ratio": 0.75,
      "num_comments": 3,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3n6d7/fans_doesnt_turn_off_when_power_off_the_pc/"
    },
    {
      "id": "1l3k7pw",
      "title": "CPU and GPU hitting almost 90 degrees Celcius / 185 Fahrenheit",
      "content": "My PC temp sometimes peaks at almost 90 degrees Celcius / 185 Fahrenheit when idle and up to 100 or more when under heavy load. This is both for my CPU and GPU.\n\nI have an RTX 2060 Super GPU paired with an Intel I9 11900K CPU.\n\nFor a case I use the Corsair Omega RGB case and for CPU cooling I use Coolermaster's 120 liquid.\n\nAny ideas what might be wrong or what I can do to fix this?",
      "author": "Former-Blackberry290",
      "created_utc": 1749079123,
      "upvotes": 3,
      "upvote_ratio": 0.8,
      "num_comments": 10,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3k7pw/cpu_and_gpu_hitting_almost_90_degrees_celcius_185/"
    },
    {
      "id": "1l3qxpb",
      "title": "Bought a Redragon keyboard, starting to regret my decision. Suggestions on new keyboard?",
      "content": "I bought a Redragon K556 PRO and reviews looked great. Price point was good, affordable, but not bottom of the barrel. So it should be good. For the most part. The metal casing is nice, the buttons feel great, nice strong colors and light schemes when they work.\n\nBut I'm starting to hate it. I bought a new keyboard because I wanted wireless. My keyboard before was great, but my pc sits on the same desk as my work pc and the cord wasn't quite long enough to be comfortable.\n\nMy issues with this keyboard are a few.\n\n\\-The downloaded program sucks. It allows you to change the RBG style and how the colors change, but only while it's plugged in, and even then, the program HAS to stay open for them to take affect. I don't care too much about the color schemes, but the music matching one is cool and would love to use it, but it's not feasible to use it if it has to be plugged in. And this is the ONLY thing the program lets you do. No key binds, macros, nothing else.\n\n\\-It constantly turns itself off to 'save power', leaving me groping around in the dark to hit a button to get it to turn back on. Not too much of an issue, but in a dark room, it sucks. AND it happens every 20-30 seconds. Regardless if it's plugged in or not. On top of that, there's a short 2 second delay before a key will register. So if I'm reading something or doing something for work, or watching a long cutscene in a game and have to jump into combat, it's annoying. not end of the world, but annoying as hell. I am unable to change any of this. I've changed settings in my device manager to prevent turning off to save power, but apparently this is in the keyboard itself, not my pc. So I can't prevent it.\n\nI paid around $80 I think, and I will take the loss and just spend more to buy something better.\n\nWhat wireless backlit keyboards are yall using? I'll pay more for something that is used and trusted by more people. I mostly game, so that's my main use for the keyboard. Hell, I'll even just figure out a USB cable extension and go back to my old keyboard if I must.",
      "author": "threeaxle",
      "created_utc": 1749100030,
      "upvotes": 1,
      "upvote_ratio": 0.57,
      "num_comments": 8,
      "flair": "Peripherals",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3qxpb/bought_a_redragon_keyboard_starting_to_regret_my/"
    },
    {
      "id": "1l3qg33",
      "title": "Building a budget gaming pc",
      "content": "https://pcpartpicker.com/list/rJr2Nz\n\nHello friends \nThis is the first time ever doing this , building my own pc , I usually go through the internet and find a pre built pc . I would like your opinions on my selection please . Thank you 🙏",
      "author": "TruthOriginal7615",
      "created_utc": 1749098304,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 2,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3qg33/building_a_budget_gaming_pc/"
    },
    {
      "id": "1l3qepn",
      "title": "Can I program my fans to reach a certain PWM if my CPU gets too hot?",
      "content": "Hey, everyone. I have an Asus motherboard, so I use Armoury Crate for my Ryzen 9 9900X CPU (along with a Sapphire Nitro+ 9070 XT, 32GB RAM, if these are at all relevant), so I use Asus' Armoury Crate as a result. I've been monitoring my PC's performance more closely while playing games and found that my CPU gets up to 86 degrees C. Supposedly that's safe, but it's a little too high for my liking.\n\nThe only thing I could think to do in the meantime is manually programming these PWM fans to blast at full speed (Quiet, Standard, and even Turbo speed options aren't effective in keeping it under 86) while I play, as that's the only speed that can get that thing down (and down to 62 degrees average, which is great).\n\nBut I don't want to keep manually doing this thing long term if I can help it. I've looked all over and can't find a good answer. Can I auto set my fans' RPM to go at a level between Turbo and Full Speed the moment this CPU reached 85 degrees? I've tried dragging those things on the X- and Y-axis and that didn't do anything.\n\nAll opinions/help welcome. Thanks!\n\n\\*EDIT\\*\n\nKnew I'd forget something. Actual details for case/cooling setup:\n\n\\-Lian Li Lancool II Mesh tower\n\n\\-Noctua NH-U12A air cooler\n\n\\-two 140mm fans in front of case (intake), two 120mm fans on the bottom (intake), two 140mm fans up top (exhaust), one 120mm in back of case (exhaust)",
      "author": "Reasonable-Sir-6405",
      "created_utc": 1749098170,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 5,
      "flair": "Discussion",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3qepn/can_i_program_my_fans_to_reach_a_certain_pwm_if/"
    },
    {
      "id": "1l3m2za",
      "title": "Upgrade from 1080 Ti to 7700 XT or 9060 XT",
      "content": "Now that reviews for the 9060 XT are out, I was wondering whether it'd be better to upgrade to the 7700 XT 12GB or try grab a 9060 XT 16GB at MSRP tomorrow. Obviously, I'm not sure if I'll even be able to get one at MSRP tomorrow but I can see a listing for a 7700 XT for £330 and I thought it might be better to go with that. \n\nIf it's relevant my specs for my PC are below:\n\nMotherboard: msi mag b550 tomahawk atx\n\nCPU: 5700X3D\n\nGPU: 1080 Ti\n\nPSU: 650w \n\nMonitor: 1080p\n\n\n\nWhat are your guys' thoughts? ",
      "author": "JomojoXD",
      "created_utc": 1749084528,
      "upvotes": 2,
      "upvote_ratio": 0.75,
      "num_comments": 11,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3m2za/upgrade_from_1080_ti_to_7700_xt_or_9060_xt/"
    },
    {
      "id": "1l3q1wc",
      "title": "What is a CPU that is good enough to work with the AMD Radeon RX 7600XT",
      "content": "I'm planning on building a new pc after my old one stopped working properly. I decided on the Radeon RX 7600XT for my GPU but I'm not sure what I should go for CPU wise. I'm looking to get a one that's as cheap as I can get away with while still getting reasonably fast. This is my first time building a computer myself so forgive me if this is a dumb question.",
      "author": "Trash_Panda2344",
      "created_utc": 1749096915,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 6,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3q1wc/what_is_a_cpu_that_is_good_enough_to_work_with/"
    },
    {
      "id": "1l3po6b",
      "title": "Stupid question but, after a test boot outside of pc case how do i turn the pc off safely?",
      "content": "as the title says how do i safely turn the pc off after test boot when building?\n\ncan i just turn the psu off?\n\nhaven't built a pc in a while and just free balled it without the test boot for my own builds but gonna build a pc for my buddy and want to test it all first.\n\nedit: damn yall are quick thank you for the help!",
      "author": "nickw1372",
      "created_utc": 1749095638,
      "upvotes": 1,
      "upvote_ratio": 0.6,
      "num_comments": 9,
      "flair": "Solved!",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3po6b/stupid_question_but_after_a_test_boot_outside_of/"
    },
    {
      "id": "1l3pmkl",
      "title": "PC case fan configuration",
      "content": "Hi, I just built my first PC but I am having trouble with the case fans. When playing games the fans get loud and I have no idea why. They are all linked but to the Deepcool SC790. However, I think it’s because of the fan configuration. The fans I have are the TC-12C thermaltake fans and the configuration I have is rear to be exhaust (the clear non-grille side faces the inside) the top 2 fans to be exhaust (the grille faces inside the case) and the 2 fan AIO COOLER (side mounted, the clear non-grille side faces inside the case) as intake and the bottom 1 as an intake as well ( grille side up inside the case). Im going for a little bit of aesthetic if I can but if not it’s ok. I was thinking about having my AIO mounted on the top but then it would have to be exhaust. Which I don’t want because I would like to keep my CPU cool and not warm. Please let em know, if this is correct or if I need to change something’s around. I am open to any suggestions!",
      "author": "Independent-Age-1967",
      "created_utc": 1749095483,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 1,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3pmkl/pc_case_fan_configuration/"
    },
    {
      "id": "1l3pa2u",
      "title": "First Time PC Builder",
      "content": "Hello! I've been looking around, thinking it's finally time to go from pre-built PCs to finally building one of my own. I have a few friends who have built computers before and gave me some tips for my first computer. My budget is around 3,000 USD; I want it to be able to handle a good chunk of gaming. [https://pcpartpicker.com/list/sHbMdb](https://pcpartpicker.com/list/sHbMdb)\n\n",
      "author": "Tough-Choice-467",
      "created_utc": 1749094311,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 6,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3pa2u/first_time_pc_builder/"
    },
    {
      "id": "1l3kcjf",
      "title": "Best GPU for Ryzen 5 7600x",
      "content": "Hello, I've been trying to put together my own PC but I know absolutely nothing about them. After some research I learned that my CPU and GPU are the most important items I think? I decided that I would get the Ryzen 5 7600x but I don't know what GPU would work well with that. I've also been using  pcpartpicker to help me but Im clueless. If you any other recommendation for any other parts as well please lmk :)",
      "author": "Lazy_Victory2935",
      "created_utc": 1749079489,
      "upvotes": 2,
      "upvote_ratio": 1.0,
      "num_comments": 2,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3kcjf/best_gpu_for_ryzen_5_7600x/"
    },
    {
      "id": "1l3ooa0",
      "title": "Upgrading a Prebuilt PC",
      "content": "Hi all,\n\nI'm currently working with a prebuilt gaming tower and I'm looking for suggestions on how to upgrade it so I can play some games like Elder Scroll Oblivion without shuttering like crazy.\n\nMy current build is\n\nMotherboard: A320M-S2H-CF\n\nCPU: Ryzen 5 3600 6-core 3600 mhz\n\nGPU: Radeon RX 5600XT (6gb)\n\nRAM: 16 GB : Ripjaws V DDr4 3200mhz 8gb (x2)\n\nMoney's a bit tight but I'm not really sure where to begin upgrading this PC because I was looking to potentially just go straight to 5060 ti that way I won't need to upgrade GPU for a while but I don't know if it'll bottleneck and hurt my pc if I go that far. ",
      "author": "Aston_Wise",
      "created_utc": 1749092351,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 2,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3ooa0/upgrading_a_prebuilt_pc/"
    },
    {
      "id": "1l3o15e",
      "title": "Help me decide if I should upgrade the motherboard & CPU or just the GPU for now.",
      "content": "I have an R7 5800x cpu and the motherboard only takes AM4 so I will need a new motherboard if I were to upgrade my CPU. \n\nAs for my GPU I have an RTX 4060 zotac. \n\nWhat I want to do is be able to play most or all games in 4K at least 60fps on high or ultra settings (120 fps is preferred but not needed). \n\nReason is I just recently bought an LG OLED 4k 120hz 42”. I currently use my PS5 for my LG but I prefer to use my gaming PC as I have more games to play on it and I also do CAD work and do 3D designs and would like to utilize the LG for it as well. \n\nShould I upgrade my GPU or upgrade my CPU/Motherboard. \n\nIf I should upgrade my GPU what would you recommend I upgrade to? My PSU is 850w gold coolermaster.\n\nIf I should upgrade my CPU/motherboard any recommendations on a good motherboard/CPU?",
      "author": "KeyEastern2905",
      "created_utc": 1749090339,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 13,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3o15e/help_me_decide_if_i_should_upgrade_the/"
    },
    {
      "id": "1l3iu7f",
      "title": "Need help upgrading from the AMD Ryzen 7 1700",
      "content": "I'm planning on moving to Windows 11 as Windows 10's support is ending; however, the Ryzen 7 1700 is not supported by Windows 11.  \nMy Current build is   \nMotherBoard: MSI X470 GAMING PLUS MAX  \nGPU: RTX 3070\n\nI'm trying to find one for around or less than $200 that works with my current motherboard and is supported by Windows 11.  \n  \nI mainly use my computer for gaming and am trying to find the closest thing to an upgrade from the 1700 but I don't know that much about CPU's, I've been looking at the 5800x and the 5700 and they both look good however, they have different bonuses that I don't know how they affect performance.  \n",
      "author": "masterpower99",
      "created_utc": 1749075494,
      "upvotes": 2,
      "upvote_ratio": 0.75,
      "num_comments": 14,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3iu7f/need_help_upgrading_from_the_amd_ryzen_7_1700/"
    },
    {
      "id": "1l3n6e4",
      "title": "New to pc gaming, need help picking correct GPU",
      "content": "Hello I am new to pc building and its components, I had my brother help me buy all my stuff online, i currently have a GeForce GTX 1660 that he gifted me but i want to upgrade so I can play modern games coming out soon.\n\nI was suggested by my local pc store to get \"asus rtx 4060ti or 4060 co\"\n\nmy main concern is idk which is what or what's the difference, if any. I am not one for \"best\" graphics or high FPS i just want it to run the new Indiana Jones & Mafia game smoothly.\n\nsorry if i asked dumb/easy question, I have been console gaming only up until 8 months ago.",
      "author": "Traditional-Age2650",
      "created_utc": 1749087772,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 11,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3n6e4/new_to_pc_gaming_need_help_picking_correct_gpu/"
    },
    {
      "id": "1l3n6dm",
      "title": "PC Part builder",
      "content": "What website does everyone use to compile PC parts and see if it's compatible with each other? Is PCPartPicker a good site to use or is there something better?\n\nThank you in advance!! ",
      "author": "hoonys",
      "created_utc": 1749087771,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3n6dm/pc_part_builder/"
    },
    {
      "id": "1l3n4bg",
      "title": "Upgrading advice",
      "content": "TLDR; I’m wondering if it’s better to upgrade the motherboard (B650/850) for faster/more current RAM and CPU, or should I keep the outdated motherboard (Dorado HP) and buy a relatively outdated CPU. I currently just bought a 7600 XT 16gb GPU and would like the best CPU to match. Currently have an Intel i5 10400. I mostly do video editing and music production but also game casually. Details below:\n\nSo, I have a very outdated PC (relatively speaking). It’s an HP Omen 25L, it has the Dorado motherboard, a 1660 Super 6gb NVIDIA, only 8gb of DDR4 RAM, and an Intel i5 10400 CPU. I got it during COVID, and with the specific intention of upgrading the components later on. It is now later on, and I’m currently on the fence whether I should buy an older CPU that can only fit my outdated motherboard (also so I don’t need to build a new PC) or if I should just build a new PC all together with a newer motherboard (which I’m fully prepared to do). The only “new” hardware I have now is 7600 XT 16gb which I just recently purchased. \n\nIf anybody can give me good advice on all of this because I’m new to building PCs I would appreciate it! I really just need a fast and reliable rig that I can count on for content creation and gaming. ",
      "author": "Specialist_Youth7910",
      "created_utc": 1749087595,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3n4bg/upgrading_advice/"
    },
    {
      "id": "1l3es4h",
      "title": "Help with buying a monitor",
      "content": "Hi! I just built a new gaming pc with a 9800x3d and a 9070xt and I now want to buy a new monitor for that crisp feeling. However I dont know much about monitors and I feel divided between 1440p or 4k and oled or no oled and what refresh rate I need. I mostly play single player story games like witcher or monter hunter but I also play a bit of cs and dota (not much tho). I also want to keep it at a reasonable budget.\n\nAny help or tips is appriciated!",
      "author": "Calvinkleen",
      "created_utc": 1749065588,
      "upvotes": 3,
      "upvote_ratio": 0.8,
      "num_comments": 9,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3es4h/help_with_buying_a_monitor/"
    },
    {
      "id": "1l3moxd",
      "title": "Should i buy rtx 5060 ti?",
      "content": "I'm about to build my first PC and I'm planning to buy an rtx 5060 ti, I've heard that some of Nvidia's 5000 series graphics cards get burned, they have a very high temperature, the thermal paste melts. I would like to know if it is an issue that occurs in some specific models, if it is safe to buy the rtx 5060 ti or if I should look for another option.",
      "author": "azathoth9595",
      "created_utc": 1749086344,
      "upvotes": 1,
      "upvote_ratio": 0.6,
      "num_comments": 4,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3moxd/should_i_buy_rtx_5060_ti/"
    },
    {
      "id": "1l3mhu8",
      "title": "Why does windows 11 make my games crash?",
      "content": "Ever since i updated to windows 11 i get crashes in steam games and vram errors that had never happened on windows 10 for example r6 seige crashes very often and very randomly and rdr2 always says the game is running low on vram and the finals crashes and says its a vram error but i never had any of this on windows 10 and i also have connection failures to steam and steam games",
      "author": "Zealousideal_Bus6564",
      "created_utc": 1749085741,
      "upvotes": 1,
      "upvote_ratio": 0.6,
      "num_comments": 7,
      "flair": "Discussion",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3mhu8/why_does_windows_11_make_my_games_crash/"
    },
    {
      "id": "1l3mc3g",
      "title": "Ryzen 7 7700 running too hot on stock cooler",
      "content": "I was encoding some videos on handbrake and noticed that under 65-70% CPU load (according to task manager) my CPU was running at almost 99°C. This can't be normal right? My idle temps are somewhere in between 60-67° (Under 5-6% CPU utilization) I think? I'm using the stock cooler that came with my CPU. Can someone advise me on what to do? Should I get a better cooler? Or undervolt the CPU? \n\n\n\n\n",
      "author": "11_bit",
      "created_utc": 1749085266,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 4,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3mc3g/ryzen_7_7700_running_too_hot_on_stock_cooler/"
    },
    {
      "id": "1l3mapo",
      "title": "My psu blew, but no obvious damage is present anywhere on the mobo, how likely did it get fried?",
      "content": "   While just trying to get my Ethernet to work on Linux mint (it won't detect it, but that's for another time) I heard a loud pop and the computer immediately losing all power. I disconnected everything and attempted to turn the psu on by itself with the fan turned on (instead of smart fan) and nothing happened at all. I learned that tt is a trash company at psu after all of this. \n  After a smell test, it's almost definitely a capacitor on the psu blew, as the smell in very strong at that spot. I checked the locations where the psu was connected to the mobo and I can't find any soot or other signs of damage in or around the connections, or even inside the pins of the wires. I checked and the CPU and its socket and it shows no signs of damage akin to overload, the psu connections are free of any signs of visual damage.\n   The only issue is that I have no psu to test anything to see if non-visual damage occurred. I'm already planning to refund and get a better psu, but how concerned should I be about my mobo and other components?\n\nEdit: I forgot I had a scrap computer with a far lower psu (only 300w, so I can't test the gpu which requires 750w) and some mobo lights turned on when connected, the only issue is that I can't even test the CPU to turn on and start the bios, but when I turn on the mobo, ram sticks light up, fans run, and mobo lights power on, along with any plugged in rgba lights.",
      "author": "iWECHAMPIONSi",
      "created_utc": 1749085162,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3mapo/my_psu_blew_but_no_obvious_damage_is_present/"
    },
    {
      "id": "1l3m34d",
      "title": "New PC, everything powers on, but no video display",
      "content": "Everything powers on in the system, fans run. But no display output from GPU or mobo. Thought it might be a compatibility issue with the Ryzen 7 9700x and the Asus Prime B650 plus wifi. Tried running a bios update via flashback, but the light just stays on the whole time for 20+ min and never goes out. Part list is below. Not sure on what else to try\n\n https://pcpartpicker.com/list/kL23kf",
      "author": "ninjahumstart_",
      "created_utc": 1749084540,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 1,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3m34d/new_pc_everything_powers_on_but_no_video_display/"
    },
    {
      "id": "1l3m0s1",
      "title": "Please let me know if this is a good 5070ti build parts list.",
      "content": "[https://pcpartpicker.com/list/HWnW8Q](https://pcpartpicker.com/list/HWnW8Q)\n\n  \nThis is my basic list with parts I put together.  I've given myself a budget of around $2500-$4000 so I wouldn't mind swapping out parts for more quality if it'll make a big difference. I think I picked a good motherboard based on the lanes and I'm willing to risk the potential dead motherboard. I wouldn't mind changing if something was more reliable though. I think I'm dead set on the case because it's thermals and space for potential upgrades appear to be good. I have no idea about the power supply, but I assume they're all relatively similar. I kind of want to build it myself, but I do have two Microcenters in Ga(Marietta and Duluth) a equal distance away from my location at about 2 hours. If I went the Microcenter route I know they don't have the Antec Pro available. I would be fine with something with comparable thermals. I settled on Vanguard 5070ti because I hate noise, but anything quiet would do. I currently have a 3070ti ftw and I swear one of the fans either ramps up slowly or is getting progressively louder. I also wouldn't mind purchasing additional fans if there was a case with good thermals, but I would need help making sure they're compatible. Any help or opinions would be greatly appreciated. I currently have a 3070ti setup with a H710i case and it gets quite toasty. I want to upgrade to something before it melts itself and maybe tinker around with it to become more knowledgeable about PC parts and troubleshooting issues in general on pc.",
      "author": "edogvsu",
      "created_utc": 1749084344,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 2,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3m0s1/please_let_me_know_if_this_is_a_good_5070ti_build/"
    },
    {
      "id": "1l3lzcd",
      "title": "PSU Confusion: PCIE",
      "content": "I have reviewed a lot of posts on here, and it is starting to hurt my head.\n\nCurrently i have a EVGA 850w G2 supernova XR. It uses the 8 pin that splits. I understand that isn't would use 3 separate cables plugged into the included 5080 adapter to make this configuration work.\n\nI am short 2 cables sadly but it seems EVGA is going to send me some. \n\nIm slightly hesitant because if im sent the wrong cables i brick my new build.\n\nI looked into amazon and the rm850w E seems good, but it has less connectors. I am having a hard time understanding the ATX 12V(4+4) pin vs the 12v 2x6(12+4) pin and what I would use. As far as I understand this newer PSU WOULDNT need the included gpu adapter. \n\nTl;dr im dumb and dont understand how to put a cable into a 5080. Help.\n\n\nFor fun:\n\nI have a 1070ti r2700x build and im upgrading to a 5080 7800x3d build with a fractal north case. Its been a while since I built. ",
      "author": "archaeology2019",
      "created_utc": 1749084226,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 4,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3lzcd/psu_confusion_pcie/"
    },
    {
      "id": "1l3lzav",
      "title": "Need help – 1/2 RAM Stick suddenly stopped working (RGB lights on, no boot – VRAM light)",
      "content": "Been running the same rig for about 2 years now with zero major issues- until recently. My system suddenly crashed, so I did a forced restart. On boot, the VRAM light on the mobo lit up, and it wouldn’t go further.\n\nDid the usual troubleshooting:\n\n\\- Re-seated the RAM and GPU  \n\\- Reset CMOS  \n\\- Cleaned the gold contacts on the RAM\n\nAfter several attempts, it finally booted up. So I shut it down to reassemble everything properly. But as soon as I moved the rig back onto my desk- boom, VRAM light again and back to square one.\n\nAt this point, I tested both RAM sticks individually:\n\n\\- One stick works fine in all slots (so I’m ruling out a mobo issue for now).  \n\\- The other one doesn’t work in any slot, and if I install both together, I get the VRAM light again and no post.  \n\\- Odd part? The non-working stick still has RGB lighting when plugged in.\n\nI also had an issue with my fans not spinning (though RGB was working). Turns out, I had to flick the PSU switch really fast to get them going- yeah, not exactly ideal. Ended up swapping the RGB hub with a spare and that fixed the fan issue. (fan issues happened during the 2nd round of troubleshooting, after I briefly got the pc running) \n\nNow I’m wondering:\n\n\\- Is the faulty RAM just dead even though it lights up?  \n\\- Could I have damaged something on the mobo during all the on/off power cycling?  \n\\- Is it possible the PSU surge messed something up?\n\nUnfortunately, I don’t have access to another rig or test bench (I live in a remote area), so I can’t test the RAM elsewhere. Would appreciate any thoughts or suggestions before I order a replacement stick.  \nfor clarification, it is running now but only with 1 stick. \n\nCOMPONENTS:   \n\\- RAM: TFORCE delta 2x8  \n\\- CPU: Ryzen5 5500  \n\\- GPU: Intel arc a750  \n\\- PSU: Corsair cv750",
      "author": "FeroxBeast",
      "created_utc": 1749084223,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 0,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3lzav/need_help_12_ram_stick_suddenly_stopped_working/"
    },
    {
      "id": "1l3lyzh",
      "title": "is a rtx 3060ti a good upgrade from the gtx 650",
      "content": "i currently have a gtx 650 with parts like a ryzen 5 5600x the gtx 650 was a palceholder while i saved up the money for a new graphics card which i plan on being the rtx 3060ti i plan on using it for streaming fortnite and playing some marvel rivals and rl off stream will this card be sufficient for good performance on competittve games or should i aim higher for something else?",
      "author": "WashRealistic2397",
      "created_utc": 1749084195,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 3,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3lyzh/is_a_rtx_3060ti_a_good_upgrade_from_the_gtx_650/"
    },
    {
      "id": "1l3lt53",
      "title": "Photo editing PC",
      "content": "Hi all. I would like to do a build but I feel like the task would be a bit too daunting for me. Does anyone know what I would need for a PC for photo editing? No videography or animation. Strictly photo editing. What would be the most important component to strengthen this? Any recommendations for a prefab PC for photo editing under $1k?",
      "author": "xmrxcool",
      "created_utc": 1749083713,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3lt53/photo_editing_pc/"
    },
    {
      "id": "1l3lqcr",
      "title": "Is this a good parts list?",
      "content": "[PCPartPicker Part List](https://pcpartpicker.com/list/Jmd3kf)\n\nType|Item|Price\n:----|:----|:----\n**CPU** | [AMD Ryzen 5 5600X 3.7 GHz 6-Core Processor](https://pcpartpicker.com/product/g94BD3/amd-ryzen-5-5600x-37-ghz-6-core-processor-100-100000065box) | $128.00 @ Amazon \n**CPU Cooler** | [Thermalright Peerless Assassin 120 SE 66.17 CFM CPU Cooler](https://pcpartpicker.com/product/hYxRsY/thermalright-peerless-assassin-120-se-6617-cfm-cpu-cooler-pa120-se-d3) | $34.90 @ Amazon \n**Thermal Compound** | [ARCTIC MX-6 4 g Thermal Paste](https://pcpartpicker.com/product/k2pzK8/arctic-mx-6-4-g-thermal-paste-actcp00080a) | $7.99 @ Amazon \n**Motherboard** | [Asus PRIME B550M-A WIFI II Micro ATX AM4 Motherboard](https://pcpartpicker.com/product/jQrRsY/asus-prime-b550m-a-wifi-ii-micro-atx-am4-motherboard-prime-b550m-a-wifi-ii) | $119.99 @ Amazon \n**Memory** | [Silicon Power XPOWER Turbine 32 GB (2 x 16 GB) DDR4-3200 CL16 Memory](https://pcpartpicker.com/product/2LMTwP/silicon-power-xpower-turbine-32-gb-2-x-16-gb-ddr4-3200-cl16-memory-sp032gxlzu320fda) | $46.97 @ Amazon \n**Storage** | [Patriot P320 1 TB M.2-2280 PCIe 3.0 X4 NVME Solid State Drive](https://pcpartpicker.com/product/sKcBD3/patriot-p320-1-tb-m2-2280-pcie-30-x4-nvme-solid-state-drive-p320p1tbm28) | $53.49 @ Amazon \n**Video Card** | [ASRock Challenger D Radeon RX 6600 8 GB Video Card](https://pcpartpicker.com/product/D9ytt6/asrock-radeon-rx-6600-8-gb-challenger-d-video-card-rx6600-cld-8g) | $219.99 @ Newegg \n**Case** | [Cooler Master Elite 301 MicroATX Mid Tower Case](https://pcpartpicker.com/product/WPnXsY/cooler-master-elite-301-microatx-mid-tower-case-e301-kgnn-s00) | $49.99 @ Newegg \n**Power Supply** | [MSI MAG A750GL PCIE5 750 W 80+ Gold Certified Fully Modular ATX Power Supply](https://pcpartpicker.com/product/dbCZxr/msi-mag-a750gl-pcie5-750-w-80-gold-certified-fully-modular-atx-power-supply-mag-a750gl-pcie5) | $99.99 @ Amazon \n**Monitor** | [ASRock PG27F15RS1A 27.0\" 1920 x 1080 240 Hz Curved Monitor](https://pcpartpicker.com/product/6TwmP6/asrock-pg27f15rs1a-270-1920-x-1080-240-hz-curved-monitor-pg27f15rs1a) | $104.77 @ Newegg \n**Keyboard** | [RK Royal Kludge RK61 Bluetooth/Wireless/Wired Mini Keyboard](https://pcpartpicker.com/product/r3QKHx/rk-royal-kludge-rk61-bluetoothwirelesswired-mini-keyboard-42772957233373) | $44.99 @ Amazon \n**Mouse** | [Logitech G305 LIGHTSPEED Wireless/Wired Optical Mouse](https://pcpartpicker.com/product/Yrw7YJ/logitech-g305-lightspeed-wirelesswired-optical-mouse-910-005280) | $32.49 @ Amazon \n**Headphones** | [SteelSeries Arctis Nova 1  Headset](https://pcpartpicker.com/product/ZnNYcf/steelseries-arctis-nova-1-headset-61606) | $49.99 @ Amazon \n | *Prices include shipping, taxes, rebates, and discounts* |\n | **Total** | **$993.55**\n | Generated by [PCPartPicker](https://pcpartpicker.com) 2025-06-04 20:28 EDT-0400 |",
      "author": "Memer182",
      "created_utc": 1749083479,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 4,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3lqcr/is_this_a_good_parts_list/"
    },
    {
      "id": "1l3lk0a",
      "title": "Please let me know if this is a good part list.",
      "content": "Greetings.\n\nI have been making a list with the following hardware in detail to avoid bottlenecks, watts and to be able to improve it in the future.\n\nCorsair iCUE Link 3500X RGB Mid-Tower ATX\n\nROG Strix B550-F Gaming WIFI II\n\nRyzen 5 5600x\n\n2 x RAM 8GB (16gb) Kingston Fury beast black RGB DDR4\n\nSSD M.2 WD\\_BLACK 2TB.\n\nCorsair RM750e full modular.\n\nIf all goes well, I will update the PC with next:\n\n Nvidia RTX 3060 12GB \n\nCORSAIR iCUE Link H150i Liquid Cooler \n\nother 2 x 8GB RAM (16GB) Kingston Fury so that they are 32 GB and have greater performance.\n\nIs this a good plan for my first PC?",
      "author": "Svxknir",
      "created_utc": 1749082961,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 2,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3lk0a/please_let_me_know_if_this_is_a_good_part_list/"
    },
    {
      "id": "1l3ljfz",
      "title": "Negative air pressure",
      "content": "Hi, I just finished my build, my fan setup is 3 exhaust 1 intake. Is anyone running the same configuration? How is your temp?\n\nI'm aware of the dust build up issue, but is it better to shoot for neutral?",
      "author": "henconst796",
      "created_utc": 1749082914,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 0,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3ljfz/negative_air_pressure/"
    },
    {
      "id": "1l3li63",
      "title": "Q Flash has taken over 40 minutes what should I do?",
      "content": "The motherboard I’m using is the B550-A Pro and I have the ram, nvme, and cpu installed. I installed the latest bios update on a flash because it would not boot bios. I inserted the flash drive with the latest bios rom and clicked the button to update it. But now it has been flashing for over 40 minutes. Should I have removed everything off the mobo first? Do I let it keep going or what should I do?",
      "author": "Classic-Government48",
      "created_utc": 1749082810,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 2,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3li63/q_flash_has_taken_over_40_minutes_what_should_i_do/"
    },
    {
      "id": "1l3lhqf",
      "title": "Need Advice: Upgrade from 3080 – 5070 Ti vs 3090? VR, AI, and Remote Use",
      "content": "Hey y’all, I’m trying to decide on my next GPU upgrade and would love some input.\n\nI’m currently running a 3080, but I’m looking at either a 5070 Ti or a 3090. Normally this would be a pretty straightforward choice, but the used market is weird right now. I’m seeing both cards go for around $700–800 used where I am.\n\nHere’s the deal:\n\nI play VR and use frame generation for smoothing\n\nI also run Stable Diffusion and do some light AI work\n\nI'm planning to set up my rig for remote access and potentially run smaller local LLMs\n\n\nBasically, I’ve got edge-case reasons for both options: the 5070 Ti gives me newer tech and better efficiency; the 3090 gives me that big 24GB VRAM which could help with AI/LLM stuff.\n\nHas anyone else faced this choice? What did you go with, and how did it work out? Would love to hear your thoughts or real-world experience!",
      "author": "MotoKin10",
      "created_utc": 1749082776,
      "upvotes": 1,
      "upvote_ratio": 0.57,
      "num_comments": 5,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3lhqf/need_advice_upgrade_from_3080_5070_ti_vs_3090_vr/"
    },
    {
      "id": "1l3lhoz",
      "title": "5060 isn't a terrible idea in specific circumstances, right?",
      "content": "Currently running an 8ish year old build (8700k + 48 GB RAM + M2 drive) that has a newly fried 1080. I'm realistically 2-3 years out from a new build (theoretically with Witcher 4 but realistically a year after it given my usual buying habits). I need a replacement GPU to get me through until then.\n\nAm I insane or is an MSRP ($300) 5060 not a terrible idea for me? I could theoretically get a 5070 or a 5060 Ti 16GB but I'm only playing shit that worked well with the 1080. Maybe I'll pick up Cyberpunk next time it's on sale?",
      "author": "district_runner",
      "created_utc": 1749082773,
      "upvotes": 3,
      "upvote_ratio": 0.54,
      "num_comments": 60,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3lhoz/5060_isnt_a_terrible_idea_in_specific/"
    },
    {
      "id": "1l3lh0m",
      "title": "The Dreaded Bios Update",
      "content": "Hello all! To provide some quick context, I recently bought a Ryzen 7 5800XT to replace my loyal but tired Ryzen 5 2600x. The motherboard I am using for both is an ASRock B450 Steel Legend, and I'm not planning on upgrading for a little while. However, PCPartpicker along with the ASRock website has warned me that I may need to update my bios before my motherboard will be compatible with the CPU. As I bought the mb in 2019, I need to update my bios.\n\nI bought a 64gb usb as I was blissfully unaware of the 32gb cap on windows fat32 formatting. To fix this, I shrunk the drive partition to \\~29gb and then was able to properly format it in diskpart. As far as my admittedly quite brief research has gone, most sources seem to recommend using a 3rd party software able to format the whole drive. I would rather use the command prompt and pretend I'm Mr. Robot.\n\nMy (admittedly fairly stupid) question is whether or not using a fat32 formatted 29gb partition in a 64gb drive will work safely for updating my mb bios, or whether I should just use a 3rd party software as recommended by the various tech support forums I had a gander at. \n\nTLDR: Will using a 29gb partition of a 64gb drive formatted in fat32 blow up my computer when I try to update the bios.\n\nThank you for your time, any advice would be welcome :).",
      "author": "Excellent-Rain-1295",
      "created_utc": 1749082720,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3lh0m/the_dreaded_bios_update/"
    },
    {
      "id": "1l3g887",
      "title": "New PC build only sometimes posts..",
      "content": "New PC built by me, sometimes posts but very rarely and especially not first time. Get the CPU red light on the motherboard post status checker, pressing restart button occasionally gets it to post. Once I get in to bios setup it's fine and can happily sit there for 30+ mins. CPU was at about 36c.\n\nAMD Ryzen 9600x\n\nASRock b850m steel legend WiFi bios version 3.2\n\nKingston fury beast 128gb (4x32gb) 5200mt/s - only trying 64gb at the moment. Will probably just use the other 64gb in another build.\n\nCooler master mwe 750 gold V2 modular\n\nJust using internal GPU at the moment, will add in b580 when I can get this starting properly.\n\nAny ideas if I have done something wrong or more likely faulty parts? Any help very much appreciated!!",
      "author": "Medium-Programmer-52",
      "created_utc": 1749069039,
      "upvotes": 2,
      "upvote_ratio": 0.75,
      "num_comments": 6,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3g887/new_pc_build_only_sometimes_posts/"
    },
    {
      "id": "1l3laha",
      "title": "My power supply - ASUS TUF 850w gold - has 3 slots that seem to be both for PCIE 6 pin cables and 8 pin CPU cables, is this a normal thing, can I just choose whichever of these slots to plug my 2 CPU connectors on my motherboard?",
      "content": "basically the tile, I'm still a bit confused about where exactly should I plug the CPU cable in this Power supply, usually the power supplies I've seen have different slots for the 8P CPU cables and the PCIE 6pin GPU cables, I'd like some clarification.\n\nthe manuals on this power supply are basically non existent, there's 0 information about which cable goes where and there's only a indication in the cables themselves.\n\nThanks a lot guys",
      "author": "jonas101010",
      "created_utc": 1749082199,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 3,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3laha/my_power_supply_asus_tuf_850w_gold_has_3_slots/"
    },
    {
      "id": "1l3l7ie",
      "title": "Is it fine to install an ASUS PRO ART RTX 4080 SUPER on a ASUS TUF 850W gold with only the native 12V-2x6 cable of the Power Supply?",
      "content": "So, I'm pretty new to 12V-2x6 cables and I'm still a bit confused about how it works. My PSU has a native 12V-2x6 slot and cable so I'd like to know if I can just use it instead of the adapter that comes with it that splits the 12V-2x6 in two old 6 pin connectors.\n\nDoes this PSU works fine natively with this new cable connection? It would be even more important because this PSU has only 3 PCIE slots and 2 are already on the CPU connector on the motherboard, technically I could use only one since the CPU has way less than 300w TDP, but it would be less ideal.\n\nI know this probably a dumb question, but I'd like just to make sure everything is fine before connecting things and powering everything\n\nThanks a lot guys.",
      "author": "jonas101010",
      "created_utc": 1749081954,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 2,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3l7ie/is_it_fine_to_install_an_asus_pro_art_rtx_4080/"
    },
    {
      "id": "1l3l71b",
      "title": "My 1st Build- Can you help me find parts to make it 1400 and recommend me a good monitor?",
      "content": "[https://pcpartpicker.com/list/VB87qH](https://pcpartpicker.com/list/VB87qH) The Build\n\n\n\nThis is the monitor I'm think about getting: AOC Q27G4ZD. If you recommend me another one, can I have it 1440p? Thanks fr",
      "author": "Turbulent-Swing-5064",
      "created_utc": 1749081913,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 4,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3l71b/my_1st_build_can_you_help_me_find_parts_to_make/"
    },
    {
      "id": "1l3l6ll",
      "title": "Is This a Good Build?",
      "content": "I was goofing off with PCPartPicker and I made this build is it good. I'm new to PC building, so if it's bad that's why. [https://pcpartpicker.com/list/FpywXR](https://pcpartpicker.com/list/FpywXR)",
      "author": "Intelligent-Shoe-940",
      "created_utc": 1749081879,
      "upvotes": 1,
      "upvote_ratio": 0.6,
      "num_comments": 13,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3l6ll/is_this_a_good_build/"
    },
    {
      "id": "1l3kx0j",
      "title": "Does the Kraken Elite 2024 work with the X870i Strix clearance?",
      "content": "Hi all \n\n\nWondering with how tall the ssd heatsink is if there is enough room for the pump block and tubes to be mounted with the tubes down towards the ssd. \n\nDoes anyone have this combo?\n\n",
      "author": "prackprackprack",
      "created_utc": 1749081117,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3kx0j/does_the_kraken_elite_2024_work_with_the_x870i/"
    },
    {
      "id": "1l3c7cp",
      "title": "Any stability issues with Memory Context Restore enabled?",
      "content": "Been a \"few years\" since I built my last computer, and apparently EXPO RAM is the new kid in tech town. Looks like startup times gets hit pretty hard with it testing the memory on every cold boot (which for me is nearly every boot).\n\nFrom what I understand, Memory Context Restore saves the settings from the initial memory test so that it doesn't have to run it again. Though, that means if anything \"shifts\" or I guess if you blow on the memory too hard, the timings could change without the motherboard knowing it.\n\n**Has anyone had problems setting Memory Context Restore to enabled?**\n\nFor specifics, I'm running an Asus TUF Gaming B850-Plus motherboard with 2x16gb GSKILL 6000 CL30 memory.\n\nThanks!",
      "author": "elias4444",
      "created_utc": 1749059548,
      "upvotes": 3,
      "upvote_ratio": 0.8,
      "num_comments": 2,
      "flair": "Discussion",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3c7cp/any_stability_issues_with_memory_context_restore/"
    },
    {
      "id": "1l3kuk4",
      "title": "M.2 SSDs failed one after another",
      "content": "Hey guys, bad news. Two days ago I decided to build a new PC. I went with the following specs:\n\n\t•\tCPU: AMD Ryzen 5 7600 with integrated Radeon Graphics\n\t•\tCooler: Stock AMD cooler (with pre-applied thermal paste)\n\t•\tMotherboard: ASUS TUF Gaming B650-PLUS WiFi\n\t•\tRAM: 32GB (2x16GB) Corsair Vengeance DDR5 6000MHz CL36, EXPO\n\t•\tSSD 1: Samsung 980 1TB NVMe (PCIe 3.0)\n\t•\tSSD 2: Kingston NV2 1TB PCIe 4.0 NVMe\n\t•\tGPU: Palit RTX 5060 Dual 8GB (connected via PCIe)\n\t•\tPSU: Corsair RM650e, 650W, Fully Modular, ATX 3.1, PCIe 5.1\n\t•\tCase: NZXT H6 Flow (white)\n\nA day later all the pieces arrived. I carefully successfully built it in 3-4 hours. First boot: success. Installed Windows 10. Got stuck on “Just a moment” for over an hour. Reinstalled windows 10. Everything fine. Some issues arise: Sometimes when the PC was turning on there was no monitor signal(it just wouldn’t turn on) unless I manually turned off the monitor and turned it on again (weird). Installed some drivers. Windows was running a bit wonky and slow etc. \n\nAfter doing some research I realised AM5 is not supported on windows 10 anymore. Thought hey, this must be the issue. Reinstalled windows 11. Reinstalled the drivers (Driver Booster Pro), downloaded League of Legends (just to test the pc) - everything worked great. Started downloading some more games/apps. -> blue screen with the code MEMORY MANAGEMENT. Ok, weird, restarted, things were fine. Opened some windows, they were blank inside, just pure white, no minimize, maximize, and close buttons. Nothing. Ok, weird, restarted the pc. Boots into Bios. What? Restarted. Keeps booting into bios. Realised my first ssd that I had everything on is no longer present. Removed samsung ssd, tried it in all 3 m2 slots, not seen anymore. Ok, it must’ve fried, maybe it was defect.\n\nStart over again, test the kingston ssd in all slots, it worked in all. Great. Reinstall windows, drivers, games. Played a game, wonderful performance. Started downloading some more game - started going slow again. 100% disk used, constantly. With only 2/3 mb/s write/read. Tests in bios for the ssds passed for both (for the samsung when it was still visible lol)\n\nI just gave up. I tried installing some software to check the ram or the ssd, but it was impossibly slow and I just gave up. \n\nCould I have hit the lottery and gotten 2 broken ssds? Could the motherboard be the issue? Are m2’s just that bad? The total price for the pc was around €1400. Now I’m down that cash and also not having a working PC… Any ideas?\n\nShould I switch to a SATA ssd?\nAny ideas what could’ve broken the ssds?\nM\nSorry for the long post, and thank you.\n\nTl;dr: Built a €1400 PC with solid parts (Ryzen 5 7600, B650 mobo, 32GB DDR5, 2x NVMe SSDs, RTX 5060).\n\t•\tWindows 10: Stuck, slow, display weirdness → upgraded to Windows 11.\n\t•\tSamsung 980 SSD disappeared from BIOS after freeze/BSOD (Memory Management).\n\t•\tKingston NV2 SSD worked for a bit but then slowed down heavily (100% disk, 2-3MB/s).\n\t•\tTried tools like CrystalDisk and RAM checkers but PC became too slow to operate.",
      "author": "serga97",
      "created_utc": 1749080919,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 11,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3kuk4/m2_ssds_failed_one_after_another/"
    },
    {
      "id": "1l3ku9u",
      "title": "Looking for a 3060 Upgrade",
      "content": "I have an R5 7500f and a 3060 12gb, I want to find a new graphics card but i'm not really sure whats good or not. My budget is around $600. I was looking at an 7800xt and 5060 ti but tbh no clue whats good ",
      "author": "BrandonG1",
      "created_utc": 1749080897,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 4,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3ku9u/looking_for_a_3060_upgrade/"
    },
    {
      "id": "1l3kor6",
      "title": "PC build Guide",
      "content": "[https://au.pcpartpicker.com/list/b3hRb2](https://au.pcpartpicker.com/list/b3hRb2)\n\nHi Guys, I am building my PC for the first time. Have very few little knowledge about PC stuffs. How good do you think this PC build is. It's mostly for gaming in high quality (minimum 2k) . To play all the games and do some video editing stuffs as well. Please recommend any alternative cheaper options or any upgrade that is most required. Thank you. Based in Australia.",
      "author": "MelodicBus3095",
      "created_utc": 1749080458,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 2,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3kor6/pc_build_guide/"
    },
    {
      "id": "1l3fad1",
      "title": "Monitor won't connect after cleaning pc :'(",
      "content": "Alright my angels, I'm in some serious hot water with the wife and need help baaaaaadddd.\n\nWife has a PC that she works from and that hadn't been cleaned in 3yrs (already bad, I know). Being the absolute best guy around I offered to help her clean it! Knowing nothing! How hard could it BE?!?!? 2ND mistake.\n\nAnyhow, I removed the PSU box, the CPU Cooler fan and of course the CPU had sealed itself to the fan and popped out with it and then I bent a bunch of the rods like a fuckin dumbass. \n\nReplaced the CPU with the exact same one it came with, watched a billion YT videos on correctly installing it, fit like a glove. \n\nPut everything back together and it switches on but DOES NOT CONNECT TO THE MONITOR. All the fans are going.\n\nI removed the RAMS and cleaned them as well as unplugged the 8 bit CPU connector things and it still boots up nicely but won't connect.\n\nAs well the whole unit only shuts down if I switch it off rather than the button on the top.\n\nI'm at a loss pals. Should I replace the PSU?? If so, I dont see the identical one on Amazon (EVGA 600BR 80plus Bronze) but there are other models, can I just order a different 600br one??\n\nFeel free to flip me off in the comments, I'm an idiot and I know it. ",
      "author": "Okay-lucky",
      "created_utc": 1749066802,
      "upvotes": 2,
      "upvote_ratio": 0.67,
      "num_comments": 10,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3fad1/monitor_wont_connect_after_cleaning_pc/"
    },
    {
      "id": "1l3klv4",
      "title": "Help, my Pc wont boot",
      "content": "Hey, I'm having trouble booting up my newly built pc. When turning it on, the only activity is the psu and case fans rgb cycling (blinking). None of the other components light up or move.\n\nI tried a q flash plus bios update in the new build but it didn't work, and the the bios light didn't blink at all. I made sure to call it exactly gigabyte.bin in a fat32 16gb usb drive\n\nNone of the debug lights are on, only 2 other lights beneath the gpu and to the right of it, which are blinking red. It makes it hard identifying the issue.\n\nSpecs: ryzen 7 9700x\nGigabyte rx 9070xt\nAorus elite b650 ax v2\nKingston fury beast 2x16 gb\nNzxt h5 flow\nCooler masterliquid ii 240\nCooler master mwe gold v2\nKingston fury renegade cpu\n\n",
      "author": "Scrab05",
      "created_utc": 1749080227,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3klv4/help_my_pc_wont_boot/"
    },
    {
      "id": "1l3kfyl",
      "title": "RX 6750XT and 7800X3D in Rust",
      "content": "As the title says, im building a PC mainly for playing Rust and maybe some games like Fortnite and RDR2 but mainly Rust. \n\nis this combo not balanced and do i need a better GPU? my max budget is 1,1k euros and i have already reached it with this GPU that is priced at around 350 euros rn on [amazon.it](http://amazon.it)",
      "author": "Lost-Literature-2510",
      "created_utc": 1749079757,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3kfyl/rx_6750xt_and_7800x3d_in_rust/"
    },
    {
      "id": "1l3kfy1",
      "title": "Ryzen 9900x or 7900x? Only $50 difference right now",
      "content": "I'm building a new PC and in the past days I've decided to go with the Ryzen 9 7900X (listed for around $330 USD). It's just come to my attention that the 9900X is on discount right now for only $50 more.\n\nIs it worth the extra money? Would it be noticeable better? This build would be for productivity (video editing and motion design, mostly to multitask between 2-3 Adobe programs like Premiere Pro and After Effects), but also occasional gaming.\n\nWhich one would you go for and why?",
      "author": "bywailyromero",
      "created_utc": 1749079756,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 2,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3kfy1/ryzen_9900x_or_7900x_only_50_difference_right_now/"
    },
    {
      "id": "1l3ezoa",
      "title": "Blackscreen when upgrading RAM, slots 1 and 3 seem nonfunctional on motherboard",
      "content": "Gigabyte B650 Aorus Elite AX V2  \nRyzen 7 7800x3d  \nRTX 4070  \n\nPotentially of note I am using an older semi modular power supply with only 1x8 pin CPU power whereas the motherboard is newer and has 1x8 pin and a 1x4 pin CPU power connector. At the time I followed the advice of [this thread](https://www.reddit.com/r/buildapc/comments/11wx2w4/cpu_power_cable_help_please/) and only connected the 8 pin power. It has been running like this with no issue since then. I'm not sure if this might be contributing to the issue. Specifically I have \"Corsair CP-9020103-UK CX Series CX650M ATX/EPS Semi-Modular 80 Plus Bronze 650 W Power Supply Unit - Black\". Populating that additional 4 pin slot would require me to buy a new PSU so I'm reluctant to do that unless I know it's likely to be the issue.\n\nThe original RAM I bought with the CPU/MOBO:\n\nCORSAIR VENGEANCE DDR5 32GB (2x16GB) DDR5 6000MHz CL36 AMD EXPO Intel XMP iCUE Compatible Computer Memory - Grey (CMK32GX5M2E6000Z36)\n\nThese were placed in slots 2 and 4 and everything has been functioning correctly since building this system 8 months ago.\n\nI recently went back to my amazon order history and ordered an identical 2x16GB set to put in slots 1 and 3 to make it a total of 64GB.\n\nThe problem I am having is that my PC will not post with *anything* in slots 1 and 3. No combinations of slots will allow the PC to post if they include *any* ram in slots 1 and/or 3, old or new. The PC will post and boot as normal with either the new or the old RAM in slots 2, 4 or 2 *and* 4. \n\nThe power comes on and the fans spin but the RGB lighting on the motherboard does not come on and there is no display output. The red DRAM status light is illuminated indicating an issue.\n\nI have reset the CMOS multiple times (for every tested slot configuration) and checked that XMP/EXPO were both disabled. I also allowed the system to run for 10 minutes to see if it was a memory training issue.\n\nI'm a little bit lost on what to try next or if it's a hardware or compatibility issue with the motherboard/memory.\n\nWorth mentioning that the original ram I recieved has the same product code (CMK32GX5M2E6000Z36) as the new RAM but they have differing version numbers they're not 100% identical in the other numbers/versions.\n\nNew: CMK32GX5M2E6000Z36 A8K3T52004FS7L 1.35V ver 3.43.02  \nOld: CMK32GX5M2E6000Z36 A8K3T4402T9GL6 1.35V ver 4.43.05\n\nIs updating the BIOS likely to help? Otherwise would returning the new set and buying a full 4x16GB likely to work? I'm hesitant to do that until I verify that it's not a hardware issue with the motherboard.",
      "author": "Qweasdy",
      "created_utc": 1749066093,
      "upvotes": 2,
      "upvote_ratio": 0.75,
      "num_comments": 2,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3ezoa/blackscreen_when_upgrading_ram_slots_1_and_3_seem/"
    },
    {
      "id": "1l3kbq6",
      "title": "Best case for me that's compatible with my parts?",
      "content": "Hello, i'm looking for a new case and motherboard for my pc. Just needed some help finding one. Here are my current parts: GPU - XFX Speedster RX 6600 8GB. CPU - Ryzen 7 5800X. Motherboard - ASROCK B550 Pro4. CPU Cooler- Stealth Wraith. RAM - 32GB T-Force 3200MHz DDR4. Storage - TeamGroup 1TB NVME M.2 SSD. Case - GAMDIAS TALOS E3. PSU - Thermaltake 600W\n\nHere are the *NEW* parts i'm currently looking at: Motherboard - ASUS X570-Plus (Wi-Fi). Case - NZXT H5 Flow. CPU Cooler - Thermalright Aqua Elite 120 V3. Fans - Thermalright TL-C12B-S V3 (ARGB 120mm) **Looking to have 2 fans on top, 2 fans on bottom, 3 fans in front, and one rear fan.\n\nAny suggestions about the parts i'm looking at currently, let me know! I don't know too much about PC's so obviously I want some suggestions regarding parts.",
      "author": "ahmxd2good",
      "created_utc": 1749079426,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3kbq6/best_case_for_me_thats_compatible_with_my_parts/"
    },
    {
      "id": "1l3k76l",
      "title": "Planning my (first) build, anything I should change?",
      "content": "CPU AMD Ryzen 7 9800X3D, 4,7 GHz (5,2 GHz Turbo Boost) socket AM5 processor\n\nMobo MSI MAG X870 TOMAHAWK WIFI socket AM5\n\nCPU-cooler MSI MAG CORELIQUID A13 360\n\nMemory Kingston FURY 64 GB DDR5-6000 (2x 32 GB) \n\nGPU ASUS TUF Gaming Radeon RX 9070 XT OC\n\nSSD SAMSUNG 9100 PRO 2 TB SSD\n\nCase Antec C5 ARGB White midi tower\n\nPSU Corsair RM1000x, 1000 Watt\n\nKeyboard Keychron K8 Max-J1Z\n\nMonitor MSI G272QPF E2 27\"\n\nThese are the parts I am considering. I will probably change the monitor but other than that, is there anything else I should change?\n\nI think it is 100% compatible but going over dimensions again before ordering.\n\nDeciding on a case was harder than expected (so many different options) but dual chamber cases seem to be popular right now...",
      "author": "Dubdeal",
      "created_utc": 1749079081,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 4,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3k76l/planning_my_first_build_anything_i_should_change/"
    },
    {
      "id": "1l3k4qm",
      "title": "Upgrading from 3080",
      "content": "Has anyone recently upgraded from a 3080 to a 5080 or 4090? \n\nWhat sort of differences in fps have you noticed personally?",
      "author": "tillthemoonrises",
      "created_utc": 1749078892,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 2,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3k4qm/upgrading_from_3080/"
    },
    {
      "id": "1l3k2qs",
      "title": "Need Help Choosing Ryzen 9 9900X or Intel Core Ultra 7 265K for Gaming and Productivity",
      "content": "Hey everyone!\n\nI'm a college student and a pretty heavy gamer. I want to enjoy both new and classic games, but I also need to focus on getting my work done and being productive. I have a $155 promotion toward a CPU, which makes these options super affordable.\n\nShould I go for the Ryzen 9 9900X for $260 or the Intel Core Ultra 7 265K for $130? I’d love to hear your thoughts!\n\n",
      "author": "ProfessionalHost3913",
      "created_utc": 1749078742,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 2,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3k2qs/need_help_choosing_ryzen_9_9900x_or_intel_core/"
    },
    {
      "id": "1l38s9r",
      "title": "New build or upgrade?",
      "content": "Hello everyone, now my build feels the weight of the years and I was thinking to update something or change directly all or almost, the current configuration is as follows: \n\nCPU: Ryzen 2600\nMobo: gigabyte b450m gaming\nRam: crucial ballistix 16gb ddr4 \nGraphics: rx 6600 \nPsu: itek 750w 80plus bronze \nCase: corsair carbide 200r \n\n \nNow, everything works well, but with the last releases it starts to struggle and I have to go down to medium/low details \n\nI am out of the build round for several years so I do not know where to start, I have set a budget of 1500 euros, currently play in\nFHD, but by next year I would like to go to 2k at least 🥲. \n\nWhat do you recommend? Is it upgradable? Do I change everything or almost? \n\nAs already mentioned budget 1500 euro, for now monitors and various peripherals I have them, also ssd, and I assemble it myself \n\nI am not interested in various lights and glass cases in general, and I would prefer to stay on a mid/ full tower\n\nWhat do you recommend? \n\n",
      "author": "elgranchioborracho",
      "created_utc": 1749051586,
      "upvotes": 4,
      "upvote_ratio": 0.84,
      "num_comments": 3,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l38s9r/new_build_or_upgrade/"
    },
    {
      "id": "1l36x39",
      "title": "Upgrading After 8 Years – Is This Overkill?",
      "content": "I built a PC 8 years ago, and it was working fine until yesterday. Unfortunately, I think the PSU died because there are no lights or sounds when I try to turn it on. Since I'm not much of a gamer, I plan to reuse my GeForce GTX 1060 6GB from the previous build.\n\nHere’s the new build I’m considering:  \n[https://ca.pcpartpicker.com/list/TKMRb2](https://ca.pcpartpicker.com/list/TKMRb2)\n\nI’m mainly unsure whether I really need that processor, since I don’t game much. That said, in my previous setup (which had 32GB of RAM), I occasionally ran out of memory when running large database queries. I'm a computer science student, so performance for development tasks is more important to me than gaming.\n\nWhat are your thoughts on this build?",
      "author": "ZucchiniMotor3830",
      "created_utc": 1749047155,
      "upvotes": 4,
      "upvote_ratio": 0.65,
      "num_comments": 20,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l36x39/upgrading_after_8_years_is_this_overkill/"
    },
    {
      "id": "1l3k0i3",
      "title": "Advice for an ITX build?",
      "content": "I am currently using an ATX case with an i7 13700k ([specs](https://uk.pcpartpicker.com/list/C6nYzP)) but want to switch to AMD (9800 X3D specifically) for higher single core performance. \n\nThis is mostly because I play Kerbal Space Program, which, when 200 mods are installed alongside it, requires significant amounts of single core performance and RAM capacity (I average \\~30fps currently, with drops to below 10 and highs above 60). My other requirements are as a workstation, as I use MATLAB and Autodesk Inventor extensively. \n\nWith the required motherboard replacement, I also want to switch to an ITX case for space and aesthetic reasons. I have never built in ITX before, but have built two computers in full towers, so I have experience. I have put together a [provisional list](https://uk.pcpartpicker.com/list/RgCffd) subject to modification, keeping the GPU, SSD, and CPU cooler. \n\nMy questions are as follows:\n\n1. Will I see a significant performance increase from the CPU change or decrease from the reduced cooling in a smaller case?\n\n2. Is it reasonable to keep my current 32Gb (5200MHz) of RAM and upgrade to 64 (6000MHz) later down the line, given the difficulties that come with working in ITX cases and assuming that it is not an urgent necessity?\n\n3. To what extent is working in an ITX case more difficult than ATX?\n\n4. Are there specific, common issues that are easy to overlook when builing in ITX?\n\n5. Is an SF PSU required for ITX builds, or are they just a strong reccomendatiom?\n\n6. How would I avoid thermal, and particularly audial, issues given less airflow?",
      "author": "Forsaken_Alfalfa7214",
      "created_utc": 1749078580,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3k0i3/advice_for_an_itx_build/"
    },
    {
      "id": "1l36vua",
      "title": "Why is RTX 5070 not compatible with this build?",
      "content": "Hi,\n\nRecently did a build, and I am thinking of switching GPUs from RTX 5060 TI 16GB to RTX 5070. I am assembling the build and for some reason PcPartpicker shows that RTX 5070 is not compatible, what would be the reason these parts are not compatible?\n\nEven if I tick off the compatibility filter and manually add the RTX 5070, it shows no errors.\n\nThank you.\n\n[https://pcpartpicker.com/list/kQHwXR](https://pcpartpicker.com/list/kQHwXR)  \n",
      "author": "Phdocdk",
      "created_utc": 1749047069,
      "upvotes": 5,
      "upvote_ratio": 0.63,
      "num_comments": 18,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l36vua/why_is_rtx_5070_not_compatible_with_this_build/"
    },
    {
      "id": "1l3jwqs",
      "title": "5700x -> 5700x3D?",
      "content": "Has anyone done this and what kind of gaming benefits did they see? I'm maxing this Am4 build and have pieced it together over the past five years or so and my \"last\" (punn) upgrade was to a 4070ti Super Oc 16GB TUF and overall I'm seeing max usage on my GPU and, game dependant, less than max on my CPU so I don't think it's worth it?!?! I mostly game, and use it as a workstation with a bit of video ai upscaling (topaz) and as a torrent tower and occasional server; so I preferred MOAR cores hence the 5700 over 5600. Started this build with a 2700x, then a 3600, and now a 5700x... If anyone has first hand experience I would appreciate your words of wisdom.",
      "author": "Duedain",
      "created_utc": 1749078300,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 4,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3jwqs/5700x_5700x3d/"
    },
    {
      "id": "1l3js3p",
      "title": "Ryzen 7 3700X randomly overheating on a minimal task",
      "content": "I've had some issues with this CPU overheating already. One time, the thermal paste job was excessive or something and I had to remove some to prevent it from overheating right after boot. I am currently doing nothing but watching videos, and Core Temp spikes up for no reason at 95 celcius. My cooler is a Deepcool watercooler, forgot the model. Does anyone know why my Ryzen 7 3700X is overheating like this?",
      "author": "Hallo--7",
      "created_utc": 1749077970,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 13,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3js3p/ryzen_7_3700x_randomly_overheating_on_a_minimal/"
    },
    {
      "id": "1l3jmgr",
      "title": "Overclocking CPU",
      "content": "Recently, I bought an RTX 5070 for an upgrade from my GTX 1660, I have a Ryzen 5 3600x and currently am not able to purchase a stronger CPU I am wondering how I could go about Overclocking it while minimizing the risks?",
      "author": "TeaKyued",
      "created_utc": 1749077553,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 0,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3jmgr/overclocking_cpu/"
    },
    {
      "id": "1l3ji00",
      "title": "Trying to build vr pc setup what do you guys think ( sim racing and maybe flight games ?!",
      "content": "https://pcpartpicker.com/list/gqMqyW",
      "author": "StrictBlacksmith7791",
      "created_utc": 1749077221,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 0,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3ji00/trying_to_build_vr_pc_setup_what_do_you_guys/"
    },
    {
      "id": "1l3je5g",
      "title": "Monitor turns off with drivers when using a 5060ti",
      "content": "So I just got a 5060 Ti 16G VENTUS 2X OC and I’m  having problems getting it to work, everything is fine up until the windows 11 starting screen, then the monitor turns off\n\nIf I boot it in safe mode or if there is no drivers installed it works fine, but as soon as I try to install a gpu driver the monitor turns off. I have only tried connecting it through an HDMI cable\n\n\n\nSpecs:\n\nMoBo: B450m\n\nCPU: Ryzen 5 2600\n\n32gb Ram\n\nPower supply: Corsair CX750\n\n\n\nWhat I’ve tried:\n\nDDU to  uninstall drivers in safe mode\n\ntried installing old drivers (566.36 and 576.28)\n\nTried different hdmi cable\n\n\n\nNot tried:\n\nclean cmos\n\nupdate bios\n\nUsing displayport cable \n\n",
      "author": "Agonitee",
      "created_utc": 1749076936,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 0,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3je5g/monitor_turns_off_with_drivers_when_using_a_5060ti/"
    },
    {
      "id": "1l3dfs5",
      "title": "Should I get a new case?",
      "content": "Genuine question that I've been debating. I currently have the NZXT H5 Flow case (prior to 2024 model with the fan that blows up at the gpu) I upgraded my build and used the same case, which is as follows: Intel 285k, asus ROG strix z890-f, MSI Gaming Trio RTX 5090, 32gb Corsair vengeance ddr5 6400 (dual 16gb sticks), Corsair RM1200e psu, NZXT Kraken 240 aio. Then just some extra fans for exhaust/intake and my ssd storage etc. With the GPU it's a tight fit, but its in there, but it's like .5\" from touching the front intake fans on the case... I'm worried that I just don't actually have enough airflow now, does it look ok or should I consider moving to a bigger case and more fans? Those are the current temps while it \"idles\" but during gaming maxed out 4k I've only seen the GPU hit 165f at it's highest for a short time and CPU similar ranges. Am I just tweaking or is it ok? Also any recommendations for cases? I'd prefer something I could just pick up at say Best Buy instead of shipped, possibly drive 2 hrs to micro center too. Pittsburgh area.\n\nhttps://imgur.com/YohgzVx\nhttps://imgur.com/bISL72P\nhttps://imgur.com/GUoKv5J",
      "author": "SlidewaysS14",
      "created_utc": 1749062436,
      "upvotes": 2,
      "upvote_ratio": 0.75,
      "num_comments": 4,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3dfs5/should_i_get_a_new_case/"
    },
    {
      "id": "1l3j0z6",
      "title": "Id cooling white Frozn a620 rgb for 7 9800x3d",
      "content": "Im gonna build new all white gaming pc and i want a cpu cooler boxy and\nLook good with my aorus 5080 ice\nAnd i want to ask you is white frozn a620 good for 7 9800x3d \nRegion:usa",
      "author": "efeyit",
      "created_utc": 1749075977,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 0,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3j0z6/id_cooling_white_frozn_a620_rgb_for_7_9800x3d/"
    },
    {
      "id": "1l3iy4o",
      "title": "When can I finally say it's the CPU? Despite testing, system still locking up on idle in Windows 11, even after replacing motherboard",
      "content": "The only things I have left to isolate are the RAM and the CPU.  And I'm tired.  I'm going to be honest in decades of building PCs I have never ever had this many issues or this kind of issue.\n\nMy issue has been ongoing for about a month now.  I wanted to upgrade my CPU because my old mobo/cpu was starting to show age (and still is, honestly, because I've already had to reassemble my old system back together for work reasons).  \n\nProblem: my system will either fail too boot or will freeze entirely.  There is no specific trigger.  It happens while idling in windows.  Most recently at 9 AM today just after I put my new and old parts into a new motherboard.  There is no event or error logged in the [Windows Event Viewer](https://imgur.com/oMqD13F).  I'm very concerned that the computer is going to lock up and freeze while I'm typing this message.\n\nLet me go through my parts and what I've done:\n\n* AsRock B850 Riptide Wifi motherboard (this one is new and replaced an ASUS motherboard that was showing the same signs of faults).  When it fails to boot, I get a solid green light (boot device failure).  With the prior ASUS board, I would get a solid white light (VGA error, but see below).\n* G.SKILL Flare X5 Series (AMD Expo) DDR5 RAM 32GB (2x16GB) 6000MT/s I ordered a sescond set specifically to test and see if the first one was faulty -- I tried running MemTest86 but could not complete the test because of the computer freezing...even while running the test just off of a USB flash drive with no other OS.  For what it's worth, my hard drive has never put up an error regarding the RAM except for the first time I installed them in the ASUS motherboard, and even with the freezes the RAM has never failed any pass it has done in MemTest86 (I only made it as deep as 3 passes before freezing though).\n* AMD Ryzen 5 9600X -- apparently the x3d has actual set the CPU on fire issues but I haven't even gotten to that stage that I saw.  I inspected the CPU and the MOBO for damage/bent pins (both the old and the new one) and did not see anything.  The box the CPU came in was damaged but the plastic interior casing did not appear to be damaged\n* PSU -- corsair 750e gold.  It has more than enough power to run these things.  I did buy two 8 pin cables for the motherboard -- although I've never gotten an indication that the power draw was too much.  When the computer freezes, it jsut stops.  The picture doesn't disappear, the screen doesn't turn off.  The PSU is a little over one year old, and I got it when I upgraded my GPU.\n* GPU: RTX 4060ti 16 GB -- yeah, which I have been wondering if this is THE PROBLEM because even with the new motherboard boot-up this morning only one monitor turned on despite both display port cables being plugged into the GPU.  And yet...the GPU works just fine in my old system.  It ran for hours just fine playing games this weekend with both monitors plugged in -- but then again the freezes never occur while playing games specifically.  I think I can rule out the GPU being the issue.  I've had it for a little over a year now.\n* OS is Windows 11.  I did not want to upgrade to Windows 11 but I had to with the ASUS motherboard I returned because otherwise the on board wifi wouldn't work.  I have already done one fix regarding gameinput being doubled that could cause freezes after gameplay.  But the freezing here persists.\n\nI'm on the most up to date motherboard drivers (I had to flash the.  I have previously used DDU to scrub old graphics drivers and I am currently on the March or April drivers (I can't remember, but they were the last stable ones I used).\n\nFor fear of my computer freezing mid sentence, I'm stopping here.  But I'm out of ideas.  It's the CPU.  Or it's the RAM.  Or there is something I'm missing.",
      "author": "asher1611",
      "created_utc": 1749075774,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 0,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3iy4o/when_can_i_finally_say_its_the_cpu_despite/"
    },
    {
      "id": "1l3ix7w",
      "title": "Is this a good productivity build? (Hot take, I'm reusing my very old 1560 super while I find a good GPU deal)",
      "content": "Hey all! I'm an in-house Motion Designer and 4K Video Editor. I'm looking to build a new PC since my current one is pretty much outdated. Put together some parts (reusing some from my current build) and would love to know if these are good choices!\n\nRegarding the GPU topic, my budget doesn't allow me to purchase a brand new overpriced GPU right now, so I figured I'm gonna be okay reusing my current dinosaur: the 1650 Super OC 4 GB (edit: typo in the title, mb). I know this is gonna be a bottleneck, but it's a temporary fix while my pocket recovers lol. Do you think it'll be fine for some time? What GPU would you recommend for my work? (Mostly the Adobe Suite, I often multitask between 2-3 software programs for my daily work.) I thought about the 4070 Ti 12 GB, but I hear options!\n\nHere's the planned build, anything that's listed for $0.00 it's because I already own it and I'll be reusing it:\n\n[PCPartPicker Part List](https://pcpartpicker.com/list/Ftd3kf)\n\n|Type|Item|Price|\n|:-|:-|:-|\n|**CPU**|[AMD Ryzen 9 7900X 4.7 GHz 12-Core Processor](https://pcpartpicker.com/product/bwxRsY/amd-ryzen-9-7900x-47-ghz-12-core-processor-100-100000589wof)|$321.99 @ Newegg|\n|**CPU Cooler**|[Thermalright Peerless Assassin 120 SE 66.17 CFM CPU Cooler](https://pcpartpicker.com/product/hYxRsY/thermalright-peerless-assassin-120-se-6617-cfm-cpu-cooler-pa120-se-d3)|$34.90 @ Amazon|\n|**Thermal Compound**|[ARCTIC MX-4 (2019) 4 g Thermal Paste](https://pcpartpicker.com/product/JmYLrH/arctic-mx-4-2019-4-g-thermal-paste-actcp00002b)|$6.99 @ Amazon|\n|**Motherboard**|[Asus TUF GAMING B650-PLUS WIFI ATX AM5 Motherboard](https://pcpartpicker.com/product/Pz2WGX/asus-tuf-gaming-b650-plus-wifi-atx-am5-motherboard-tuf-gaming-b650-plus-wifi)|$179.99 @ Amazon|\n|**Memory**|[Corsair Vengeance 64 GB (2 x 32 GB) DDR5-5200 CL40 Memory](https://pcpartpicker.com/product/rgM48d/corsair-vengeance-64-gb-2-x-32-gb-ddr5-5200-cl40-memory-cmk64gx5m2b5200c40w)|$159.99 @ Amazon|\n|**Storage**|[ADATA SU800 512 GB 2.5\" Solid State Drive](https://pcpartpicker.com/product/V3mxFT/adata-ultimate-su800-512-gb-25-solid-state-drive-asu800ss-512gt-c)|Purchased For $0.00|\n|**Storage**|[Western Digital Blue 1 TB 2.5\" Solid State Drive](https://pcpartpicker.com/product/GTCD4D/western-digital-blue-1tb-25-solid-state-drive-wds100t2b0a)|Purchased For $0.00|\n|**Storage**|[Samsung 990 Pro 1 TB M.2-2280 PCIe 4.0 X4 NVME Solid State Drive](https://pcpartpicker.com/product/FsqPxr/samsung-990-pro-1-tb-m2-2280-pcie-40-x4-nvme-solid-state-drive-mz-v9p1t0bw)|$99.99 @ Amazon|\n|**Storage**|[Western Digital WD\\_Black SN850X 2 TB M.2-2280 PCIe 4.0 X4 NVME Solid State Drive](https://pcpartpicker.com/product/crKKHx/western-digital-wd_black-sn850x-2-tb-m2-2280-pcie-40-x4-nvme-solid-state-drive-wds200t2x0e)|$153.00 @ Amazon|\n|**Video Card**|[Gigabyte WINDFORCE OC GeForce GTX 1650 SUPER 4 GB Video Card](https://pcpartpicker.com/product/MdFKHx/gigabyte-geforce-gtx-1650-super-4-gb-windforce-oc-video-card-gv-n165swf2oc-4gd)|Purchased For $0.00|\n|**Case**|[Lian Li LANCOOL 216 RGB ATX Mid Tower Case](https://pcpartpicker.com/product/QcddnQ/lian-li-lancool-216-rgb-atx-mid-tower-case-lancool-216rw)|$111.99 @ Amazon|\n|**Power Supply**|[Corsair RM750e (2025) 750 W Fully Modular ATX Power Supply](https://pcpartpicker.com/product/jfHp99/corsair-rm750e-2025-750-w-fully-modular-atx-power-supply-cp-9020295-na)|$99.99 @ Amazon|\n|**Operating System**|[Microsoft Windows 11 Pro OEM - DVD 64-bit](https://pcpartpicker.com/product/yjbTwP/microsoft-windows-11-pro-oem-dvd-64-bit-fqc-10529)|Purchased For $0.00|\n|**Monitor**|[Asus ProArt Display PA248QV 24.1\" 1920 x 1200 75 Hz Monitor](https://pcpartpicker.com/product/Mc7p99/asus-proart-display-pa248qv-241-1920-x-1200-75-hz-monitor-pa248qv)|Purchased For $0.00|\n|**Mouse**|[Logitech LIFT Bluetooth/Wireless Optical Mouse](https://pcpartpicker.com/product/FX7G3C/logitech-lift-bluetoothwireless-optical-mouse-910-006466)|Purchased For $0.00|\n|**Headphones**|[Philips SHP9500  Headphones](https://pcpartpicker.com/product/BCJkcf/philips-headphones-shp9500)|Purchased For $0.00|\n|**Custom**|Velocifire BK75 75% Pre-Built Mechanical Keyboard|Purchased For $0.00|\n|*Prices include shipping, taxes, rebates, and discounts*|||\n|**Total**|**$1168.83**||\n|Generated by [PCPartPicker](https://pcpartpicker.com) 2025-06-04 18:20 EDT-0400|||\n\nThanks for reading all that!",
      "author": "FairRecording7870",
      "created_utc": 1749075710,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 10,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3ix7w/is_this_a_good_productivity_build_hot_take_im/"
    },
    {
      "id": "1l3irq6",
      "title": "Storage upgrade (second SSD or?)",
      "content": "Somehow despite only playing like 3 games I’ve managed to fill up my 1TB SSD almost 90% of the way. \n\nI want to be able to keep all my documents and data so what is the best way to go about this?\n\nDo I buy a new SSD with double the storage and transfer my stuff over?\n\nDo I just buy a second SSD and install it? How do I set it up to be able to use both at the same time and ensure there are no issues. ",
      "author": "Tall_Anteater_3477",
      "created_utc": 1749075312,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 13,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3irq6/storage_upgrade_second_ssd_or/"
    },
    {
      "id": "1l3iqrm",
      "title": "First time building just wanted someone to have a look over and see if I've made any mistakes or should have picked different components.",
      "content": "\\[PCPartPicker Part List\\](https://uk.pcpartpicker.com/list/xdwT9C) \n\nCPU- AMD Ryzen 5 7600X 4.7 GHz 6-Core Processor- £144.97 @ Amazon UK \n\nCPU Cooler- Thermalright Peerless Assassin 120 SE 66.17 CFM CPU Cooler- £29.99 @ [Overclockers.co.uk](http://Overclockers.co.uk) \n\nMotherboard- Gigabyte B650 EAGLE AX ATX AM5 Motherboard- £128.47 @ Amazon UK \n\nMemory- Corsair Vengeance 32 GB (2 x 16 GB) DDR5-6000 CL36 Memory- £74.99 @ [Overclockers.co.uk](http://Overclockers.co.uk) \n\nStorage- Crucial P3 Plus 1 TB M.2-2280 PCIe 4.0 X4 NVME Solid State Drive- £61.00 @ MoreCoCo \n\nVideo Card- Sapphire NITRO+ Radeon RX 9070 16 GB Video Card- £599.99 @ [Overclockers.co.uk](http://Overclockers.co.uk) \n\nCase- Montech XR ATX Mid Tower Case- £55.47 @ [Scan.co.uk](http://Scan.co.uk) \n\nPower Supply- Gigabyte UD750GM 750 W 80+ Gold Certified Fully Modular ATX Power Supply- £79.00 @ Computer Orbit \n\nMonitor- MSI G272QPF E2 27.0\" 2560 x 1440 180 Hz Monitor- £159.00 @ Box Limited \n\n Total £1332.88\n\nJust want to know what people would change, or if there are any compatability issues or anything like that. \n\nIt's really fun planning the build but I just don't want to order things and find out I've messed it up, I'd prefer not to spend much more but am willing to go up to £1400.",
      "author": "A-Simple-Request",
      "created_utc": 1749075247,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 0,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3iqrm/first_time_building_just_wanted_someone_to_have_a/"
    },
    {
      "id": "1l39pbv",
      "title": "Need monitor advice for my first build! (Ryzen 5 7600 + RX 7800 XT)",
      "content": "Hey r/buildapc!\n\nJust finished picking out all my parts for my new gaming PC build and now I need to figure out the monitor situation. Could really use some advice here.\n\n# My Build:\n\n* **CPU:** AMD Ryzen 5 7600 (3.8GHz base, 5.1GHz boost)\n* **GPU:** ASUS TUF Gaming Radeon RX 7800 XT OC (16GB VRAM)\n* **RAM:** G.Skill 32GB DDR5-6000 Kit\n* **Mobo:** ASUS TUF Gaming B650-PLUS WiFi\n* **Storage:** Lexar NM790 2TB NVMe SSD\n* **PSU:** Corsair RM750x 750W 80+ Gold\n* **Cooling:** be quiet! Dark Rock Pro 5\n* **Case:** Fractal Design North\n\n# What I'm looking for:\n\n* **Resolution:** Thinking 1440p (open to 4K if it makes sense?)\n* **Refresh Rate:** At least 144Hz\n* **Budget:** Preferably under €250-300, but willing to go higher if it's really worth it\n* **Use case:** Mainly gaming (Single player games and strategy games sometimes FPS)\n\n# My questions:\n\n1. Should I go 1440p 144Hz+ or is 4K worth considering with the RX 7800 XT?\n2. Any specific models you'd recommend for this setup?\n3. IPS vs VA panel - what's better for gaming?\n4. Is curved worth it or just marketing?\n\nI've been looking at:\n\n* AOC Q27G3XMN (\\~€280)\n* AOC Q27G4XF (\\~€240)\n* Samsung Odyssey G5 (\\~€350)\n\nAny advice would be amazing! This is my first time building and I don't want to bottleneck my system with a crappy monitor.\n\nThanks in advance! 🙏\n\n**EDIT:** Also open to budget alternatives under €200 if they're still decent for this build!",
      "author": "LawzAxis",
      "created_utc": 1749053736,
      "upvotes": 3,
      "upvote_ratio": 1.0,
      "num_comments": 4,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l39pbv/need_monitor_advice_for_my_first_build_ryzen_5/"
    },
    {
      "id": "1l3d324",
      "title": "Asus GeForce RTX 5060 Ti Prime OC 16GB vs MSI NVIDIA GeForce RTX 5060 Ti 16GB VENTUS 2X OC PLUS",
      "content": "Hello, I am looking to upgrade my current GPU (Nvidia Geforce RTX 2070 super). Would you be able to recommend if the Ti Prime version is worth £50 extra due to its three fans compared to the Ventus version that only has two fans?\n\nhttps://www.scan.co.uk/products/msi-nvidia-geforce-rtx-5060-ti-ventus-2x-oc-plus-16gb-gddr7-ray-tracing-graphics-card-dlss-4-4608-co - £400\n\nhttps://www.overclockers.co.uk/asus-geforce-rtx-5060-ti-prime-oc-16gb-gddr7-pci-express-graphics-card-gra-asu-05010.html - £450 ",
      "author": "Catalin10",
      "created_utc": 1749061605,
      "upvotes": 2,
      "upvote_ratio": 0.75,
      "num_comments": 1,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3d324/asus_geforce_rtx_5060_ti_prime_oc_16gb_vs_msi/"
    },
    {
      "id": "1l39abr",
      "title": "Best monitor under £300",
      "content": "Looking for the best 1440p gaming monitor for under £300 right now, would prefer a refresh rate over 200hz lowest 144hz",
      "author": "Adept_Appearance5891",
      "created_utc": 1749052767,
      "upvotes": 3,
      "upvote_ratio": 0.81,
      "num_comments": 9,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l39abr/best_monitor_under_300/"
    },
    {
      "id": "1l3hpyo",
      "title": "Second build ever - 3000$",
      "content": "Hey guys,\n\nA few of us are looking to build a pretty powerful setup to play games in 1440p and handle upcoming titles as well.  \nWe also wanted to make sure our build would be easy to upgrade down the line, which is why we went with a 1000W power supply and a larger case.\n\nThe build is mostly based on research we’ve done here on this sub and on a few other forums.\n\nWhat do you think overall? We’re open to any suggestions!\n\nPS : Although I’ve read the subreddit rules, it’s a bit difficult for me to fully understand them since English isn’t my first language.  \nIf this post breaks any rules, feel free to remove it.\n\nPCPartPicker Part List: [https://ca.pcpartpicker.com/list/tmzj74](https://ca.pcpartpicker.com/list/tmzj74)\n\nCPU: AMD Ryzen 7 9800X3D 4.7 GHz 8-Core Processor\n\nCPU Cooler: Cooler Master MasterLiquid 360L Core ARGB Liquid CPU Cooler\n\nMotherboard: MSI MAG B850 TOMAHAWK MAX WIFI ATX AM5 Motherboard\n\nMemory: G.Skill Trident Z5 Neo 32 GB (2 x 16 GB) DDR5-6000 CL30 Memory\n\nStorage: Crucial T500 2 TB M.2-2280 PCIe 4.0 X4 NVME Solid State Drive\n\nVideo Card: Asus PRIME GeForce RTX 5070 Ti 16 GB Video Card\n\nCase: Fractal Design North XL ATX Full Tower Case\n\nPower Supply: \\*ARESGAME AGT 1000 W 80+ Gold Certified Fully Modular ATX Power Supply\n\nCase Fan: Noctua A14 PWM chromax.black.swap 82.52 CFM 140 mm Fan\n\nTotal: $3002.84",
      "author": "Domwell",
      "created_utc": 1749072671,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 6,
      "flair": "Discussion",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3hpyo/second_build_ever_3000/"
    },
    {
      "id": "1l3hg7f",
      "title": "Please help me to review my current build",
      "content": "Hey everyone,\n\nI’m planning to build a new PC and would really appreciate your feedback on my PCPartPicker list (link below). I want to use it for high-end gaming, video editing, photo editing and some local AI Image generation.  \nMy Budget was targeted at around 2k € but would be willing to go up 2.5k\n\nHeres my current build at Dubaro (configure your PC and they built it for you):  \n[https://pcpartpicker.com/list/W2wGDj](https://pcpartpicker.com/list/W2wGDj)\n\nI could get this build currently for **2.2k €**.\n\nThings I'm unsure about:\n\n* Is the 5070 Ti the sweet spot right now or should I stretch for the 5080?\n* Any bottlenecks or mismatches with this configuration?\n* Is the cooling sufficient for long gaming/editing sessions? Or should I adjust something?",
      "author": "Alex_EHM",
      "created_utc": 1749072010,
      "upvotes": 1,
      "upvote_ratio": 0.67,
      "num_comments": 7,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3hg7f/please_help_me_to_review_my_current_build/"
    },
    {
      "id": "1l386ed",
      "title": "Newbie trying to build a €350 budget PC - I changed the motherboard and CPU(accidentally deleted my previous post (⁠T -⁠ T⁠) )",
      "content": "Hey everyone!\n\nThis is my first time building a PC, and I’ve put together this budget-friendly build.\n\nI decided to spend a little more on the motherboard an and spend double on a newer APU (going from a Ryzen 5 3400G costing only €60 to a Ryzen 5 5500G ).\n\nMy budget is very limited, and I’m not looking to spend more right now. Since it's my first build, I also don’t want to take any risks buying second-hand components from people I don’t know. I just want to play it safe and get something decent that works for nowadays games, even at low specs)\n\nHere’s the build I came up with:\n\nRyzen 5 5500G – €123.91 (instead of R5 3400G for €60)\n\nGigabyte B550M DS3H– €96 (I was gonna get the B550M-k for only €77, but that mobo seems to have very weak VRM and no heatsinks, so for a future CPU update I think it wouldn't be the ideal choice)\n\n16GB RAM 3200MHz (2x8GB) – €37.56\n\nSSD NVMe 512GB – €32.52\n\nPSU Mars Gaming Newskill 650W – €40.57\n\nPc Case €27.34\n\nTotal: €357.93~\n(Buying everything from Amazon since local retailers can't beat their price and I don't exactly trust them based on online reviews.)\n\n\n---\n\nI thank everyone that answered my previous post yesterday. That clarified some important things as how to choose  the memory and why the Ryzen 5 5600G wasn't the best idea 🙏🏼.\n\nWhat do you think? Will this setup run games like Spider-Man 1 & 2, Red Dead Redemption 2, Resident Evil 4 Remake, and God of War — at least on low settings with frame generation?\n\nShould I change anything in this build?\nAny feedback would be super appreciated. \n",
      "author": "Accomplished-Way2573",
      "created_utc": 1749050140,
      "upvotes": 4,
      "upvote_ratio": 0.83,
      "num_comments": 7,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l386ed/newbie_trying_to_build_a_350_budget_pc_i_changed/"
    },
    {
      "id": "1l3bg3j",
      "title": "About to pull the trigger, what do you all think?",
      "content": "I got a 300$ budget for this upgrade. What do you all think? (I currently have a i5-6500 and GTX 1060 6GB)\n\n[PCPartPicker Part List](https://pcpartpicker.com/list/d6Lbfd)\n\nType|Item|Price\n:----|:----|:----\n**CPU** | [AMD Ryzen 5 5600 3.5 GHz 6-Core Processor](https://pcpartpicker.com/product/PgcG3C/amd-ryzen-5-5600-36-ghz-6-core-processor-100-100000927box) | $128.69 @ Amazon \n**Thermal Compound** | [ARCTIC MX-6 4 g Thermal Paste](https://pcpartpicker.com/product/k2pzK8/arctic-mx-6-4-g-thermal-paste-actcp00080a) | $8.57 @ Amazon \n**Motherboard** | [Gigabyte B550 EAGLE WIFI6 ATX AM4 Motherboard](https://pcpartpicker.com/product/fzNscf/gigabyte-b550-eagle-wifi6-atx-am4-motherboard-b550-eagle-wifi6) | $139.41 @ Amazon \n | *Prices include shipping, taxes, rebates, and discounts* |\n | **Total** | **$276.67**\n | Generated by [PCPartPicker](https://pcpartpicker.com) 2025-06-04 13:22 EDT-0400 |\n\nI'm thinking about changing to the 5500, because it's cost effectiveness is much better. What do you all think?",
      "author": "qwertyyyyyyy116",
      "created_utc": 1749057778,
      "upvotes": 2,
      "upvote_ratio": 0.99,
      "num_comments": 7,
      "flair": "Build Ready",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3bg3j/about_to_pull_the_trigger_what_do_you_all_think/"
    },
    {
      "id": "1l3bd0e",
      "title": "Upgrading pc to am5",
      "content": "So i have the retail rx 6800 amd gpu and i am planning to upgrade to am5. I just bought the 9800 x3d amd and i was looking for suggestions for the motherboard and rams? Btw is the gpu fine with this upgrade? Thanks in advance",
      "author": "ricmercedes",
      "created_utc": 1749057581,
      "upvotes": 2,
      "upvote_ratio": 0.67,
      "num_comments": 7,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3bd0e/upgrading_pc_to_am5/"
    },
    {
      "id": "1l3gz4n",
      "title": "ASUS TUF 5090 unbearable coil whine",
      "content": "Recently, I got a pretty good deal on the ASUS TUF 5090 to replace my ASUS Prime 5070 Ti.\n\nThe 5070 Ti was actually a great GPU, completely silent, no coil whine even when drawing over 300W at 3200+ MHz.\n\nBut the TUF 5090 is a different story. It's unbearable. I connected my PC to my TV for gaming and sit about 3 meters away on the sofa, yet I can clearly hear the coil whine, even with the fans spinning at 1600 RPM.\n\nI tried enabling V-Sync, capping the FPS at 60, and undervolting to 0.89V, which brings the power draw down to around 200W in-game, but the coil whine is still very noticeable and unbearable.\n\nAfter some trial and error, I found that the coil whine is closely tied to the GPU frequency. When I lowered the voltage further to 0.85V, bringing the frequency down to around 2100 MHz, the coil whine finally became bearable (though still noticeable).\n\nIt makes me wonder if the reason this card was on sale is because of the excessive coil whine.\n\nIt even produces slight coil whine when idle. Is it normal?\n\nIs there any fix that can help reduce coil whine? ",
      "author": "adam444555",
      "created_utc": 1749070869,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 3,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3gz4n/asus_tuf_5090_unbearable_coil_whine/"
    },
    {
      "id": "1l3b7ji",
      "title": "Upgrade recommendations?",
      "content": "Hello friends! Just want to preface this by saying I'm not very computer savvy and have no experience building PCs, so please forgive anything I leave out. \n\nI mainly game on my pc and play older games, mostly world of warcraft.\n\nI have the following PC setup: \n\nGPU: NVIDIA GeForce GT 710 (985 MB) \n\nCPU: AMD Ryzen 7 3800X 8-Core Processor \n\nRAM: 16 GB \n\nStorage: 932 GB SSD Samsung SSD 870 EVO 1TB, 466 GB SSD Samsung SSD 970 EVO 500 GB \n\nPSU: cx550m\n\nRight now the wow gameplay is for the most part acceptable, but it does lag an annoying amount. \n\nChatgpt helped identify my GPU as the biggest bottleneck in my setup, and gave me some suggestions to check out on newegg, but I wanted to see if anyone could give me their opinion on what they would upgrade.\n\nI'm trying to talk myself out of a $1k budget, aiming for closer to $500 in upgrades overall. Not trying to go crazy, just want an overall smooth gameplay for older games like wow. \n\nIf anyone could point me in the right direction that would be hugely appreciated!",
      "author": "No-Succotash1965",
      "created_utc": 1749057233,
      "upvotes": 2,
      "upvote_ratio": 0.76,
      "num_comments": 11,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3b7ji/upgrade_recommendations/"
    },
    {
      "id": "1l3gxlq",
      "title": "AM5 upgrade",
      "content": "hi all, im currently considering upgrading to am5 due to low gpu wattage on my new 9070 xt due to what i believe is a bottleneck from my ryzen 9 5900x. my current specs are\n\naorus b550 ax v2 mb\n\nryzen 9 5900x\n\n32 gb ram \n\nasus prime rx 9070 xt.\n\ncould anyone recommend me some a motherboard ram and cpu from the am5 line that will let my 9070 xt spread its wings fully and allow me to truly see the performance it can make. :)",
      "author": "Mooseboy1467",
      "created_utc": 1749070766,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 3,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3gxlq/am5_upgrade/"
    },
    {
      "id": "1l3gu39",
      "title": "Trapped in a BIOS boot loop",
      "content": "Hey all. I recently upgraded my CPU and MOBO after replacing a recently deceased 2080ti. I finally installed everything yesterday, but I'm having issues getting the system to boot. It POSTs perfectly fine, sends me to the BIOS setup (also fine), but when I save and exit, it restarts to the BIOS screen and will not load Windows (less fine). The SSD/boot manager is detected, and enabling CSM just locks up the PC with the \"reboot and select proper boot device\" prompt. Been scratching my head for about five hours now and can't find any solutions that don't require me to spend more and/or wipe data. \n\nAttempted solutions so far:\n\n- Removed all other drives\n- Switched SATA ports\n- Reseated RAM \n- Reseated SSD\n- Reset CMOS\n- Toggled CSM\n- Toggled Fast Boot\n- Toggled OS Type/Secure Boot \n\nSPECS:\n\n- ASUS ROG Strix B850-F\n- AMD Ryzen 7 9800X3D\n- TeamGroup DDR5 6000 32GB (2x16)\n- PNY GeForce RTX 5080\n\nSome additional information, if possibly relevant: I've used this SSD across three builds (including this one) and so it's roughly 7.5 years old. I didn't do any prep/do a fresh OS install. \n\nAnyone have any ideas? ",
      "author": "agentlewind",
      "created_utc": 1749070523,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 5,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3gu39/trapped_in_a_bios_boot_loop/"
    },
    {
      "id": "1l3gtty",
      "title": "Is RX 9070 worth it for ~700$ ??",
      "content": "This is the cheapest it can get in my coutry.. with 9070 XT being around \\~825$. ",
      "author": "Giamilchoi10",
      "created_utc": 1749070505,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 10,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3gtty/is_rx_9070_worth_it_for_700/"
    },
    {
      "id": "1l3gtg9",
      "title": "What motherboard should I get",
      "content": "Like the title says, I need a motherboard that's atx, that has 4 ssd slots, can run at 8200 mhz, and has no pcie lane sharing so that it doesn't affect my GPU. I'm making a new high end pc since my old PC is a decade old, so far I have a 4090 Fe, ryzen 9 9950x, viper xtreme 5 ddr5 ram 48gb 8200mt/s, and a EVGA supernova 1000 P5 PSU.",
      "author": "GamerDude1130",
      "created_utc": 1749070480,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 8,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3gtg9/what_motherboard_should_i_get/"
    },
    {
      "id": "1l3gt2j",
      "title": "Splitting my PC in 2 - Need new pairing for RX6600",
      "content": "Ripping apart my current gaming rig to use as a work desktop & have a GPU & RAM to build a new gaming PC off of. Open to both Ryzen & Intel. 1080p\n\nParts to build off of - [https://ca.pcpartpicker.com/list/fwgRb2](https://ca.pcpartpicker.com/list/fwgRb2)\n\nI can fill in the dots for storage/power once I'm ready to roll on it, just looking for motherboard & CPU for now :)\n\nNEW MOBO & CPU \\~500-600$CAD\n\nGPU - RX6600 (8GB GDDR6)\n\nRAM - 2x 16GB (DDR4-3600)",
      "author": "JDCoa",
      "created_utc": 1749070451,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3gt2j/splitting_my_pc_in_2_need_new_pairing_for_rx6600/"
    },
    {
      "id": "1l3gs4z",
      "title": "New pc build. Let me know if this is a good list",
      "content": "Hi yall, My first time building a PC I was just wondering if this would be a good build/ any recs you have for changes or for PSU.\n\nCPU: AMD ryzen 7 9800X3D\n\nCooler: ARCTIC Liquid Freezer III 360 A-RGB 48.82 CFM Liquid CPU Cooler\n\nMOBO: Asus TUF GAMING B850-PLUS WIFI ATX AM5 Motherboard\n\nRAM: G.Skill Trident Z5 Neo RGB 32 GB (2 x 16 GB) DDR5-6000 CL30 Memory\n\nStorage: Western Digital WD\\_Black SN850X 2 TB M.2-2280 PCIe 4.0 X4 NVME Solid State Drive\n\nGPU: Asus TUF GAMING OC GeForce RTX 5070 Ti 16 GB Video Card\n\nTower: Lian Li LANCOOL 217 ATX Mid Tower Case\n\nPSU: Corsair RM850x (2024) 850 W Fully Modular ATX Power Supply",
      "author": "Total-Wait-9013",
      "created_utc": 1749070384,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3gs4z/new_pc_build_let_me_know_if_this_is_a_good_list/"
    },
    {
      "id": "1l3gpd0",
      "title": "used 6700XT for €250",
      "content": "I am looking to buy a used 6700XT for €250, wondering of this is a good deal or not. ",
      "author": "laim_ezra",
      "created_utc": 1749070188,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 3,
      "flair": "Discussion",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3gpd0/used_6700xt_for_250/"
    },
    {
      "id": "1l3gjzl",
      "title": "Is R7 7800X3D really bad for productivity",
      "content": "I would preferably buy the 7800x3d but people say it's only good for gaming but I don't think so. I will use it for gaming and productivity (blender, adobe products). I rarely work with highly realistic scenes and I don't think my cpu is gonna cause issues. I really don't want the other cpus because I prefer the 7800x3d.  ",
      "author": "dawgsofast",
      "created_utc": 1749069826,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 14,
      "flair": "Solved!",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3gjzl/is_r7_7800x3d_really_bad_for_productivity/"
    },
    {
      "id": "1l3gjdg",
      "title": "Would like to see the best DDR4 CPU that can keep up with my 2080ti FE",
      "content": "I have pushed my i9-9900k to its max, a stable 5.0ghz overclock, but I think its time for it to be passed on to my little brother who is still rocking my old 6600k. Its a great CPU don't get me wrong, but it has always struggled to keep up with my 2080ti. Now I'm having issues running basic games like league of legends, or cs2. I have upgraded to a 2k monitor to finally upgrade from my 1080 monitor, and that made thing worse, lmao. Anyway, I think that's enough of me trying to articulate my actions.\n\n**TLDR:**\n\nBottom line is I need a new Motherboard, and Processor combo, because as it stands I ain't getting enough out of this i9-9900k as I would have hoped. and Id like to keep my DDR4 components if possible, but give me some top of the line Intel options for this platform. And if I gotta upgrade memory too, I gotta upgrade. Anything for shelf life really.\n\nHere's my current rig:\n\n**CPU:** Intel(R) Core(TM) i9-9900K CPU @ 3.60GHz\n\n**RAM:** 4x 16GB (64.0 GB) DDR4 (edit: dominator platinum 3200)\n\nStorage (4): SSD - 1.9 TB,SSD - 3.6 TB,+2 more\n\n**GPU processor:** NVIDIA GeForce RTX 2080 Ti\n\nCUDA cores: 4352\n\nGraphics clock: 1635 MHz\n\nDedicated video memory: 11264 MB GDDR6\n\nBus: PCI Express x8 Gen3\n\nDisplay (1): Asustek Computer Inc ROG PG27AQN\n\nResolution: 2560 x 1440 (recommended)\n\nRefresh rate: 360 Hz\n\nDesktop color depth: Highest (32-bit)\n\nHDCP: Supported\n\nDisplay (2): BenQ ZOWIE XL LCD\n\nResolution: 1920 x 1080 (recommended)\n\nRefresh rate: 240 Hz\n\nDesktop color depth: Highest (32-bit)\n\nDisplay technology: G-SYNC Compatible\n\nHDCP: Supported",
      "author": "Lopsided_Wrap2971",
      "created_utc": 1749069783,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 5,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3gjdg/would_like_to_see_the_best_ddr4_cpu_that_can_keep/"
    },
    {
      "id": "1l3gj6y",
      "title": "9060xt o 7900gre o 7800xt",
      "content": "    7900gre or 7800xt at 430 euros used better than 9060xt 16gb?\n    \n    to match with 5800x3d",
      "author": "Icy-Astronomer-6172",
      "created_utc": 1749069771,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 2,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3gj6y/9060xt_o_7900gre_o_7800xt/"
    },
    {
      "id": "1l3gifv",
      "title": "Need help choosing an external enclosure for my SSD M.2 NVMe",
      "content": "Hello! So I have two M.2 NVMe SSDs that I want to reuse  from my old laptop's internal board, and use them as an external storage using an enclosure. I tried [this one](https://www.amazon.es/-/pt/dp/B08DCXB3CD?crid=93Q48OS6FT6I&dib=eyJ2IjoiMSJ9.cE-tpa5RnAa9cmmaU1kU3NmioIe6JyCOjsTctsa7EwKIB5EI2tHF1i4_VydmazTgMB56rhxNp9y-lRM-H0sXa3SZq4gaaOXfjP6WeeYJbLPk_Tu6qT4ZQ52p2FQIvTMm6337IgoVE14pYHMAGWekN0gO76OIXynwz4IVPA341tjZdLo2lIQISDSeKk_hvW-TnP53TkpYFjjAi6iNhsTg9NbB8mrhnZsD5xXeKPk5BvyL0GJEFJq8D_OARlLXLLW0_f1Esc04CHviG0sKx1z5kWzEevT5GsLxwLdP9RKUlE8.MkwjWIp8NKLrGsSLnVkXg9MJYdbKRUBO9Ba5qDVm-kg&dib_tag=se&keywords=orico%2Bnvme%2Bcase&qid=1744672559&sprefix=orico%2Bnvme%2B%2Caps%2C130&sr=8-5&th=1) from ORICO, and it stopped working (my computer stopped finding a disk to mount) so I returned it.\n\nHas anyone ever bought an enclosure like this that you can recommend and vouch it works properly?\n\nThank you in advance!",
      "author": "Level_Throat_6427",
      "created_utc": 1749069720,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 1,
      "flair": "Peripherals",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3gifv/need_help_choosing_an_external_enclosure_for_my/"
    },
    {
      "id": "1l3gesw",
      "title": "Rx 9070 xt",
      "content": "I just got the rx 9070 xt it does power on the rest of the pc does but not the GPU im hoping  it’s a psu problem \n\nSpecs \nCPU ryzen 7 7800x3d\nMobo Rog Strix B650A gaming WiFi \n32 gb ram \nMy psu is from a prebuilt its 800w \n Like I said I’m hoping it’s a psu problem but I’m looking for all advice too \n",
      "author": "Loose-Passage-806",
      "created_utc": 1749069475,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 4,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3gesw/rx_9070_xt/"
    },
    {
      "id": "1l3geqe",
      "title": "I have no experience building PCs. Is this a good budget build, or is there some glaring error?",
      "content": "This PC will have two purposes; gaming (I am perfectly content running things medium/high or lower if I need to) and CAD/CAM/Revit.\n\nThe CAD stuff is the main reason for the upgrade, i've been playing on a 10 year old PC with a base 1080 for a decade now and have made it work.\n\n3D modelling, planning... no animations or intense simulations/renders (to my knowledge). Just potentially complex 3d models. That's mostly why I went for 64gb RAM over 32gb. Will the CPU be a problem there? Is there a better build still within this range?\n\n**Build (pcpartpicker** [**link**](https://pcpartpicker.com/list/6QD6FZ)**):**\n\n**-Intel i5-14600KF 3.5 GHz 14 core ($199)**\n\n**-Thermalright Peerless Assassin 120 SE CFM CPU Cooler ($34)**\n\n**-Gigabyte Z7920 AORUS ELITE AX ATX LGA1700 mobo ($184)**\n\n**-G.Skill Trident z5 DDR5-6000 CL30 memory (2x32gb) ($200)**\n\n**-Western Digital SN850X M.2-2280 PCle 4.0 x4 NVME 2tb SSD $(153)**\n\n**-NVIDIA RTX 3060 ti 8gb ($599)**\n\n**-Monotech XR ATX Mid tower case ($72)**\n\n**-EVGA 750 GQ 750w 80+ gold cert, semi modular ATX PSU ($93)**\n\n**Cost is about $1540. I'd hope to stay around that if changes need to be made.**\n\nLink again in case you missed it at the top: [https://pcpartpicker.com/list/6QD6FZ](https://pcpartpicker.com/list/6QD6FZ)\n\nI will be transferring my files and everything over  from my old PC so I won't need to buy a new Windows license.",
      "author": "skelepibs",
      "created_utc": 1749069470,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 3,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3geqe/i_have_no_experience_building_pcs_is_this_a_good/"
    },
    {
      "id": "1l3gd2a",
      "title": "Upgrading to dual GPU (RTX 3070 + RX 9070 XT)",
      "content": "I have bought RX 9070 XT and decided I want to keep RTX 3070 for older games with PhysX (so RTX goes to lower PCI-E x16 slot, and RX goes into first x16 slot) \n\nIs there anything I should be weary of? I think I may have insufficient number of PCI-e lanes, so I don't know if I can run RTX 3070 as x8?\n\nSome HW specs:\n\nMoBo: ASUS ROG STRIX X570-E GAMING\n\nCPU: Ryzen 5800X3D\n\nRAM: 32 GB (4 x G.Skill F4-4000C18-8GVK)\n\nSSD NVMe Force MP600 (PCIe 4x)\n\nSSD NVMe Lexar SSD NM800PRO (PCIe x4)\n\n",
      "author": "YAUUA",
      "created_utc": 1749069357,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 4,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3gd2a/upgrading_to_dual_gpu_rtx_3070_rx_9070_xt/"
    },
    {
      "id": "1l3gcsj",
      "title": "is inno3d reliable? Lookint to buy 5080 inno3d x3 oc",
      "content": "i was looking to buy zotac solid core 5080 (1387 usd), but unfortunately its out of stock, so now the only card i could find for similar price is 5080 inno3d x3 oc (1411 usd). ",
      "author": "Spiritual_Try9694",
      "created_utc": 1749069339,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3gcsj/is_inno3d_reliable_lookint_to_buy_5080_inno3d_x3/"
    },
    {
      "id": "1l3g9bs",
      "title": "White boxy cpu cooler for 7 9800x3d region: usa",
      "content": "I want to build all white gaming pc with 7 9800x3d and aorus master 5080 ice , i want a white boxy cpu cooler\nI think it will look so good with boxy air cooler",
      "author": "efeyit",
      "created_utc": 1749069109,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 5,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3g9bs/white_boxy_cpu_cooler_for_7_9800x3d_region_usa/"
    },
    {
      "id": "1l3agw9",
      "title": "Desperate for SATA help!",
      "content": "I have an Asus Prime H670 Plus D4 motherboard, and currently have an SSD connected to SATA4. I have two NVme in, and for the LIFE of me I cannot get any other SATA port to recognize a drive. If I switch cables, nothing, switch ports, nothing. The drive works in the currently occupied SATA port, so it's not the drive. \n\nI am so far out of my expertise here.\n\nI tried a PCIe to SATA adapter, but that doesn't work either. Nothing shows up in drive or device management!\n\nHelp please!!!",
      "author": "DrGhostDoctorPhD",
      "created_utc": 1749055522,
      "upvotes": 2,
      "upvote_ratio": 0.75,
      "num_comments": 4,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3agw9/desperate_for_sata_help/"
    },
    {
      "id": "1l3g35k",
      "title": "Airflow Options",
      "content": "Hey everyone. Basically I have an Ikea Micke desk with the area you can with your PC in. Obviously when playing games my PC gets very hot because of no air flow. What are my options? Making holes in my desk is an absolute last resort!",
      "author": "ComicC0",
      "created_utc": 1749068702,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 2,
      "flair": "Discussion",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3g35k/airflow_options/"
    },
    {
      "id": "1l3g2ch",
      "title": "650W for a 5950X + 5070 Ti? Am I going to fry my rig?",
      "content": "||\n||\n|AMD Ryzen 9 5950X 3.4 GHz 16-Core Processor|13W - 105W|\n|Thermalright Phantom Spirit EVO 69 CFM CPU Cooler|5W - 10W|\n|Asus PRIME B550-PLUS ATX AM4 Motherboard|17W - 70W|\n|G.Skill Aegis 32 GB (2 x 16 GB) DDR4-3200 CL16 Memory|29W|\n|G.Skill Aegis 32 GB (2 x 16 GB) DDR4-3200 CL16 Memory|29W|\n|Crucial T500 2 TB M.2-2280 PCIe 4.0 X4 NVME Solid State Drive|2W - 10W|\n|Zotac SOLID SFF GeForce RTX 5070 Ti 16 GB Video Card|75W - 300W|\n|Total:|553W|\n\nSo this is what PC part picker spitted out and I'm feeling a bit hesitant with my Corsair RM650e PSU.   \n  \nSo for context, I'm very inclined on staying on my AM4 mobo but want to upgrade the cpu, gpu and add some extra RAM. Currently I have a 5800x and 4070 with 32gb RAM and all of these are hitting the limit. Loading datasets crosses the 30gb threshold and i think that the extra cores on the CPU and a better bigger GPU would really help with the compute, compile and inference stuffs that I do.  These are the only stuffs i want to upgrade and would cost me reasonably around 600 euros (considering I factor in selling my CPU and GPU). \n\nBut this will leave only about 100W headroom for anything else. Not to mention i also have my soundbar's usb and my table lamp connected to my PC in my current set up. Am i pushing it to far? Does anyone have some experiences with stretching the PSU's comfort zone?",
      "author": "Proper-External3196",
      "created_utc": 1749068648,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3g2ch/650w_for_a_5950x_5070_ti_am_i_going_to_fry_my_rig/"
    },
    {
      "id": "1l3fwbn",
      "title": "Need advice/opinion on first build.",
      "content": "Ok so this is my dream build. \n\nI've been wanting to build a pc for gaming since 2015 aprox and this is the time at last. I will be purchasing this parts and building it at the end of the month and wanted the opinion of experts.\n\nI still haven't completely decided between the 9070 xt (\\~740€) and 5070 ti (830€). I'll be playing in 1440p and i would be so happy to play cyberpunk path traced.\n\nOpinion on all the parts is welcome.\n\n\\[PCPartPicker Part List\\](https://es.pcpartpicker.com/list/n46YzP)\n\n\n\nType|Item|Price\n\n:----|:----|:----\n\n\\*\\*CPU\\*\\* | \\[AMD Ryzen 7 7700 3.6 GHz 8-Core Processor\\](https://es.pcpartpicker.com/product/dXmmP6/amd-ryzen-7-7700-36-ghz-8-core-processor-100-100000592box) | €170.00 \n\n\\*\\*CPU Cooler\\*\\* | \\[Thermalright Peerless Assassin 120 SE ARGB 66.17 CFM CPU Cooler\\](https://es.pcpartpicker.com/product/zyNxFT/thermalright-peerless-assassin-120-se-argb-6617-cfm-cpu-cooler-pa-120-se-argb) | €38.90 @ Amazon Espana \n\n\\*\\*Motherboard\\*\\* | \\[MSI B650M GAMING PLUS WIFI\\](https://es.pcpartpicker.com/product/QcvD4D/msi-b650m-gaming-plus-wifi-micro-atx-am5-motherboard-b650m-gaming-plus-wifi) | €159.90 @ Amazon Espana \n\n\\*\\*Memory\\*\\* | \\[Patriot Viper Venom 32 GB (2 x 16 GB) DDR5-6000 CL30 \\](https://es.pcpartpicker.com/product/4cCCmG/patriot-viper-venom-32-gb-2-x-16-gb-ddr5-6000-cl30-memory-pvv532g600c30k) | Purchased For €92.99 \n\n\\*\\*Storage\\*\\* | \\[Western Digital Black SN770 2 TB M.2-2280 PCIe 4.0 X4 \\](https://es.pcpartpicker.com/product/4KRYcf/western-digital-2-tb-m2-2280-nvme-solid-state-drive-wds200t3x0e) | Purchased For €99.99 \n\n\\*\\*Video Card\\*\\* | \\[Gainward Phoenix GS GeForce RTX 5070 Ti\\](https://es.pcpartpicker.com/product/YcYfrH/gainward-phoenix-gs-geforce-rtx-5070-ti-16-gb-video-card-ne7507ts19t2-gb2031x) | €827.99 \n\n\\*\\*Case\\*\\* | \\[Asus Prime AP201 MicroATX\\](https://es.pcpartpicker.com/product/Zq3NnQ/asus-prime-ap201-microatx-mini-tower-case-prime-ap201-tg-bk) | €85.00 @ Amazon Espana \n\n\\*\\*Power Supply\\*\\* | \\[Gigabyte UD850GM 850 W 80+ Gold \\](https://es.pcpartpicker.com/product/VTgFf7/gigabyte-ud850gm-850-w-80-gold-certified-fully-modular-atx-power-supply-gp-ud850gm) | €96.00 \n\n | \\*Prices include shipping, taxes, rebates, and discounts\\* |\n\n | \\*\\*Total\\*\\* | \\*\\*€1570.77\\*\\*\n\n | Generated by \\[PCPartPicker\\](https://pcpartpicker.com) 2025-06-04 22:03 CEST+0200 |",
      "author": "quim024",
      "created_utc": 1749068250,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 5,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3fwbn/need_adviceopinion_on_first_build/"
    },
    {
      "id": "1l3fvmv",
      "title": "Which TPM module does the Zsus X99-W Mobo use???",
      "content": "There's a new cheapo TPM-compatible x99 board from Zsus and I need help figuring out which TPM module im supposed to buy for this particular board here. Thanks!\n(Aliexpress link to the board)\nhttps://a.aliexpress.com/_mMxrOuf",
      "author": "nonplussedbiter",
      "created_utc": 1749068205,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 0,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3fvmv/which_tpm_module_does_the_zsus_x99w_mobo_use/"
    },
    {
      "id": "1l3fuwy",
      "title": "Buying PC for Daughter and need more competent folks to give advice",
      "content": "Hi all,\n\nfirst off, apologies for potential wrong wording or similar language issues, as English is not my first language and I unfortunately can only use it sporadically nowadays. \n\nWith that out of the way: My daughter likes gaming and meanwhile is in dire need of her own PC, as she can't (and probably shouldn't) use her mothers gaming laptop for the foreseeable future. \n\nIdea is now, to now take some money and spend it well on a solid PC for her to mainly play games and potentially use for study-related stuff. Assumption is, that whatever study-related stuff comes along, the gaming PC most likely (I think that will be an understatement) should be capable of handling all the word processors of this world.\n\nI put together some components, where I would like to ask some knowledgeable folks to do a sanity check. Mainly, that I am not getting components which are sort of incompatible (I checked with PC Part Picker and assume it is sufficiently solid) and, that the components I chose make sense and provide a solid base for 5+ years of relaxed gaming. \n\nGaming related, she mostly plays Genshin Impact and slowly other mostly IMHO lower impact games. So nothing like Cyberpunk 2077 with raytracing. \n\nBut now the components:\n\n\\[PCPartPicker Part List\\](https://pcpartpicker.com/list/vFTXGJ)\n\n\n\nType|Item|Price\n\n:----|:----|:----\n\n\\*\\*CPU\\*\\* | \\[AMD Ryzen 7 9800X3D 4.7 GHz 8-Core Processor\\](https://pcpartpicker.com/product/fPyH99/amd-ryzen-7-9800x3d-47-ghz-8-core-processor-100-1000001084wof) | $472.02 @ Amazon \n\n\\*\\*CPU Cooler\\*\\* | \\[be quiet! Dark Rock 5 93.5 CFM CPU Cooler\\](https://pcpartpicker.com/product/FKwmP6/be-quiet-dark-rock-5-935-cfm-cpu-cooler-bk035) | $79.90 @ Amazon \n\n\\*\\*Motherboard\\*\\* | \\[Asus ROG STRIX B650E-F GAMING WIFI ATX AM5 Motherboard\\](https://pcpartpicker.com/product/s8nypg/asus-rog-strix-b650e-f-gaming-wifi-atx-am5-motherboard-rog-strix-b650e-f-gaming-wifi) | $239.00 @ Amazon \n\n\\*\\*Memory\\*\\* | \\[Kingston FURY Beast 64 GB (2 x 32 GB) DDR5-5600 CL36 Memory\\](https://pcpartpicker.com/product/jx6NnQ/kingston-fury-beast-64-gb-2-x-32-gb-ddr5-5600-cl36-memory-kf556c36bbek2-64) | $169.99 @ Newegg \n\n\\*\\*Storage\\*\\* | \\[Samsung 990 Pro 2 TB M.2-2280 PCIe 4.0 X4 NVME Solid State Drive\\](https://pcpartpicker.com/product/34ytt6/samsung-990-pro-2-tb-m2-2280-pcie-40-x4-nvme-solid-state-drive-mz-v9p2t0bw) | $169.99 @ Abt \n\n\\*\\*Video Card\\*\\* | \\[Asus PRIME Radeon RX 9070 XT 16 GB Video Card\\](https://pcpartpicker.com/product/c7pD4D/asus-prime-radeon-rx-9070-xt-16-gb-video-card-prime-rx9070xt-16g) | $599.99 @ Newegg  (OOS)\n\n\\*\\*Case\\*\\* | \\[be quiet! Pure Base 500 ATX Mid Tower Case\\](https://pcpartpicker.com/product/XCLwrH/be-quiet-pure-base-500-atx-mid-tower-case-bg034) | $123.43 @ Amazon \n\n\\*\\*Power Supply\\*\\* | \\[be quiet! Pure Power 12 750 W 80+ Gold Certified ATX Power Supply\\](https://pcpartpicker.com/product/Rr9wrH/be-quiet-pure-power-12-750-w-80-gold-certified-atx-power-supply-bp003us) | $101.89 @ Newegg \n\n\\*\\*Operating System\\*\\* | \\[Microsoft Windows 11 Home OEM - DVD 64-bit\\](https://pcpartpicker.com/product/dKkWGX/microsoft-windows-11-home-oem-dvd-64-bit-kw9-00633) | $119.99 @ Amazon \n\n | \\*Prices include shipping, taxes, rebates, and discounts\\* |\n\n | \\*\\*Total\\*\\* | \\*\\*$2076.20\\*\\*\n\n | Generated by \\[PCPartPicker\\](https://pcpartpicker.com) 2025-06-04 16:06 EDT-0400 |\n\n  \nAny advice, and be it \"no, it's fine, have fun\" is appreciated. :)",
      "author": "Ghaleb76",
      "created_utc": 1749068156,
      "upvotes": 1,
      "upvote_ratio": 0.6,
      "num_comments": 7,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3fuwy/buying_pc_for_daughter_and_need_more_competent/"
    },
    {
      "id": "1l3futj",
      "title": "Single tower air cooler for 7800x3d?",
      "content": "I noticed huge air coolers won't fit my build since the rams I got were pretty tall. I don't really want to go for an AiO since I've been hearing some people saying their AiOs die so suddenly plus I am new to building a PC. I need a single tower air cooler for my 7800x3d that will prevent the CPU from overheating or something. Any recommendations? ",
      "author": "jj_ville",
      "created_utc": 1749068149,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 3,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3futj/single_tower_air_cooler_for_7800x3d/"
    },
    {
      "id": "1l3a1dt",
      "title": "Small form quiet case for  basic build",
      "content": "My dad needs a new system, just for browsing, typing stuff up, and zooming with clients. He doesn't need anything flashy, preferably smaller size, and quiet.\n\nThe plan is to get quieter fans and a new cooler, and adjust the fan curve since he's never going to be pushing it.\n\nI was looking at the fractal ridge, but i  was wondering if there's a better case?\n\nThanks for any info",
      "author": "Morlock19",
      "created_utc": 1749054527,
      "upvotes": 2,
      "upvote_ratio": 0.75,
      "num_comments": 4,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3a1dt/small_form_quiet_case_for_basic_build/"
    },
    {
      "id": "1l3fmf3",
      "title": "Need help",
      "content": "Pc always worked fine. Until today. I turned it on and got a screen with put in a boot system or something. Black screen with white letters like there was no boot device detected. After this when i rebooted it wouldnt give signal to my monitor. A few boots. I tried switching monitors, then it started to work normal again. Only with some severe lag sometimes while playing cs2. But now i get a lag spike and the pc just shuts off completely, turns itself back on. But get message that it needed repair and to enter repair mode. When i click it it says it cant repair and i can enter advanced settings or shut off.\n\nWhen i turn it on now it does turn on. After a long load, abnormally long. \n\nAny1 had any idea what this can be?",
      "author": "Rippling_Debt",
      "created_utc": 1749067603,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 5,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3fmf3/need_help/"
    },
    {
      "id": "1l3fh8u",
      "title": "Heating Problem! What should I do about my CPU heating up?",
      "content": "First of all here is my current build:    \n  \nAMD Ryzen 7 3700X\t                                CPU\n\nAsus TUF GAMING X570-PLUS (WI-FI)\t        Motherboard\n\nG.Skill Ripjaws V 32 GB (2 x 16 GB)     \t        RAM\n\nSamsung 970 Evo Plus 1 TB\t                        SSD\n\nAsus TUF GAMING OC GeForce RTX 3060 Ti\tGPU\n\nPhanteks Eclipse P360A\t                                Case\n\nCorsair RM750x (2021) 750 W 80+ Gold\tPower Supply\n\n3 Pahnteks SK120 DRGB PWM Fans - 2 intake 1 outtake\n\nMy GPU is always at 40-60 ℃, and my CPU is usually at 65-75 ℃. Recently, my computer CPU Temp has been spiking, it goes up to 90℃ when I first start it up, and it only cools down if I put a fan in front of the 2 intake fans, and if left alone, it stays at 75-80℃. This all may sound normal, but my PC crashed once I booted up some applications. When I tried to run it again, I checked the temperature, and it went up to 99℃. Then, it crashed again.\n\nSo what could the problem be, and more importantly, what could the solution be? Should I replace my CPU fan or the thermal paste? Should I add another intake or outtake fan? I find it very weird because it happened almost suddenly, and the fact that a separate fan makes the temp go down makes me think the airflow has somehow worsened. \n\nPlease help as I am going to college in the fall and I need to figure this out soon!",
      "author": "Apprehensive_Yak_296",
      "created_utc": 1749067265,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 12,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3fh8u/heating_problem_what_should_i_do_about_my_cpu/"
    },
    {
      "id": "1l3fe15",
      "title": "Any tips for my list",
      "content": "building a 5080fe in this , [https://uk.pcpartpicker.com/list/Djjffd](https://uk.pcpartpicker.com/list/Djjffd)  \nany changes suggested, ways i could get the budget down more while still staying white\n\ni already have some fans, might get lian li inf tho",
      "author": "flowlikecoffejelly2",
      "created_utc": 1749067054,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 7,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3fe15/any_tips_for_my_list/"
    },
    {
      "id": "1l3fcrl",
      "title": "DRAM orange light on. Computer not posting.",
      "content": "Hey everyone, hoping for some help here as I’m going crazy.\n\nComputer is turning on but not posting. Worked perfectly fine last night. But went to turn on today and I get nothing. I’m getting an orange light on the motherboard next to DRAM. I have  removed both ram sticks, tried turning on with just 1 ram stick on either A2 or B2 slot and nothing. I just removed the CMOS battery for about 10 mins and tried turning on with just 1 ram on B2 and still nothing, also tried on A2. I get the same light and no post.\n\nBuild is around 1 year old.\n\nMB is Asus Tuff B650 & Tforce DDR5 ram sticks. ",
      "author": "Fd2devil",
      "created_utc": 1749066964,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 4,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3fcrl/dram_orange_light_on_computer_not_posting/"
    },
    {
      "id": "1l3fa3f",
      "title": "Gpu upgrade",
      "content": "Hello guys, im looking to upgrade from my 2060, im playing mostly cs2 and pubg, sometimes singleplayer games. What would be the best upgrade for me? R5 7600 for CPU. 240hz monitor, 1080p. I excluded 25% tax from prices.\n\n5060 8GB (274$)\nRX 6750 XT (280$)\nARC B580 (234$)\n9060XT (??$)",
      "author": "dnllllll",
      "created_utc": 1749066784,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 7,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3fa3f/gpu_upgrade/"
    },
    {
      "id": "1l3f9pi",
      "title": "Advice Needed: RAM Frequency and Capacity",
      "content": "Hello! My question today is in regards to what would be *most beneficial* for my setup as a **video / photo editor, and gamer.** I've gotten everything together, it's working well, temps are great, and now it's just a question of what's best. \n\nPC Specs: \n\n  CPU: AMD Ryzen 5 7600X\n\n  GPU: Zotac Trinity Nvidia RTX 3080 10GB\n\n  MoBo: MSI MAG B650 Tomahawk Wi-Fi\n\n  RAM: Corsair Vengeance DDR5 **\\[6200Mhz 32GB\\]** ***or*** **\\[4400Mhz 64GB\\]**\n\n4400Mhz seems to be where the stability ceiling is for these 4 sticks of DDR5. When running 2 sticks, they of course can reach 6200Mhz. \n\nI've noticed the extra RAM does make make *multi-tasking Adobe Premiere & Adobe Photoshop at the same time* easier for work's efficiency. It excess RAM also seems to reduce the final video rendering time. But I can't help but wonder if the higher speeds would be more beneficial than excess RAM that's only sometimes utilized, as well as what would be optimal for my gaming experience.\n\nI'm still within the return window for 2/4 sticks (32GB), so returning all four sticks for 2x32GB is not an option. Thank you in advance to anyone who helps out :)\n\n",
      "author": "ArbysnTheChef",
      "created_utc": 1749066756,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 2,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3f9pi/advice_needed_ram_frequency_and_capacity/"
    },
    {
      "id": "1l3f7mx",
      "title": "Pc won’t turn on helppp",
      "content": "I turned the pc on and at first it was working but I noticed the case fans weren't spinning so that's when I realized I didn't plug in the 3 pin cpu case fan cord so I plugged it into the 4 pin Chasis Fan slot and for a few minutes it was perfect but then the motherboard started blinking red and shut off and now it won't turn back on. Help plzzz what do I do",
      "author": "AimlessWanderer237",
      "created_utc": 1749066618,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 4,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3f7mx/pc_wont_turn_on_helppp/"
    },
    {
      "id": "1l3f284",
      "title": "Do gpus ever go for MRSP?",
      "content": "Hi, I am looking to build a pc soon. Haven't since like 2014 when my buddy just picked and ordered all of the parts.\n\nI'm in the uk and I keep checking the price of the Arc b580. Its at best £260 here and MRSP is supposed to be $250 (£184).\n\nNow I'm ready about how the 9060 xt will be way over MRSP.\n\nAre prices always like this? Will you never get a GPU at MRSP or is this just a really bad time due to inflation etc?",
      "author": "Jamesthebrave",
      "created_utc": 1749066264,
      "upvotes": 1,
      "upvote_ratio": 0.54,
      "num_comments": 21,
      "flair": "Discussion",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3f284/do_gpus_ever_go_for_mrsp/"
    },
    {
      "id": "1l3f07n",
      "title": "white mobo for 7800xt",
      "content": "Ive been looking to build a pc, im going to be using the 7800xt+7800x3d mainly for games like valorant and some triple A's. I was originally planning to use the Gigabyte B650E AORUS ELITE X AX ICE, but i saw recently that the b650 motherboards are getting discontinued so im looking at other alternatives and i came across the asrock x870 steel legend wifi and the gigabyte x870 aorus elite wifi7 ice. Im looking for a am5 white mobo to fit my build, are these alternatives good? and is there any other good alternatives that may be a bit cheaper?",
      "author": "One-Confidence3052",
      "created_utc": 1749066127,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 3,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3f07n/white_mobo_for_7800xt/"
    },
    {
      "id": "1l3ex46",
      "title": "Help I want to build pc!",
      "content": "Hi!! I’m new to this community and I’m in need of help.\n\nI love playing video games but rn I only have a laptop to game on, I have some money saved up and I would love to build a pc but idk where to start… \n\n",
      "author": "picklemia77",
      "created_utc": 1749065921,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 7,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3ex46/help_i_want_to_build_pc/"
    },
    {
      "id": "1l3ewg1",
      "title": "Is this a good parts list for a PC?",
      "content": "This is my first time building a PC, would this be a good build? (Will upgrade the gpu later and I don't do many intensive games anyway). Any tips or suggestions would be appreciated!\n\nCPU, motherboard, ram - 550+10$ (ram upgrade to corsair)\n\nWindows 11 - 10$ \n\nHeatsink+Fan - 12$ - Amd Wraith Stealth Socket Am4 4-Pin Connector Cpu Cooler With Aluminum Heatsink & 3.93-Inch Fan\n\nPSU - 55$ - Thermaltake - SMART 700W\nATX 80 Plus Power Supply \n\nAMD Radeon RX 580 - 110$ \n\n2TB SSD - 130$ - Crucial P310 2TB internal SSD \n\nPC case - 105$ - SAMA V60 PC Case (white)",
      "author": "ProMC253",
      "created_utc": 1749065875,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 9,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3ewg1/is_this_a_good_parts_list_for_a_pc/"
    },
    {
      "id": "1l3ew1f",
      "title": "Both Monitors Artifacting, what could be the issue?",
      "content": "Hello, as the title says both of my screens are suddenly artifacting. I have to assume it's something to do with my Graphics Card, but I'm not sure. The card is GeForce RTX 4060 Ti, brand new, and I'm using the Game Ready Drivers which are completely up-to-date. This happened while I was playing a game and it went almost completely white when it was fine beforehand. Opening anything starts the artifacting while just looking at the desktop seems to be fine. \n\nSo far I have: updated the card's drivers manually, searched for updates on windows, restarted my pc several times. \n\nI was told to bring the card to the shop I got it from for check-up or swap, but I really don't want to do that since their prices for even the check-up are pretty steep. I'd appreciate any help!\n\nThis is my setup: [https://pcpartpicker.com/list/hf6T9C](https://pcpartpicker.com/list/hf6T9C)\n\nThank you in advance!",
      "author": "ChemicalCat4628",
      "created_utc": 1749065848,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 0,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3ew1f/both_monitors_artifacting_what_could_be_the_issue/"
    },
    {
      "id": "1l3eoy3",
      "title": "Online used market for gpus?",
      "content": "Looking for tips to spot scammy oinline listings. ",
      "author": "Grippenripp",
      "created_utc": 1749065379,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 3,
      "flair": "Discussion",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3eoy3/online_used_market_for_gpus/"
    },
    {
      "id": "1l3eojb",
      "title": "Pc always boots in safe mode  but won’t save my bios settings?",
      "content": "Have to press f1 and then exit my bios every time I boot. Is getting annoying. \n\nMotherboard is asus tuf gaming z370-plus.\nAnyone experienced this or know what to look for? ",
      "author": "uurub",
      "created_utc": 1749065351,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 2,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3eojb/pc_always_boots_in_safe_mode_but_wont_save_my/"
    },
    {
      "id": "1l3eoax",
      "title": "[HELP] RX 9070 XT drops from 230 to 120 FPS with FSR4 on minimum settings – is the GPU to blame?",
      "content": "Hey folks,\n\nI’m baffled why my powerful GPU can’t maintain a steady 200+ FPS in Marvel Rivals, even on the lowest settings with FSR Performance (FSR4).  \n\n\n**I see:**\n\n* Chill moments / calm scenes: 200–230 FPS\n* During fights / heavy action: consistent dips to 110–120 FPS\n\n\n\n**Here are the specs:**  \n\n\n* OS: Windows 10\n* CPU: AMD Ryzen 7 5700X\n* GPU: SAPPHIRE AMD Radeon RX 9070 XT Gaming Nitro+ OC 16GB\n* RAM: 32GB (2×16GB) DDR4 @ 3800MHz (XMP enabled)\n* Motherboard: MSI B450 Tomahawk (BIOS up to date)\n* PSU: be quiet! Pure Power 12 1000W 80 Plus Gold\n* Screen resolution: 2560×1440 \n\n\n\n**What I’ve already tried:**\n\n1. Undervolted GPU (scored \\~7700 in 3DMark Steel Nomad)\n2. Updated to the latest Radeon Software and removed possible drivers via DDU although the system was originally built on AMD\n3. Set in-game graphics to absolute minimum with FSR4 Performance\n4. Verified that Windows power plan is on “High Performance” and disabled unnecessary background apps\n\n\n\n**My main question**: Why can’t such a powerful card hold stable FPS with FSR4 on minimum settings? Or is the bottleneck somewhere else? Any advice on additional benchmarks, BIOS/Windows tweaks, or other hardware checks would be greatly appreciated.\n\nOr am I asking too much for this game?  \n\n\n**Thanks in advance!**",
      "author": "Aleksandrion",
      "created_utc": 1749065336,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 3,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3eoax/help_rx_9070_xt_drops_from_230_to_120_fps_with/"
    },
    {
      "id": "1l3elw5",
      "title": "First Custom PC Build – Is This a Good Upgrade from Ryzen 7 3700X + RX 5700 XT?",
      "content": "I’m finally building my first ever custom PC after using a prebuilt for the past few years, and I’d really appreciate it if you could look over my part list to make sure everything looks compatible and makes sense together.\n\n**Main goals:**\n\n* Smooth **1080p 60 FPS gaming**\n* A clear **upgrade from my current setup**:\n   * AMD Ryzen 7 3700X\n   * AMD Radeon RX 5700 XT\n\n**Here’s my current build list:**\n\n* **CPU:** AMD Ryzen 5 7600X\n* **CPU Cooler:** Thermalright Peerless Assassin 120 SE White ARGB\n* **Motherboard:** ASUS B650E MAX Gaming WiFi W (ATX, AM5)\n* **RAM:** TEAMGROUP T-Create Expert 32 GB (2x16GB) DDR5-6000 CL30\n* **Storage:** WD Black SN770 2TB M.2 NVMe Gen 4\n* **GPU:** Gigabyte Gaming OC Radeon RX 7600 XT 16GB\n* **Case:** NZXT H5 Flow (2024)\n* **PSU:** Corsair RM750e (2025, 750W, ATX 3.1, Fully Modular)\n\n**Estimated wattage:** \\~414W  \n**Budget:** Around $1150\n\nDoes everything here look compatible and well-balanced for my goals? I’m hoping it’ll be a nice step up from my current rig without going overkill or missing anything. Would love any feedback or suggestions!",
      "author": "AdObjective9067",
      "created_utc": 1749065177,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 4,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3elw5/first_custom_pc_build_is_this_a_good_upgrade_from/"
    },
    {
      "id": "1l3eko4",
      "title": "Need help for new pc",
      "content": "Hi all. Thinking of building a new pc and gifting my old one to my girlfriend’s little brother. It’s been a while since i put together a build so I am more than a little rusty, all comments and constructive criticism are welcome!\nHere is the build: https://ro.pcpartpicker.com/user/Iliadisu/saved/ .\nPrices may seem weird due to choosing parts available in my region!",
      "author": "Nagoromi",
      "created_utc": 1749065096,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3eko4/need_help_for_new_pc/"
    },
    {
      "id": "1l35i8d",
      "title": "upgrade cpu but keep gpu temporarily?",
      "content": "Hi, is it possible to upgrade my CPU but keep my GPU for a bit longer? I only got my GPU somewhat recently so I don't want to necessarily upgrade my GPU just yet. I only really want to play games at 1080p 60hz at mid or high settings as well as do some editing / recording. Is there a CPU that's compatible with my GTX 1650S but also with a 20 or maybe 30 series? If it's not possible that's fine too.\n\nCurrent build:\n\ni5 6600k\n\nGigabyte GA-Z170-HD3\n\nCorsair Vengeance LPX 2 x 8GB \n\nTUF GTX 1650 Super\n\nCorsair RM850X\n\n",
      "author": "Interesting-Yard8259",
      "created_utc": 1749043520,
      "upvotes": 3,
      "upvote_ratio": 0.8,
      "num_comments": 26,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l35i8d/upgrade_cpu_but_keep_gpu_temporarily/"
    },
    {
      "id": "1l3ehwb",
      "title": "Possible problems related to using two differently branded RAMs",
      "content": "Hi guys, one of my RAMs broke so i decided to buy another 8GB from the same seller, but they didnt have the same brand anymore. I swapped a Crucial BALLISTIX 8GB DDR4 2666Mhz CL16 XMP 2.0 with a Corsair Vengeance LPX 8GB DDR4 2666Mhz CL16 XMP 2.0. I checked online the timings and they are almost similar, the Crucial one is a 16-18-18-38 and the Corsair one is a 16-18-18-35. I booted up my pc, saw that both of them were running at 2133Mhz, i decided to try and change that from the BIOS and make them both run at 2666Mhz. They worked for like 2h and then i think i got i BSOD while i was around the house, or the PC crashed in some way (checked the event logger, the id was 41), anyways i didnt have the opportunity to see what happened but i was concerned ofc. I ran the Memory Diagnostics tool, and it detected some kind of problem that, of course, wasnt analyzed in depth. The first thing i did was changing the DRAM speed in the BIOS back to auto, to see if the sticks will stabilize themselves. If there is some sort of timings issue, is there anything i can do to solve it? Im not using any type of XMP or OC for the sticks, i want to use them at their normal potential because my machine isnt that strong.",
      "author": "SpicyDotFire",
      "created_utc": 1749064917,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 10,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3ehwb/possible_problems_related_to_using_two/"
    },
    {
      "id": "1l33h8f",
      "title": "RTX 5070 and an 14700F for Video Editing, LLM/Diffusion finetuning",
      "content": "Hi All,\n\nI'm looking to upgrade my old desktop at long last. I'll occasionally use it for gaming (Hogwarts Legacy and Satisfactory, I don't care about things being maxxed out) but really it's video editing/compositing (Adobe After Effects primarily) and AI hobby-work (running and finetuning small LLMs/Diffusion models) I'll need it for. I'd like something reasonably future-proof for gaming/editing - the AI stuff is just for now.\n\nCurrent specs are:\n\ni5-4760K  \n16GB 1600Mhz DDR3  \nGTX 1070 8GB\n\nThinking about:\n\ni7-14700F  \n64GB 6000Mhz DDR5  \nRTX 5070 12GB  \nWD Black SN850X 1TB  \nASUS B760 Prime Mobo  \nGigabyte UD1000GM 1000W PSU\n\nThe budget's about £1300. But two breaks I'm considering are:\n\nGetting a 14700K instead (extra £70)\n\nGetting a different GPU. The RTX will be £540, I've seen a lot of places say that 4070Ti 16GB Supers give better performance, but on CEX they're about £650-800. At that point I might as well buy a Palit 5070Ti 16GB which is £750.\n\nQuestion I'd like to ask is whether the original spec I've got is fine or if it's worth boosting the GPU / CPU and if it'll be worth the extra cost? Also any other remarks/advice are welcome!\n\nEdit: beep beep beep!",
      "author": "PossiblyAnOwl",
      "created_utc": 1749037662,
      "upvotes": 4,
      "upvote_ratio": 0.75,
      "num_comments": 3,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l33h8f/rtx_5070_and_an_14700f_for_video_editing/"
    },
    {
      "id": "1l3e622",
      "title": "Does the existence of dual chamber cases mean I can go non-modular PSU?",
      "content": "I'm about to buy a dual chamber case and I haven't really seen how big the space is. But is the space usually big enough that we can now get away with using a non-modular PSU?",
      "author": "Omniferous",
      "created_utc": 1749064152,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 4,
      "flair": "Discussion",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3e622/does_the_existence_of_dual_chamber_cases_mean_i/"
    },
    {
      "id": "1l3e5no",
      "title": "Are gen5 nvme ssd any good now?",
      "content": "Last year the condition of gen5 nvme ssd were not that great, they got heated pretty easily and degraded in performance when operating at those temperature. Also the options were very limited.\n\nHas it gotten any better in the last few months? \n\nLooking for 4 TB or higher gen5 ssd to upgrade the sn850x 4tb as the OS drive. \n\nThe sn850x 4tb will be used as a work drive, which is currently on a 2tb 980 pro at the moment. ",
      "author": "revoconner",
      "created_utc": 1749064123,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 5,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3e5no/are_gen5_nvme_ssd_any_good_now/"
    },
    {
      "id": "1l3e1ys",
      "title": "5070ti only working if set to Gen2? Help",
      "content": "Just got a 5070 TI and after I updated the drivers it crashes every single time without fail at the windows login screen. I’ve tried reinstalling the driver with DDU first, but it did not help. I did find that if I set the PCIE slot to Gen2 it works just fine. But it’s obviously not the speed I need it to be as my board is gen 3.\n\nMy board is an Asus zenith extreme with a 2950x thread ripper. I’ve tried enabling spreadspectrum which other people have said help but it didn’t do anything. Does anybody have any ideas how I may get this to work it’s very frustrating and I may just have to return the card ",
      "author": "PersonSuitTV",
      "created_utc": 1749063873,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 2,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3e1ys/5070ti_only_working_if_set_to_gen2_help/"
    },
    {
      "id": "1l3ds2z",
      "title": "Advice for shipping a mini itx pc between states",
      "content": "Hey! I’m going back home from college this summer, and I’d like to bring my pc with me. It’s a mini itx motherboard inside the nr200 case from cooler master. But I’m a bit nervous about shipping the whole computer and it getting damaged. Since it’s such a small motherboard what if I just took it out with the cpu and ram attached and just put it in my backpack on the plane with the gpu? That way I could just ship the more durable parts like my drives, power supply, and the case itself. Thoughts? Also is there any way to disassemble the nr200 and try and fit it into a carryon that way? I’m open ideas, what’s worked for you?",
      "author": "Practical_Employ4041",
      "created_utc": 1749063240,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 0,
      "flair": "Discussion",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3ds2z/advice_for_shipping_a_mini_itx_pc_between_states/"
    },
    {
      "id": "1l3dpnl",
      "title": "1.2k+ [My 3070] 4 CS2",
      "content": "###Build Help/Ready:\n\n**Have you read the sidebar and [rules](http://www.reddit.com/r/buildapc/wiki/rules)? (Please do)**\n\nYes.\n\n**What is your intended use for this build? The more details the better.**\n\nLooking for any potential upgrades or things people may do differently. Just got a raise at work and can reconfigure things a bit \n\nCounter Strike 2. Video editing capability being an afterthought, minor priority. CS2 is really my main priority, I do play other modern titles and obviously would like some future proofing but I feel like that will all be taken care of by building something capable of running CS2 well above 200 fps on 1440p (1920x1440). My current PC is nearly 4 years old but I could have done better. This time around I want to spend a little more and truly enjoy the benefit.\n\n**If gaming, what kind of performance are you looking for? (Screen resolution, framerate, game settings)**\n\nCS2 well above 200 fps on 1440p (1920x1440)\n\n**What is your budget (ballpark is okay)?**\n\nIn an attempt to make a long story short my pc has perished just before I have had time to get the funds for my new build squared away. Regardless I need to move on from the pre-built that has died. \n\nSince my time line has moved up I am going to be reusing my 3070 and starting my new build with it until I can get myself a proper gpu. \n\nThe build I had priced out was around $2300 with either a 4080 or 5070 ti of some sort. I am hoping to keep things around $1100 without the gpu. Closer to $1000 would be nice. Although I am hoping to make it painless and just swap the gpu when the time comes so have it more or less ready to go. Trying to thread the needle with some decent parts while still trying to be on a budget. Thanks for reading \n\n**In what country are you purchasing your parts?**\n\nUSA\n\n**Post a draft of your potential build here (specific parts please). [Consider formatting your parts list.](http://www.reddit.com/r/buildapc/wiki/pcpp) Don't ask to be spoonfed a build (read the rules!)**.\n\n[PCPartPicker Part List](https://pcpartpicker.com/list/FpWkPJ)\n\nType|Item|Price\n:----|:----|:----\n**CPU** | [AMD Ryzen 7 9800X3D 4.7 GHz 8-Core Processor](https://pcpartpicker.com/product/fPyH99/amd-ryzen-7-9800x3d-47-ghz-8-core-processor-100-1000001084wof) | $472.02 @ Amazon \n**CPU Cooler** | [Thermalright Peerless Assassin 120 SE WHITE ARGB 66.17 CFM CPU Cooler](https://pcpartpicker.com/product/xMLFf7/thermalright-peerless-assassin-120-se-white-argb-6617-cfm-cpu-cooler-pa120-se-white-argb) | $50.90 @ Amazon \n**Motherboard** | [Asus TUF GAMING B850-PLUS WIFI ATX AM5 Motherboard](https://pcpartpicker.com/product/sRG2FT/asus-tuf-gaming-b850-plus-wifi-atx-am5-motherboard-tuf-gaming-b850-plus-wifi) | $229.99 @ Amazon \n**Memory** | [TEAMGROUP T-Force Delta RGB 32 GB (2 x 16 GB) DDR5-6000 CL30 Memory](https://pcpartpicker.com/product/WFVmP6/teamgroup-t-force-delta-rgb-32-gb-2-x-16-gb-ddr5-6000-cl30-memory-ff4d532g6000hc30dc01) | $101.99 @ Amazon \n**Storage** | [Acer Predator GM7000 2 TB M.2-2280 PCIe 4.0 X4 NVME Solid State Drive](https://pcpartpicker.com/product/Mjstt6/acer-predator-gm7000-2-tb-m2-2280-nvme-solid-state-drive-bl9bwwr106) | $140.99 @ Amazon \n**Video Card** | [Gigabyte GAMING OC GeForce RTX 4070 Ti SUPER 16 GB Video Card](https://pcpartpicker.com/product/FR6NnQ/gigabyte-gaming-oc-geforce-rtx-4070-ti-super-16-gb-video-card-gv-n407tsgaming-oc-16gd) | $1299.99 @ Amazon \n**Case** | [Lian Li LANCOOL 216 RGB ATX Mid Tower Case](https://pcpartpicker.com/product/QcddnQ/lian-li-lancool-216-rgb-atx-mid-tower-case-lancool-216rw) | $111.97 @ Newegg \n**Power Supply** | [SeaSonic Focus GX V4 ATX 3 (2024) 850 W 80+ Gold Certified Fully Modular ATX Power Supply](https://pcpartpicker.com/product/ZNXV3C/seasonic-focus-gx-atx-30-v4-2024-850-w-80-gold-certified-fully-modular-atx-power-supply-focus-gx-850-v4-white) | $157.99 @ Newegg  (OOS)\n | *Prices include shipping, taxes, rebates, and discounts* |\n | **Total** | **$2565.84**\n | Generated by [PCPartPicker](https://pcpartpicker.com) 2025-06-04 14:45 EDT-0400 |\n\n**Provide any additional details you wish below.**\n\nGPU stuff is more so for my future build but would love further knowledge specifically on my selected cooler, PSU and ssd. I am sure I can save some money on the ram but as long as the speeds and what not are good I really enjoy the aesthetic. \n\nFeel like 5070 TI is my sweet spot on gpu, priorities being competitive CS2, Wow, Video Editing and also spatial analysis software like ARCGIS, Agisoft, etc. Wouldn't be opposed to going to (edit: 4080Super) or 5080 if the price could work. \n\nI would love some additional feedback on the specific GPU, PSU and AIO. Of course any input is more than appreciated but those are the components I feel I have less understanding of/more variables that I may not be considering. I think that pretty much covers it. I like a white/silver theme more than full RGB.\n\nShould I consider a Montec case or is Lian Li solid? I have checked reviews and feel decent about my selections. \n\nThank you thank you!",
      "author": "2hunna-",
      "created_utc": 1749063083,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 0,
      "flair": "Build Ready",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3dpnl/12k_my_3070_4_cs2/"
    },
    {
      "id": "1l3dnvn",
      "title": "Are my build setup components compatible and any suggestions for SSD storage and RAM choice?",
      "content": "Hello,\n\nI am wanting to build a new PC but would like to get a second opinion on the parts. I've only ever bought prebuilds, the last one being in 2013 so it's been a while. \n\nHere is what I'm looking at so far:\n\nCase: Aqua 7 Case from Amazon [https://www.amazon.com/Okinos-Pre-Installed-Computer-Panoramic-Tempered/dp/B0CSZ2PH85?th=1](https://www.amazon.com/Okinos-Pre-Installed-Computer-Panoramic-Tempered/dp/B0CSZ2PH85?th=1)\n\nCPU: AMD Ryzen 7 9800X3D\n\nMotherboard: ASUS Prime X870-P WiFi OR ASRock Phantom Gaming X870 Riptide WiFi 7\n\nGPU: EVGA RTX 2080 (I know it's an old card but I had one lying around so want to use it for now and eventually upgrade if GPU prices start to come down)\n\nPSU: EVGA 650 watt\n\nRAM: This I'm having trouble with choosing. Is there a specific speed I should be aiming for? For memory storage I am wanting to get possibly 64gb with 2 32gb sticks. \n\nSSD: Also having trouble choosing. I would like to have just one hard drive, 2-4tb SSD with the fastest speeds if possible but don't know what options are good or recommended, especially for these motherboard options. I just want to make sure I'm getting the fastest speed that the mobo ports will accept and be compatible with. \n\nCPU cooler: Also would like some suggestions that would go well with this Mobo/CPU/Case. \n\nWill mainly be using this PC Build for gaming and a little bit of video editing/music production. Using a 1440p monitor and gaming mainly in 1080/1440p. I don't upgrade very often, so I want to make sure I'm getting parts that will be good for a while before I have to upgrade again (besides the GPU which I plan to upgrade sooner). That is why I am thinking of picking an x870 mobo and 9800x3d CPU (please tell me if you don't agree)\n\nThe only items I have currently are the GPU and PSU that I am recycling, everything else I will be ordering. If you could let me know what you think or have any suggestions I would love to hear them. Thank you\n\n",
      "author": "ben3350",
      "created_utc": 1749062968,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3dnvn/are_my_build_setup_components_compatible_and_any/"
    },
    {
      "id": "1l3dlib",
      "title": "What's the best budget am5 CPU under $140. Was thinking that the 8400F would be good.",
      "content": "Need help with choosing this.",
      "author": "Confident-Gur-2615",
      "created_utc": 1749062806,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 5,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3dlib/whats_the_best_budget_am5_cpu_under_140_was/"
    },
    {
      "id": "1l3di9d",
      "title": "Where to get help deciding what I need?",
      "content": "I don't know a ton about computers. My dad built original home computers in the 80s/90s but hasn't built one in a while and his knowledge is somewhat out of date. \n\nI'm a woodworker so I would like something that can handle the designing. I have used SketchUp but would like to use fusion360. I also got a 3d printer a friend was giving away and would like to be able to use that. Also some gaming. \n\nI was looking at Costco's computers and my dad told me if I liked one I should just get a list of the parts and build it myself. I don't know how comfortable I am doing that. He recommended PCPartPicker and just inputting the specs of a computer I like. But idk what specs I need. \n\nI've been looking at gaming desktops, my understanding is that they are also good for the cad work for the most part. \n\nAny suggestions? ",
      "author": "Lgs_8",
      "created_utc": 1749062598,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 2,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3di9d/where_to_get_help_deciding_what_i_need/"
    },
    {
      "id": "1l3di95",
      "title": "Asus ProArt PA278CV vs Dell Pro Plus P2725D for work/productivity",
      "content": "Hi!\n\nI'm considering the monitors mentioned in the title for a dual setup for work/productivity. I work a lot in spreadsheets, text documents and browser. Sometimes I need to share my screen in Teams. I also do some web design and graphic design, but that's not something I really need to consider in this case.  \nMy employer is paying for the monitors, and my budget is about $400 per monitor.\n\nWould you recommend any of these two?  \n\\- ProArt PA278CV is $347 (older model PA278QV is at sale for $278, would that be as good?)  \n\\- Pro Plus P2725D is $396 (the Pro Plus P2725DE is $465, is it worth the premium for my use case?)\n\nOf course I can consider other monitors, but you should know that I live in Norway which means limited selection in monitors and high VAT rates...\n\nAlso, I'm leaning towards a dual 27\" monitor setup, but I'm also thinking about either a single 34\" ultrawide or dual setup with budget 34\" og 40\" ultrawide and a 27\" at the side. What would you recommend?\n\nThank you!",
      "author": "larsehf90",
      "created_utc": 1749062598,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3di95/asus_proart_pa278cv_vs_dell_pro_plus_p2725d_for/"
    },
    {
      "id": "1l3dg7e",
      "title": "help with pc config",
      "content": "hi everyone, i was hoping someone could help me with my pc configuration on pcpartpicker as i am a complete noob and plan on building a gaming pc. i have made a build on pcpartpicker but i don't understand the compatibility Notes. if someone could tell me what i need to buy to fix the problems it would mean a lot. thank you\n\n[https://uk.pcpartpicker.com/list/6VB8wY](https://uk.pcpartpicker.com/list/6VB8wY)",
      "author": "bhursty3",
      "created_utc": 1749062464,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 4,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3dg7e/help_with_pc_config/"
    },
    {
      "id": "1l3dfgc",
      "title": "Bought cyber power prebuilt as an interim pc, looking to upgrade it. Have money to spend and looking for suggestions.",
      "content": "Specs\nAmd Ryzen 5 5500*\n16gb DDR4*\nAmd Radeon RX 6500 XT\n1TB SSD pcie\n\nBoard and cooler not specified, but the board is AM4.\n\n600 W gold power supply\n\n\nNotes: I'll most likely will be swapping to am5 so the board and everything of the like will change \n\nMostly going to be doing a lot of intensive editing, high end gaming, and (POSSIBLY, I'm still getting more information on this so I don't know) ai training locally. \n\nI don't particularly have a budget, but looking to spend around 4k$ if I can get away with it. \n\nMost likely switching to nvidia \n\nWhile I understand some things I am still mostly ignorant to all of this, so I'd appreciate any help, and please be patient I'm a bit of an idiot Lol \n\nEdit: should elaborate: I'm probably most likely just keeping the case, more so just looking for ideas to put stuff into it: ",
      "author": "Fantastic_Arm_9669",
      "created_utc": 1749062416,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 4,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3dfgc/bought_cyber_power_prebuilt_as_an_interim_pc/"
    },
    {
      "id": "1l3dcfk",
      "title": "My first PC build - Any thoughts?",
      "content": "So after a bit of research, I've put together a list of components and just wanted to double check if maybe anything isn't compatible or outdated, since its my first time.\n\nHere's the List Just so you know, the prices are not accurate for my country, so im paying about 1600€ for the whole thing.) : \n\n[PCPartPicker Part List](https://pcpartpicker.com/list/thpyTM)\n\nType|Item|Price\n:----|:----|:----\n**CPU** | [AMD Ryzen 5 9600X 3.9 GHz 6-Core Processor](https://pcpartpicker.com/product/4r4Zxr/amd-ryzen-5-9600x-39-ghz-6-core-processor-100-100001405wof) | $207.95 @ Amazon \n**CPU Cooler** | [ID-COOLING FROZN A410 BLACK 78.25 CFM CPU Cooler](https://pcpartpicker.com/product/R6P8TW/id-cooling-frozn-a410-black-7825-cfm-cpu-cooler-frozn-a410-black) | $27.99 @ Amazon \n**Motherboard** | [ASRock X870 Pro RS ATX AM5 Motherboard](https://pcpartpicker.com/product/rk4Zxr/asrock-x870-pro-rs-atx-am5-motherboard-x870-pro-rs) | $209.99 @ Amazon \n**Memory** | [Corsair Vengeance 32 GB (2 x 16 GB) DDR5-6000 CL30 Memory](https://pcpartpicker.com/product/JkfxFT/corsair-vengeance-32-gb-2-x-16-gb-ddr5-6000-cl30-memory-cmk32gx5m2b6000c30) | $124.99 @ Amazon \n**Storage** | [Western Digital Black SN770 2 TB M.2-2280 PCIe 4.0 X4 NVME Solid State Drive](https://pcpartpicker.com/product/4KRYcf/western-digital-2-tb-m2-2280-nvme-solid-state-drive-wds200t3x0e) | $119.99 @ Newegg \n**Video Card** | [XFX Swift Radeon RX 9070 XT 16 GB Video Card](https://pcpartpicker.com/product/T7RnTW/xfx-swift-radeon-rx-9070-xt-16-gb-video-card-rx-97tswf3b9) | $962.79 @ Amazon \n**Case** | [Corsair 3500X ATX Mid Tower Case](https://pcpartpicker.com/product/jthv6h/corsair-3500x-atx-mid-tower-case-cc-9011276-ww) | $89.99 @ Newegg \n**Power Supply** | [MSI MAG A850GL PCIE5 850 W 80+ Gold Certified Fully Modular ATX Power Supply](https://pcpartpicker.com/product/zF4Zxr/msi-mag-a850gl-pcie5-850-w-80-gold-certified-fully-modular-atx-power-supply-mag-a850gl-pcie5) | $129.99 @ Amazon \n | *Prices include shipping, taxes, rebates, and discounts* |\n | **Total** | **$1873.68**\n | Generated by [PCPartPicker](https://pcpartpicker.com) 2025-06-04 14:39 EDT-0400 |",
      "author": "Open-Wall7970",
      "created_utc": 1749062215,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 3,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3dcfk/my_first_pc_build_any_thoughts/"
    },
    {
      "id": "1l3d81m",
      "title": "Compatibility Question",
      "content": "Im making my first build in a lian li o11 vision compact, with a asus rog strix x870-a motherboard with an nzxt kranken elite 2024, and msi gaming trio rtx 5080.\n\nI wanted to vertically mount the GPU so I got the lian li vertical 4 slot universal GPU holder, but I'm not that happy with the results, if put the GPU on bracket closest to the motherboard it just doesn't fit due to the AIO screen blocking it, If I put it on the furthest bracket than the motherboard the display ports get blocked by the case, and if do the middle than it just looks off and blocks most of the AIO.\n\nI was thinking about getting the Cooler Master Vertical Graphics Card Holder Kit V3 instead, but I'm worried about the same issues popping up, does anyone know if I should be concerned about most of the aio screen getting blocked the GPU with this holder, and so do you have any other recommendations?",
      "author": "Ok-Money306",
      "created_utc": 1749061936,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 0,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3d81m/compatibility_question/"
    },
    {
      "id": "1l3d5xk",
      "title": "Is this a good build?",
      "content": "Hello, I live in Italy and what I wanted to ask you is:\nIs this a good build, is the CPU and GPU a good combo or do I have to upgrade the CPU?\nSpecs:\n\nCpu:\nIntel core i5 12400F (€117)\nhttps://amzn.eu/d/1LV8JvQ\n\nGPU:\nSWFT210 RADEON RX 6650 XT CORE Gaming (€260)\nhttps://amzn.eu/d/cAqjKAF\n\nRAM:\nLexar THOR RAM DDR4 16GB Kit (8GB x 2) 3200 MHz, DRAM 288-Pin UDIMM PC Memory, XMP 2.0 High Performance for PC/Computer, CL16-18-18-38, 1.35V (LD4BU008G-R3200GDXG) (€35)\nhttps://amzn.eu/d/a8Jn78O\n\nSSD:\nLexar NM710 SSD 1TB, M.2 2280 PCIe Gen4x4 NVMe Internal SSD, Up to 5000MB/s Reading, 4500MB/s Write, Solid State Drive for PC, Laptop and Gamer (LNM710X001T-RNNNG) (€65)\nhttps://amzn.eu/d/3wDqHe1\n\nMotherboard:\nMSI PRO B760M-P DDR4 Micro-ATX Motherboard, Supports Intel 12/13th Gen, LGA 1700 - DDR4 Memory Boost 4800+MHz/OC, PCIe 4.0 x16 Slot, M.2 Gen4 Slots(€97)\nhttps://amzn.eu/d/cL60FSg\n\nPSU:\nMSI MAG A650BN Power Supply, EU Plug - 650W, 80 Plus Bronze Certified, ATX PSU, 12V Single-Rail, DC-to-DC Circuit, 120mm Fan - 5 Year Warranty (€62)\nhttps://amzn.eu/d/8kTG3vJ\n\nCase:\nNuwo Rodan R602 Black ATX Case for PC Gaming, Supports E-ATX, 0.50MM SPCC with 4 Argb LED Fans Addressable Mesh Front and Tempered Glass Side Panel (€63)\nhttps://amzn.eu/d/2fslTyH\n\nMonitor:\nKOORUI 24 Inch Gaming Monitor, 165Hz 1080p IPS 1ms, Adaptive Sync, HDMI Adjustable Tilt, Eye Care, Wall Mountable VESA (FHD 1920 x 1080, DisplayPort) Black (€110)\nhttps://amzn.eu/d/42fSjv5\n",
      "author": "Rare-Pride5448",
      "created_utc": 1749061802,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3d5xk/is_this_a_good_build/"
    },
    {
      "id": "1l3d3p1",
      "title": "What motherboard to get alongside a Ryzen 7 9700x",
      "content": "Hi,\n\n  \nI have been looking to upgrade my pc recently and am thinking of getting a 9700x. My options for a motherboard are probably either a x670e or x870, but I am not sure which one is better or worse. Budget for either is not an issue. \n\nMy main concern is that the x870 has the lane sharing thing for the nvme slots / pice slots, which makes me think the x670e seems to be a better choice because it has less of that. I have been looking at MSI Mag Tomahawk motherboards for both, but theres some questions I have:\n\n* If I have a PICe 4.0 NVME in a 5.0 m.2 slot that is sharing PICe 5.0 lanes with a usb c 4.0 or PICe slot, will it still share even though the version is older? \n* The wifi 6e -> 7 upgrade and usb c displayport don't seem a necessary upgrade for me, other than that the main difference seems to be the m.2 slots being PCIe 5.0 rather than 4.0 but I am unsure if that would really make a difference for me, the only big pieces of data I have are games, I don't really do much movement of big data. \n* The price difference is about £60, which does not seem worth it for me but maybe there is a difference I am missing between the x670e and x870. \n\nOverall just looking for recommendations between the two really, pretty set on the 9700x. The 9900x is quite a lot more and I dont think I would use it's capability that much.\n  \nThanks in advance",
      "author": "Shooter91234",
      "created_utc": 1749061648,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3d3p1/what_motherboard_to_get_alongside_a_ryzen_7_9700x/"
    },
    {
      "id": "1l3d2zr",
      "title": "Lane sharing... I just don't get it!",
      "content": "Hi all, building noob here.\nI read through so many articles, watched a lot of YT videos and for all things holy - I just can't wrap my head around the PCIe lane sharing 🥴 Please help!\n\nMobo: Gigabyte B650M Aorus Elite AX Ice\nCpu: Ryzen 7500F\nGPU: Radeon RX9070 AsRock Steel Legend\n\nSo the GPU has a PCIe 5.0 x16 interface.\n\nThe Mobo supports PCIe 4.0 x16 in the GPU slot.\n\nThe Mobo has 2 M.2 slots: \n\nthe upper one is PCIe 5.0 x4\n\nthe lower slot is PCIe 4.0 x4\n\nThe CPU supports 24 PCIe 5.0 lanes.\n\nI understand that when I pop in my GPU, it will \"only\" run on 16 PCIe 4.0 lanes, as the mobo is supporting only that. So far, so good.\n\nWhen I now install a NVME which has PCIe 5.0 x4 in the upper M.2 slot, it should use up 4 of the 24 CPU lanes... right? \nWould the GPU keep it's 16 PCIe 4.0 lanes?\n\nWould it be fine if I install my GPU and two M.2 drives in there? (one as 5.0 and the other one as 4.0)? \nBecause that would make a total of 24 lanes that the CPU could handle: 16+4+4?\n\nI would be eternally grateful if somebody could enlighten me here!\nThanks a lot in advance.",
      "author": "Rob_van_Wanst",
      "created_utc": 1749061601,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 3,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3d2zr/lane_sharing_i_just_dont_get_it/"
    },
    {
      "id": "1l3d2bs",
      "title": "Looking for advice on what to upgrade and what to upgrade TO",
      "content": "Hi all,\n\nLast updated my PC in 2022, currently running a 6750xt GPU and a 5600x CPU.\nI'm looking for bang for buck upgrades and am mulling over the likes of the 5700x3d.\n\n32gb RAM. Budget of around £800. UK based.\n\nWhat would you guys say are the natural upgrades to this setup?\n\nFor info, I play lots of grand strategy and paradox games, as well as single player rpgs modded and otherwise, hence the thinking behind the CPU upgrade.\n\nAny and all advice would be welcome!",
      "author": "Kingsley_CK",
      "created_utc": 1749061554,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 3,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3d2bs/looking_for_advice_on_what_to_upgrade_and_what_to/"
    },
    {
      "id": "1l3d0d5",
      "title": "is worth it jumping to AM5 or just upgrade my AM4 CPU and GPU? (productivity use)",
      "content": "Im due for an update/upgrade and was planning to jump into AM5 but saw the prices and Im debating for the past few days is it worth it... my main use is 3D modelling and rendering (a lot of it)... and once in a while I play games on it (COD, GTA..etc) but rarely\n\n\n\nMy current Specs:\n\n\n\n||\n||\n|CPU|AMD Ryzen 3700x|\n|Motherboard|Asus Crosshair Viii Hero WiFi|\n|GPU|EVGA 2080 Ti|\n|Memory|G.Skill Neo 3600Mhz 8GBx4 (32GB)|\n|PSU|Corsair AX860i (dying)|\n\n\n\nnow if I stick to AM4 Im planning to buy the following\n\n||\n||\n|CPU|AMD Ryzen 5900x|\n|GPU|Asus Prime 5070 Ti|\n|PSU|havent decided yet but needs to be replaced|\n\n\n\nbut if Im jumping to AM5 (will be going for a small case so that I can move with it when needed)\n\n||\n||\n|CPU|AMD Ryzen 9700x|\n|Motherboard|ASRoc B650i Lightning WiFi|\n|GPU|Asus Prime 5070 Ti (or any 5070 Ti that fits CH160)|\n|Memory|any brand 6000Mhz 32GBx2 (64GB)|\n|PSU|Corsair SF750 750Watts|\n|Case|Deepcool CH160 |\n\n\n\nPS: if I upgrade to a new platform as well, my current build will passed to my young kid as well… and another advantage I will take of the new platform is Im going for a really small build where I can easily move it whenever I’m moving between my two locations",
      "author": "LegendMask",
      "created_utc": 1749061427,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 4,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3d0d5/is_worth_it_jumping_to_am5_or_just_upgrade_my_am4/"
    },
    {
      "id": "1l3d0b0",
      "title": "HDR flickering issue",
      "content": "Hey,\n\nWindows 11\nRadeon XT7900\nHDMI to 4k LG TV\n50hz refresh rate\n\nWhen I turn HDR on, everything is fine until I go into Steam/Ubisoft Connect/We Mod when the screen goes black and flickers occasionally until I close the app.\n\nIt was a clean install on Windows and with up to date AMD drivers.\n\nAny help would be great!",
      "author": "thenightmancommeth88",
      "created_utc": 1749061423,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 2,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3d0b0/hdr_flickering_issue/"
    },
    {
      "id": "1l3cvkq",
      "title": "Fractal North vs Meshify 3 vs Torrent (beginner build)",
      "content": "Hello.\n\nI tried a similar post last week but got no answer so I'm trying my luck again.\n\nI'm a beginner building my first PC and I got most parts already, but I need a case. After asking around, I got recommended Fractal cases a lot, and especially those 3 models: North / Meshify 3 / Torrent.\n\nHere is my pcpartpicker list for reference; [https://pcpartpicker.com/user/cleaverbow/saved/4jZMwP](https://pcpartpicker.com/user/cleaverbow/saved/4jZMwP)\n\nI think I would go for a regular size (don't think I need XL) and Black color. Not sure about side panel, I think I like the light versions more. Don't really care about RGB, especially if it's more expensive.\n\nBut those 3 are relatively close in pricing, and I don't really know how to separate them. Could you help me?\n\nI'm not going for watercooling, just a basic air set up with a Noctua fan I got a few years ago.\n\nI like the looks of all three of them, I think I slightly prefer the Torrent's looks but it's really close overall and wouldn't mind getting any of them for aesethethic purposes.\n\nThanks!",
      "author": "cleaverbow",
      "created_utc": 1749061115,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 13,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3cvkq/fractal_north_vs_meshify_3_vs_torrent_beginner/"
    },
    {
      "id": "1l3cqcm",
      "title": "1fps stream on discord with 7900 xtx",
      "content": "I've recently got 7900xtx Sapphire Nitro, and while games work great whenever I stream to my friends, they complain that my stream has 1 fps. Internet connection is checked and its fine, so i think the gpu and or drivers are the problem. I am currently using the latest drivers in Adrenaline. Did anyone have this issue or know how to fix it?",
      "author": "Burekdzija2",
      "created_utc": 1749060782,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 4,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3cqcm/1fps_stream_on_discord_with_7900_xtx/"
    },
    {
      "id": "1l3cota",
      "title": "Help with build",
      "content": "Hey guys! I'm going to start upgrading my PC and I need help to know if its good and if I'm getting good FPS for a few games.\n\nI have my older brothers PC from 2020 and now I'm going to start working and invest in my PC. Since I also have some bills to pay I'm going to upgrade GPU first and then I will buy the other parts and once they're all gathered, I'll build it all (Probably will be ready by September)\n\n  \nCurrent Setup:  \nCPU: AMD Ryzen 5 3600 6-Core, 3600 Mhz AM4   \nGPU: AMD Radeon RX 570 4GB   \nRAM: 16GB RAM (G.Skill Aegis 8GB DDR4 3000MHZ CL16)   \nMotherboard: B450-A Pro Max (MS-7B86) 4.0 PCI-Express 3.0 (8.0 GT/s)   \nPSU: Hummer X High End 80+ Bronze Semi-Modular 600W   \nSSD/HDD: 230GB SSD + 1 TB HDD + 1 TB HDD\n\nFuture Setup:\n\nCPU: AMD Ryzen 7 7700X 8-Core (4.5GHz-5.4GHz) 40MB AM5   \nGPU: MSI NVIDIA GeForce RTX 5060 \"Blackwell\" Ventux 2X OC 8G GDDR7 DLSS4   \nRAM: RAM DIMM Kingston Fury Beast RGB 32GB (2x16GB) DDR5-6000MHz (AMD Expo/Intel XMP) CL30 (30-36-36) 1.40V 1Rx8   \nMotherboard: MSI MAG B650 TOMAHAWK WIFI   \nPSU: Corsair RM750x 750W 80 PLUS Gold Full Modular   \nSSD: Crucial BX500 240GB + HDD 1: WDC WD10EZEX-22MFCA0 (1TB) + HDD 2: WDC WD10EZEX-60WN4A0 (1TB)   \nCooler (If I get the 7 7700X): Air Cooler CPU Noctua NH-U12S Redux\n\n\n\nQuestions:  \n\\-Can that combo do good for me in story games like Spider-Mans, Batmans, Far Crys, RDR2, Mafias?   \n\\-What about CS2? Will it be good for it?  \n\\-Do I get the 7 7700X or 7 7700?",
      "author": "nsk_7",
      "created_utc": 1749060677,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 8,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3cota/help_with_build/"
    },
    {
      "id": "1l3cnkt",
      "title": "Guys a question",
      "content": "I have a deep cool 750w Gold plus atx 3.0 power supply. Can I mount my 5080 without problems? As a CPU I have a Ryzen 7 9800x3d \nPny epic rgb 5080 card",
      "author": "Rosolino97",
      "created_utc": 1749060597,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 12,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3cnkt/guys_a_question/"
    },
    {
      "id": "1l3cngp",
      "title": "my rtx 2060 is idling at 49C when i play carx drift i have the gpu at 80 precent speed and the gpu is 85 C warm when i play forza its alot cooler tho",
      "content": "what shall i do? i cant afford a new gpu atm and i started seeing some shadow glitches while driving in car x when i stand still everythin is fine.\n\nps while playing carx and ONLY carx the fans sometimes randomly rev up to max for like 3 seconds",
      "author": "HistoricalSea8835",
      "created_utc": 1749060587,
      "upvotes": 1,
      "upvote_ratio": 0.6,
      "num_comments": 8,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3cngp/my_rtx_2060_is_idling_at_49c_when_i_play_carx/"
    },
    {
      "id": "1l3cn5b",
      "title": "Why am I getting a black screen after installing my new RTX 5060ti?",
      "content": "Hi! I just purchased a new GPU and have installed it, but am running into issues. I can turn on my computer, put in my password to log in to my user account, but then after a second or so (sometimes instantly) the whole screen turns black, and my mouse and keyboard lights turn off. I've put my old graphics card back in (RTX 2060) and it works fine. I've used DDU uninstaller to uninstall my drivers for a new card, and there was no problem until I've installed the drivers for the 5060ti. Using the NVIDIA app, it wouldn't install. It was stuck in a never-ending \"Preparing to install\" stage that lasted a few hours. So, I installed the driver off of the NVIDIA website and am having this issue. Is it the driver? If so, I've tried reinstalling it but to no avail; the problem persists. I've included my PC specs below in case there might be some incompatibility that is present. Thank you for taking the time to help! I am a complete noob when it comes to PC stuff and between work and school don't have much time to figure this out on my own so any help is appreciated.\n\n  \nPC Specs:   \nG704 Gaming Desktop PC; AMD Ryzen 7 2700 Processor 3.2GHz; NVIDIA RTX 2060 6GB (OLD CARD); 16GB DDR4-2666 RAM; 500GB SSD; Microsoft Windows 10 Pro\n\nPSU: Cooler Master Masterwatte lite 600w\n\nNew card: NVIDIA GeForce RTX 5060 Ti Overclocked Dual Fan 16GB GDDR7 PCIe 5.0 Graphics Card",
      "author": "Low_Bonus_218",
      "created_utc": 1749060567,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 0,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3cn5b/why_am_i_getting_a_black_screen_after_installing/"
    },
    {
      "id": "1l3clso",
      "title": "The cpu led on the motherboard stay on after turning on my pc",
      "content": "I just changed the PC case, after leaving everything ready in the new case, I turn on the PC and it has no image, all the fans work as well as the RGB, but there is no image on the monitor and the CPU light of the EZ Debug on the motherboard remains on.\n \nI tried removing and re-inserting the CPU to make sure there were no bent pins (although when I changed the case plate I did not touch the CPU), disconnected and connected the RAM, the power cable for the CPU and the graphics card. But the problem persists.\n\nAny ideas what it could be ;(?",
      "author": "NinjaDePudahuel",
      "created_utc": 1749060479,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 2,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3clso/the_cpu_led_on_the_motherboard_stay_on_after/"
    },
    {
      "id": "1l36lb1",
      "title": "Unable to access BIOS/Boot Menu on DisplayPort on 5070 Ti",
      "content": "What the title says. Monitor doesn't get signal on DP all the way until the Windows Login Screen, can't get into BIOS/Boot Menu because of that.\n\nI am able to see the entire boot sequence if I use HDMI, from the ASRock Logo till Windows Login. It's not a faulty DP cable as I am having the same issue with a new one I got just for testing this.\n\nAdditionally, if I spam Del/F11 to get into BIOS/Boot Menu after starting my PC, I can confirm it does go into BIOS but there's just no signal to the monitor and there's 50/50 chance where if I unplug and re-plug the DP cable on the monitor, the monitor gets the signal and on the times I don't, I have to unfortunately hard reset/shutdown.\n\nI do not think this is a driver issue considering I wiped my Windows drive and repartitioned it to have a clean install and both the cables and monitor are not defective considering they worked without issues on my 6750 XT. I have tried setting my PCIe speed to Gen 4 manually instead of Auto as well. At this point I only have CSM left. I do not have another monitor with DP to fully rule out the monitor as well.\n\nSurprisingly, it did fix itself for a few boot runs where I was able to see the ASRock Logo as well as the options to see which key for which Menu, but it went back to the same no signal until Windows as soon as I tried to test it a bunch of times.\n\nI am using a ASRock X670E Pro RS, 7800X3D and a Gigabyte Gaming OC 5070 Ti, monitor is a BenQ EX2710S.",
      "author": "Roman64s",
      "created_utc": 1749046329,
      "upvotes": 2,
      "upvote_ratio": 1.0,
      "num_comments": 6,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l36lb1/unable_to_access_biosboot_menu_on_displayport_on/"
    },
    {
      "id": "1l36ihe",
      "title": "First PC Build ned help confirming specs especially fans as I amin hot sunny toom",
      "content": "What is the build of this like my main conern is the coling of the PC being in a hot sunlit room with huge windows.  \n  \n\\[PCPartPicker Part List\\](https://au.pcpartpicker.com/list/z793kf)\n\n\n\nType|Item|Price\n\n:----|:----|:----\n\n\\*\\*CPU\\*\\* | \\[Intel Core i7-14700K 3.4 GHz 20-Core Processor\\](https://au.pcpartpicker.com/product/BmWJ7P/intel-core-i7-14700k-34-ghz-20-core-processor-bx8071514700k) | $578.00 @ Amazon Australia \n\n\\*\\*CPU Cooler\\*\\* | \\[Thermalright Peerless Assassin 120 White 66.17 CFM CPU Cooler\\](https://au.pcpartpicker.com/product/476p99/thermalright-peerless-assassin-120-white-6617-cfm-cpu-cooler-pa120-white) | $82.68 @ Amazon Australia \n\n\\*\\*Motherboard\\*\\* | \\[Asus Z790-AYW WIFI W ATX LGA1700 Motherboard\\](https://au.pcpartpicker.com/product/g7LdnQ/asus-z790-ayw-wifi-w-atx-lga1700-motherboard-z790-ayw-wifi-w) | $329.00 @ Computer Alliance \n\n\\*\\*Memory\\*\\* | \\[TEAMGROUP T-Force Delta RGB 32 GB (2 x 16 GB) DDR5-6000 CL30 Memory\\](https://au.pcpartpicker.com/product/WFVmP6/teamgroup-t-force-delta-rgb-32-gb-2-x-16-gb-ddr5-6000-cl30-memory-ff4d532g6000hc30dc01) | $169.00 @ Scorptec \n\n\\*\\*Storage\\*\\* | \\[Kingston NV3 2 TB M.2-2280 PCIe 4.0 X4 NVME Solid State Drive\\](https://au.pcpartpicker.com/product/gdBzK8/kingston-nv3-2-tb-m2-2280-pcie-40-x4-nvme-solid-state-drive-snv3s2000g) | $179.00 @ Amazon Australia \n\n\\*\\*Video Card\\*\\* | \\[MSI GAMING X SLIM GeForce RTX 4080 SUPER 16 GB Video Card\\](https://au.pcpartpicker.com/product/KzRwrH/msi-gaming-x-slim-geforce-rtx-4080-super-16-gb-video-card-rtx-4080-super-16g-gaming-x-slim-white) | $1857.25 @ Storm Computers  (OOS)\n\n\\*\\*Case\\*\\* | \\[NZXT H9 Flow (2023) ATX Mid Tower Case\\](https://au.pcpartpicker.com/product/7ZBG3C/nzxt-h9-flow-atx-mid-tower-case-cm-h91fw-01) | $169.00 @ Centre Com \n\n\\*\\*Power Supply\\*\\* | \\[MSI MAG A850GL PCIE5 850 W 80+ Gold Certified Fully Modular ATX Power Supply\\](https://au.pcpartpicker.com/product/LPBzK8/msi-mag-a850gl-pcie5-850-w-80-gold-certified-fully-modular-atx-power-supply-mag-a850gl-pcie5-white) | $167.77 @ JW Computers \n\n\\*\\*Case Fan\\*\\* | \\[Thermalright TL-S12W 47.6 CFM 120 mm Fan\\](https://au.pcpartpicker.com/product/fw7scf/thermalright-tl-s12w-476-cfm-120-mm-fan-tl-s12w) | $15.00 @ PCCaseGear \n\n\\*\\*Case Fan\\*\\* | \\[Thermalright TL-S12W 47.6 CFM 120 mm Fan\\](https://au.pcpartpicker.com/product/fw7scf/thermalright-tl-s12w-476-cfm-120-mm-fan-tl-s12w) | $15.00 @ PCCaseGear \n\n\\*\\*Case Fan\\*\\* | \\[Thermalright TL-S12W 47.6 CFM 120 mm Fan\\](https://au.pcpartpicker.com/product/fw7scf/thermalright-tl-s12w-476-cfm-120-mm-fan-tl-s12w) | $15.00 @ PCCaseGear \n\n\\*\\*Case Fan\\*\\* | \\[Thermalright TL-S12W 47.6 CFM 120 mm Fan\\](https://au.pcpartpicker.com/product/fw7scf/thermalright-tl-s12w-476-cfm-120-mm-fan-tl-s12w) | $15.00 @ PCCaseGear \n\n | \\*Prices include shipping, taxes, rebates, and discounts\\* |\n\n | \\*\\*Total\\*\\* | \\*\\*$3591.70\\*\\*\n\n | Generated by \\[PCPartPicker\\](https://pcpartpicker.com) 2025-06-05 00:07 AEST+1000 |",
      "author": "Im-not-a-biscuit",
      "created_utc": 1749046129,
      "upvotes": 2,
      "upvote_ratio": 0.75,
      "num_comments": 28,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l36ihe/first_pc_build_ned_help_confirming_specs/"
    },
    {
      "id": "1l3c70j",
      "title": "Best mobo?  for 9950x3D with 4 dimms of memory",
      "content": "Hello I know a lot of people say AMD has had an efficiency problem with 4 dimms of ram lately and its better to get by with 2 x 48GB dimms but I can't.  Whats the best mother board for the 9950x3D in general and which one is best with 128GB of ram or more?\n\nThank you\n\nIf you need more info: I'll probably put it in a torrent case with a Noctua gen2. 8 TB WD SSD. 5700ti for now, windows 10\n\nThis computer is intended to be a workstation that can cosplay as a gaming pc.",
      "author": "ermahgerdreddits",
      "created_utc": 1749059526,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 6,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3c70j/best_mobo_for_9950x3d_with_4_dimms_of_memory/"
    },
    {
      "id": "1l3c3d4",
      "title": "Low GPU & CPU Usage in Games Despite High-End Hardware – Not FPS Capped, Just Underperforming",
      "content": "Hey everyone,\n\nI'm dealing with a really strange performance issue that's been bothering me for a long time — even across GPU upgrades and full Windows resets. Hoping someone here might recognize the pattern.\n\n# My current specs:\n\n* **GPU:** RTX 5080\n* **CPU:** Ryzen 7 5700X\n* **RAM:** 32 GB DDR4\n* **Display:** 1440p ultrawide\n* **Storage:** NVMe SSD\n* **OS:** Windows 11 (clean install)\n\n# The actual problem:\n\nIn games like [**BeamNG.drive**](http://BeamNG.drive), **Fortnite**, and others at similar load levels, I'm getting **much lower performance than expected**. The issue is *not* an FPS cap — I have frame limits disabled — but **CPU and GPU usage rarely go above \\~50%**. It's like the system just isn’t trying.\n\n* Games feel sluggish or inconsistent\n* Changing settings (low/medium/high/ultra) barely affects FPS\n* V-Sync, G-Sync, power saving, etc. are all disabled\n* Temps, clock speeds, and power draw are fine\n* **Benchmarks work great** – full utilization, expected scores\n\nThis exact issue existed before when I had a **GTX 1080 Ti**, so the upgrade to a 5080 changed nothing.\n\n# What I’ve tried:\n\n* Clean Windows install (no OEM tools)\n* Disabling **Core Isolation / Memory Integrity**\n* Turning off **Hardware-accelerated GPU Scheduling (HAGS)**\n* BIOS, chipset, and GPU drivers all updated (with DDU used)\n* Game Mode off, Xbox Game Bar off, overlays off\n* Power plan set to **Ultimate Performance**\n* Removed old drivers including VMware-related stuff\n\n# My theory:\n\n* Not thermal, not hardware failure\n* Benchmarks prove the hardware *can* work as expected\n* Could it be some kind of **Windows driver model**, **scheduler**, or **DirectX-level issue**?\n* Maybe virtualization-related remnants, though I tried removing everything",
      "author": "rsg400",
      "created_utc": 1749059291,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 21,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3c3d4/low_gpu_cpu_usage_in_games_despite_highend/"
    },
    {
      "id": "1l3c22u",
      "title": "Is this even possible?",
      "content": "My brother passed away and he gave me his pc. We both grew up gaming together and he built this pc himself. \n\nI love this pc!  But it is outdated, I was wondering if there was anyway I could upgrade it without losing like.. the sentiment of his hard work of building it? Does that make any sense? Im not even sure thats possible, other than just transferring everything over to a new built pc? \n\nNonetheless, I wanted to ask! \nHere is the info I gathered \nMotherboard: msi z270-a pro (ms-7a71)\nWifi: Realtek RTL8188EU Wireless LAN 802.11n USB 2.0 network adapter \nProcessor: Intel core i7-7700K CPU @ 4.20GHz \nRAM: 32GB\n\n\nThats all the info I found! Only 2 of the 7 or 8 usb ports work anymore, none of the headphone jacks work uhmm I think thats all?\n",
      "author": "InevitableWar3166",
      "created_utc": 1749059205,
      "upvotes": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3c22u/is_this_even_possible/"
    },
    {
      "id": "1l3c0n1",
      "title": "pc shows black screen after replacing cooler",
      "content": "i just got a new cpu cooler because of overheating issues, now it wont post, just stays on a black screen. also tried booting with the old cooler but still nothing. its an lcd monitor and i can see it showing a black screen, nothing, just stays like that. tried everything i found on the internet but still nothing.\nspecs: i5 3470, gtx 750, asus p8p67m motherboard, 500gb hdd and a cooler master i30.",
      "author": "SeaLavishness6757",
      "created_utc": 1749059112,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 2,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3c0n1/pc_shows_black_screen_after_replacing_cooler/"
    },
    {
      "id": "1l3694z",
      "title": "Bought Microcenter open box",
      "content": "I just bought an Rx 9070xt for $650 open box at micro center, this is my first time buying a card that's this expensive before and was wondering if it was a good price for what it and if I should be careful about anything regarding it being open box",
      "author": "Upbeat_Yoghurt_420",
      "created_utc": 1749045475,
      "upvotes": 2,
      "upvote_ratio": 0.75,
      "num_comments": 12,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3694z/bought_microcenter_open_box/"
    },
    {
      "id": "1l3btwj",
      "title": "Which Ultrawide Screen monitor is better",
      "content": "I'm currently looking at 3 separate monitors that are within my budget, and as far as I can tell they're all basically identical. Should I just go for the cheapest? \n\nAOC CU34G4 34\" WQHD 180Hz\nSamsung Odyssey G5 34\" Ultrawide QHD\nXiaomi G34WQi 34\" WQHD 180Hz\n\n\nThe games I play are normally single player story games, or Alternatively more strategy games, very few high twitch multi-player games.\n\n\nAny help or input would be much appreciated 👏 ",
      "author": "TheTinyWenis",
      "created_utc": 1749058668,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 3,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3btwj/which_ultrawide_screen_monitor_is_better/"
    },
    {
      "id": "1l3bsnx",
      "title": "Upgrading from 7600X on MSI B650 GAMING PLUS WIFI — Should I Go 9800X3D, 9700X, or 7800X3D for Competitive FPS?",
      "content": "Hey guys,\n\nI’m running a Ryzen 5 7600X on an MSI B650 GAMING PLUS WIFI with an ASUS TUF 4070 Super. Thinking about upgrading my CPU and looking at the 9800X3D, 9700X, or 7800X3D.\n\nI mainly play competitive FPS games like CS2 and I’ll be running the CPU at stock settings, no overclocking.\n\nSo, a couple questions:\n\nWill my B650 board be okay powering the 9800X3D, or should I get a motherboard with better VRMs?\nWhich CPU do you think is the best upgrade for FPS gaming without overclocking?\nThanks for the help! \n",
      "author": "Existing_Gazelle5869",
      "created_utc": 1749058586,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 5,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3bsnx/upgrading_from_7600x_on_msi_b650_gaming_plus_wifi/"
    },
    {
      "id": "1l3bsb7",
      "title": "Please critique my PC Part Picker List",
      "content": "I'm building a computer primarily for data/numerical analysis. This analysis often times requires me to do a lot of embarrassingly parallel computations which is why I have the 24-core i9 processor and why I've got 32GB of RAM. I'll also be doing a lot of 3D rendering and manipulation of data. It would be really cool if this setup could achieve VR too, so that I can explore how to interact with 3D+ data visually. However, that is not something I'll be doing right away so its fine if the setup can be upgraded to accomplish that later. On top of this though, I would like to play games on it. I'm not picky so as long as I can have a setup that can reliably do 1080p to 1440p at 60 Hz, I'll be content. Here's a link to the list: [https://ca.pcpartpicker.com/list/GBkxQd](https://ca.pcpartpicker.com/list/GBkxQd), and the table too.\n\n|Component|Selection|Price (CAD)|\n|:-|:-|:-|\n|CPU|[Intel Core i9-13900F 2 GHz 24-Core Processor](https://ca.pcpartpicker.com/product/rkGbt6/intel-core-i9-13900f-2-ghz-24-core-processor-bx8071513900f)|[$484.96](https://www.shoprbc.com/wishabi.php?pid=58789782)|\n|CPU Cooler|[be quiet! Dark Rock 5 93.5 CFM CPU Cooler](https://ca.pcpartpicker.com/product/FKwmP6/be-quiet-dark-rock-5-935-cfm-cpu-cooler-bk035)|[$93.86](https://www.vuugo.com/product/be-quiet-dark-bk035/?tracking=5108053939762)|\n|Motherboard|[ASRock Z790 Pro RS ATX LGA1700 Motherboard](https://ca.pcpartpicker.com/product/cFQcCJ/asrock-z790-pro-rs-atx-lga1700-motherboard-z790-pro-rs)|[$203.98](https://www.shoprbc.com/wishabi.php?pid=58657667)|\n|Memory|[Patriot Viper Elite 5 RGB 32 GB (1 x 32 GB) DDR5-5600 CL38 Memory](https://ca.pcpartpicker.com/product/tTV2FT/patriot-viper-elite-5-rgb-32-gb-1-x-32-gb-ddr5-5600-cl38-memory-pver532g56c38w)|[$95.99](https://www.amazon.ca/dp/B0CBMQ899S?tag=pcp0f-20&linkCode=ogi&th=1&psc=1)|\n|Storage|[Samsung 990 EVO Plus 1 TB M.2-2280 PCIe 5.0 X2 NVME Solid State Drive](https://ca.pcpartpicker.com/product/XQFmP6/samsung-990-evo-plus-1-tb-m2-2280-pcie-50-x2-nvme-solid-state-drive-mz-v9s1t0bw)|[$126.96](https://www.shoprbc.com/wishabi.php?pid=59824211)|\n|Video Card|[Asus PRIME GeForce RTX 5060 Ti 16 GB Video Card](https://ca.pcpartpicker.com/product/M64Pxr/asus-prime-geforce-rtx-5060-ti-16-gb-video-card-prime-rtx5060ti-16g)|[$625.99](https://www.canadacomputers.com/en/Powered-By-Nvidia/271352/asus-prime-geforce-rtx-5060-ti-16gb-gddr7-graphics-card-pcie-5-0-sff-ready-prime-rtx5060ti-16g-PRIME-RTX5060TI-16G.html)|\n|Case|[Gigabyte AORUS C500 GLASS ATX Mid Tower Case](https://ca.pcpartpicker.com/product/4rTp99/gigabyte-aorus-c500-glass-atx-mid-tower-case-gb-ac500g)|[$349.99](https://www.canadacomputers.com/en/Mid-Tower-Cases/242862/gigabyte-aorus-c500-glass-black-mid-tower-pc-gaming-case-tempered-glass-usb-type-c-4x-arbg-fans-included-gb-ac500g-st-GB-AC500G-ST.html)|\n|Power Supply|[SAMA GT 750 W 80+ Gold Certified Fully Modular ATX Power Supply](https://ca.pcpartpicker.com/product/6YWmP6/sama-gt-750-w-80-gold-certified-fully-modular-atx-power-supply-gt750-bkgffxx1-us)|[$99.99](https://www.newegg.ca/sama-gt750-series-gt750-black/p/1HU-02S6-00060?item=9SIB41PKCW8732)|\n|Monitor|[MSI PRO MP275Q 27.0\" 2560 x 1440 100 Hz Monitor](https://ca.pcpartpicker.com/product/Jw26Mp/msi-pro-mp275q-270-2560-x-1440-100-hz-monitor-pro-mp275q)|[$189.99](https://www.canadacomputers.com/en/25-29-Home-Office-Monitors/253148/msi-pro-27-wqhd-2560x1440-ips-100hz-1ms-mprt-business-monitor-Pro-MP275Q.html)|\n|Speakers|[Logitech Z207 (Black) 10 mW Speakers](https://ca.pcpartpicker.com/product/gvDJ7P/logitech-z207-black-001w-2ch-speakers-980-001294)|[$83.88](https://www.vuugo.com/product/logitech-z207-20-980-001294/?tracking=5108053939762)|\n||**TOTAL:**|$2,355.59|\n\nJust let me know if anything looks off or a wrong choice. I'm not looking to spend much more than what I have right here unless its for an overtly huge improvement, I'm also okay with ditching the monitor in order to invest more into the actual computer itself if need be.\n\n  \nEDIT:  I forgot to mention, I did chose the motherboard specifically so I could run my graphics card into it and use the Thunderbolt output on the board to an Apple (2011?) 27-inch Thunderbolt display which currently *does* work on my Windows 11 Laptop. I do a two monitor setup and the one listed is to replace my current other monitor which is a basic BenQ 1080p monitor. So any critique will ideally still preserve the ability to use this Apple monitor.",
      "author": "InterestingAd4287",
      "created_utc": 1749058562,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 7,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3bsb7/please_critique_my_pc_part_picker_list/"
    },
    {
      "id": "1l3br3u",
      "title": "Power adapter with the 5070 Ti Windforce",
      "content": "I’m currently worried about breaking the gpu with how much force the power adapter/connector needs for it to click into place. As shown in the picture there is a little gap but the amount of force needed is insane and worrying.\n\nhttps://imgur.com/a/abojXHk ",
      "author": "M4J-xo",
      "created_utc": 1749058483,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3br3u/power_adapter_with_the_5070_ti_windforce/"
    },
    {
      "id": "1l3borr",
      "title": "New Gaming PC - FPS Drops in Low-End Games at 1080p",
      "content": "I just finished setting up my very first gaming PC and I’m running into some unexpected performance issues. I’m still a beginner, so I’m not sure what I might have done wrong.\n\nMy PC Specs:\n\nCPU: Intel Core i5-14600KF\n\nGPU: NVIDIA RTX 4060 8GB\n\nRAM: 32GB DDR5\n\nAll my drivers are updated to the latest versions, and Windows is also fully up to date.\n\nThe issue is that I’m getting unstable FPS in low-end games even when running them on max settings at 1080p. For example:\n\nIn one game, I might be getting 160 FPS, but then it suddenly drops to 120 or lower, causing stuttering or lag.\n\nI see similar random dips in other games too, even when I think my system should easily handle them.\n\nTemps seem fine, and I’ve already tried basic things like turning off background apps. I’m not sure if this is a hardware issue, a settings problem, or something else.\n\nAny advice or guidance would mean a lot. Thanks in advance!",
      "author": "Pleasant_Dig_167",
      "created_utc": 1749058329,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 10,
      "flair": "Discussion",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3borr/new_gaming_pc_fps_drops_in_lowend_games_at_1080p/"
    },
    {
      "id": "1l3bo2v",
      "title": "Best headset for 35$?",
      "content": "I have my eyes on the redragon h350 pandora since it costs 35$ in my country but idk if its still worth it since its old so i was hoping for recommendations ",
      "author": "kaewede",
      "created_utc": 1749058283,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 2,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3bo2v/best_headset_for_35/"
    },
    {
      "id": "1l3bkyg",
      "title": "Help me decide if a 3070ti in 2025 is still good",
      "content": "A friend of mine is offering me his old evga 3070 to ftw3 ultra for 260€ I’m currently using a rx 5700 oc. Now I am wondering if I should take the offer or if the 3070 to is too old.",
      "author": "Elia-San_to",
      "created_utc": 1749058090,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 37,
      "flair": "Build Upgrade",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3bkyg/help_me_decide_if_a_3070ti_in_2025_is_still_good/"
    },
    {
      "id": "1l3bhcw",
      "title": "PC or Monitor, Goes Blank?",
      "content": "I have a basic Dell (i7, 32 GB RAM, RTX 3050 8 GB VRAM). I recently purchased an ACER 32in 165Mhz. Worked fine until I, like alot of others learned that there is a refresh setting on the PC. Any rate I set it at above 60 Mhz (120,144, or 165), and the screen randomly goes blank for 3 to 5 seconds. Doesn't matter if there is no screen activity or deep into game playing. Is my problem with the PC or the monitor? Thanks in advance.",
      "author": "uadmlj1",
      "created_utc": 1749057860,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 3,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3bhcw/pc_or_monitor_goes_blank/"
    },
    {
      "id": "1l3bgvl",
      "title": "Normal for there to be variance in framerates between the same GPUs?",
      "content": "Hello, I recently built a pc using a gigabyte windforce ssf rtx 5070 but I decided to return it in favor of a pny 5070 oc for about $50 less. I noticed that my PNY performs around 3-4 fps worse than the gigabyte card did. Is this normal/expected? Thanks for the help!",
      "author": "peachteabreeze",
      "created_utc": 1749057827,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 4,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3bgvl/normal_for_there_to_be_variance_in_framerates/"
    },
    {
      "id": "1l3bg03",
      "title": "Want some reviews on my potential PC build - being used to run large models and servers in a lab",
      "content": "Hey guys! Im being tasked with building a PC build for a lab I'm at. Its likely were going to be running servers on the computer, as well as models for some computational stuff.  \nMy rough guidelines were to chose a CPU with 16 cores, a gpu thats capable of running large models and that has 16gb of vram, and to have at least 64gb of ram as well. This is the build I came up with [https://pcpartpicker.com/list/yWbBdb](https://pcpartpicker.com/list/yWbBdb)  \nFor those who don't want to click the link, the build is as follows:  \nan amd 9 9950x cpu, a rtx 5060ti 16gb OC triple fan GPU, 64 gigs of ddr5-6000 cl30 ram, an asrock 870e nova mobo, a 1000w corsair rm1000x SHIFT psu (ik this might be a bit overkill), an arctic III 360 AIO cooler, and 1tb of nv3 nvme storage. The case im thinking of is a fractal xl full size ATX case, since I'm a bit anxious to go for a mid size one.\n\nWould you guys have any thoughts, comments or concerns regarding some of these parts? The current cost of affordable, so its not really a question of saving money. The bigger concern is if it is capable of AI/ML research. If yall have suggestions for any better parts though (or compatibility!!!!), please let me know <3",
      "author": "Rare-Trade9358",
      "created_utc": 1749057772,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 3,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3bg03/want_some_reviews_on_my_potential_pc_build_being/"
    },
    {
      "id": "1l3beh8",
      "title": "Psu paperclip test",
      "content": "So built a brand new pc, not sure if i connected everything properly, checked multiple times and started to think it may be up to PSU. I have a BeQuiet 12 M 750W, did the paperclip test but only hear a relay click once and a click when i take out the paperclip. Its brand new, can someone confirm if it works or not?",
      "author": "Reasonable-Ad8466",
      "created_utc": 1749057674,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 0,
      "flair": "Troubleshooting",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3beh8/psu_paperclip_test/"
    },
    {
      "id": "1l3b8lt",
      "title": "Need advice on PC Build",
      "content": "Hi All,\n\nI need some advice on building a custom PC. \nUsing AMD 9950x3d as cpu and 5080 as gpu what can be best paired motherboard and PSU. \nAlso I am assuming Liquid cooling would be best like an AIO cooler rather than fan cooling? \nUsing ram as gskill trident 32 gb x 2\nI know this looks like an overkill but ig I don't mind spending this much to atleast have good PC for next 5 years. \nObviously gpu may get upgraded and so might cpu but any advice would be greatly appreciated. ",
      "author": "funnypranav",
      "created_utc": 1749057298,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 12,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3b8lt/need_advice_on_pc_build/"
    },
    {
      "id": "1l3b7rh",
      "title": "Strange moherboard issue pls help",
      "content": "So i decided to update from windows 10 to 11. I installed it succesfully and started installing some apps & drivers. I opened the task manager and saw that all my SATA SSDs were showing as ATA devices. Booted into bios and set the sata mode from IDE to AHCI. Windows showed a BSOD (inaccessible\\_boot\\_device). After the BSOD my pc rebooted and now it doesnt even boot up BIOS and the system as well. Just a black screen, speaker is silent. Tried resetting my bios > nothing. BUT if i remove all my RAM speaker starts to beep. Tried switching my RAM, CPU, GPU, PSU > nothing. Any suggestions except the service?\n\nCPU: core i5 3470  \nRAM: DDR3 16gb  \nMotherboard: Gigabyte GA-H61M-S1 rev 2.2  \nGPU: GTX 1060  \nPSU: Glacial power 450W\n\nShortly: No display when booting (No bios and system just black screen). Swapped out every component > nothing.",
      "author": "Wide_Deliveryboy",
      "created_utc": 1749057247,
      "upvotes": 1,
      "upvote_ratio": 0.66,
      "num_comments": 1,
      "flair": "Build Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/buildapc/comments/1l3b7rh/strange_moherboard_issue_pls_help/"
    }
  ]
}