{
  "subreddit": "explainlikeimfive",
  "collection_date": "2025-06-05T13:25:55.971938",
  "total_posts": 200,
  "posts": [
    {
      "id": "1l3ms78",
      "title": "ELI5: How do companies prevent employees from leaking their products prior to the release date?",
      "content": "I understand that they probably sign NDA’s. But what is honestly stopping employees from anonymously leaking information to the public? Example: Toyota and future car releases. I imagine the product development team for, say, an entirely new body style pickup would be quite large. How would they even track back and find out who leaked the information? ",
      "author": "bobbydurst6",
      "created_utc": 1749086620,
      "upvotes": 419,
      "upvote_ratio": 0.86,
      "num_comments": 187,
      "flair": "Engineering",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l3ms78/eli5_how_do_companies_prevent_employees_from/"
    },
    {
      "id": "1l3sto2",
      "title": "ELI5: How do the wooden sticks used to make torches not burn down if wood is normally flammable?",
      "content": null,
      "author": "GlxbeWrldz",
      "created_utc": 1749107249,
      "upvotes": 67,
      "upvote_ratio": 0.81,
      "num_comments": 44,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l3sto2/eli5_how_do_the_wooden_sticks_used_to_make/"
    },
    {
      "id": "1l2zzqe",
      "title": "ELI5: Why has rabies not entirely decimated the world?",
      "content": "Even today, with extensive vaccine programs in many parts of the world, rabies kills \\~60,000 people per year. I'm wondering why, especially before vaccines were developed, rabies never reached the pandemic equivalent of influenza or TB or the bubonic plague?\n\nI understand that airborne or pest-borne transmission is faster, but rabies seems to have the perfect combination of variable/long incubation with nonspecific symptoms, cross-species transmission for most mammals, behavioural modification to aid transmission, and effectively 100% mortality.\n\nSo why did rabies not manage to wreak more havoc or even wipe out entire species? If not with humans, then at least with other mammals (and again, especially prior to the advent of vaccines)?",
      "author": "luckyrunner",
      "created_utc": 1749024408,
      "upvotes": 3687,
      "upvote_ratio": 0.91,
      "num_comments": 591,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l2zzqe/eli5_why_has_rabies_not_entirely_decimated_the/"
    },
    {
      "id": "1l3p0mg",
      "title": "ELI5 how smaller can we make computer chips?",
      "content": "Smallest we have made is 3nm what happens when we reach 2 or even 1 nm will they just start making the die bigger since they can’t shrink it more?",
      "author": "Wild_Carpet_7005",
      "created_utc": 1749093456,
      "upvotes": 65,
      "upvote_ratio": 0.79,
      "num_comments": 51,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l3p0mg/eli5_how_smaller_can_we_make_computer_chips/"
    },
    {
      "id": "1l3v3rd",
      "title": "ELI5: Why do alot of computer headphones use USB now instead of the headphone jack style?",
      "content": null,
      "author": "_SCREE_",
      "created_utc": 1749116783,
      "upvotes": 13,
      "upvote_ratio": 0.71,
      "num_comments": 19,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l3v3rd/eli5_why_do_alot_of_computer_headphones_use_usb/"
    },
    {
      "id": "1l3qcqr",
      "title": "ELI5: Where do the bubbles come from in boiling water? They seem to appear from nowhere.",
      "content": null,
      "author": "HuckleberryFew8263",
      "created_utc": 1749097972,
      "upvotes": 30,
      "upvote_ratio": 0.65,
      "num_comments": 33,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l3qcqr/eli5_where_do_the_bubbles_come_from_in_boiling/"
    },
    {
      "id": "1l35lvc",
      "title": "ELI5 Are hand dryers in public bathrooms really worse for hygiene?",
      "content": "Noone is making hand contact. \n\nThe machine is literally just blowing air at you. ",
      "author": "WachanIII",
      "created_utc": 1749043797,
      "upvotes": 380,
      "upvote_ratio": 0.89,
      "num_comments": 191,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l35lvc/eli5_are_hand_dryers_in_public_bathrooms_really/"
    },
    {
      "id": "1l3icdy",
      "title": "ELI5 how does a coil IUD slowly and steadily release hormones over many years?",
      "content": "My wife's coil lasts 5 years. How does the material it's made from release the hormone at such a steady rate for so long? ",
      "author": "Alternative-Moose-78",
      "created_utc": 1749074242,
      "upvotes": 68,
      "upvote_ratio": 0.87,
      "num_comments": 12,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l3icdy/eli5_how_does_a_coil_iud_slowly_and_steadily/"
    },
    {
      "id": "1l3t56j",
      "title": "ELI5: Why do we feel awkward in silence with people?",
      "content": "Why do humans need to \"fill the silence\" in conversations? What makes quiet moments feel weird sometimes?",
      "author": "FlorenicaB",
      "created_utc": 1749108540,
      "upvotes": 10,
      "upvote_ratio": 0.81,
      "num_comments": 10,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l3t56j/eli5_why_do_we_feel_awkward_in_silence_with_people/"
    },
    {
      "id": "1l2xfzq",
      "title": "ELI5 Out of curiosity, what is the evolutionary reason why women tend to be shorter than men?",
      "content": "What",
      "author": "Tofuboy1234",
      "created_utc": 1749014298,
      "upvotes": 1165,
      "upvote_ratio": 0.88,
      "num_comments": 292,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l2xfzq/eli5_out_of_curiosity_what_is_the_evolutionary/"
    },
    {
      "id": "1l3qx1a",
      "title": "ELI5 What is Touch, really? How does my brain know I'm holding a stone and not silk?",
      "content": "Went through a lot of material, but no concrete answer can anyone help me! ",
      "author": "Connect-Lab6561",
      "created_utc": 1749099964,
      "upvotes": 13,
      "upvote_ratio": 0.74,
      "num_comments": 6,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l3qx1a/eli5_what_is_touch_really_how_does_my_brain_know/"
    },
    {
      "id": "1l3syit",
      "title": "ELI5: What is a \"chord progression\"?",
      "content": "I was just scrolling thru Youtube and I came across an old video/song [\"4 Chords\" by Axis of Awesome,](https://www.youtube.com/watch?v=5pidokakU4I) a comedy skit/song about how many pop songs use the same 4 chords. I then watched [a video explaining more details about that song](https://www.youtube.com/watch?v=VHNez1VVJKY) and how 1 song using the same 4 chord progression differs from another.  And then [this video tracing the use of the \"4 chords\" over time](https://www.youtube.com/watch?v=U8ImkF7FMPw). THIS is where the trouble began.\n\nNow, I grew up in the 80's...I understand the idea of the \"4 power chords\" from Don't Stop Believing, but I realized watching both of these videos... I have no idea what they're actually talking about...like it's not just 4 notes (or comination of notes I guess which is what a chord is) over and over like 1-2-3-4 1-2-3-4 (I'm picturing a conductor's baton doing the 1-2-3-4 for the record there)\\*..or is it? There seems to be a lot happening \"during the chord\" as identified in the third video, more than just a moment's sound.\n\n\n\n\\*(I was in the middle school \"orchestra\" playing snare drum, which might be why i can only grasp beats rather than notes etc, ftr).",
      "author": "Scavgraphics",
      "created_utc": 1749107794,
      "upvotes": 6,
      "upvote_ratio": 0.88,
      "num_comments": 7,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l3syit/eli5_what_is_a_chord_progression/"
    },
    {
      "id": "1l3bmm7",
      "title": "ELI5: How did NBC, CBS etc broadcast live radio shows nationwide before 1950?",
      "content": "Obviously there was no satellite but also no microwave relays or fiber/coax.  How could someone in say Los Angeles be listening to a show broadcast from New York?",
      "author": "MartyVanB",
      "created_utc": 1749058199,
      "upvotes": 56,
      "upvote_ratio": 0.78,
      "num_comments": 51,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l3bmm7/eli5_how_did_nbc_cbs_etc_broadcast_live_radio/"
    },
    {
      "id": "1l3cebg",
      "title": "ELI5: how do those weird facebook scams about, for example, car detailing work?",
      "content": "You know the ones, in various local groups, that are like, \"Just want to praise this young man whose dad died at a construction site and whose mom can barely breathe due to black mold poisoning, who decided to step up and take care of his family by starting SHINE Detailing! He cleaned my car yesterday and everyone I've seen since has asked if it's new! Let's support our younger generation because if we don't, who will?\" and then has a couple pictures of someone cleaning a car? Then, they turn comments off. Often, they say you don't have to pay till you see what a good job they did. So do they change their tune at some point and request a credit card? Do they actually clean the car and then just steal the CC number and use it later? This also could be vent cleaning, chimney cleaning, whatever--there are so many versions of this, but i don't fully understand the mechanics of it.",
      "author": "Apart_Cartographer64",
      "created_utc": 1749060004,
      "upvotes": 45,
      "upvote_ratio": 0.82,
      "num_comments": 9,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l3cebg/eli5_how_do_those_weird_facebook_scams_about_for/"
    },
    {
      "id": "1l3fk1f",
      "title": "ELI5: If there's some hydrogen atoms in the void of space, are black holes filled with hydrogen?",
      "content": "Like, I know there are some atoms, mostly hydrogen (I think). And black holes suck everything near them. So that means that black holes have atoms of hydrogen orbiting around them, and inside them? And if I follow that logic, that means that black holes are filled of broken planets, stars and asteroids?",
      "author": "Its_Frigopiee",
      "created_utc": 1749067448,
      "upvotes": 32,
      "upvote_ratio": 0.75,
      "num_comments": 64,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l3fk1f/eli5_if_theres_some_hydrogen_atoms_in_the_void_of/"
    },
    {
      "id": "1l38jah",
      "title": "ELI5: Why does plastic packaging have the color palette posted on the packaging?",
      "content": "Look at any plastic packaging. Toilet paper, granola bars, even cardboard cereal boxes that aren’t even plastic. Why does packaging have a color palette posted on it (with relative percentages of each color)?",
      "author": "unhappyjihadist",
      "created_utc": 1749050999,
      "upvotes": 60,
      "upvote_ratio": 0.81,
      "num_comments": 28,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l38jah/eli5_why_does_plastic_packaging_have_the_color/"
    },
    {
      "id": "1l39ccv",
      "title": "ELI5 Why do we like some music and not others? In the end it is just sounds, so why does our brain say we like one but not the other?",
      "content": "Moosic",
      "author": "Shadowsin64",
      "created_utc": 1749052890,
      "upvotes": 38,
      "upvote_ratio": 0.73,
      "num_comments": 16,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l39ccv/eli5_why_do_we_like_some_music_and_not_others_in/"
    },
    {
      "id": "1l2yh2i",
      "title": "ELI5: why did some mammals evolve to having 1 baby at a time (humans, elephants) while others have litters of 5+ (dogs, cats, rabbits)?",
      "content": null,
      "author": "orangezest2",
      "created_utc": 1749018242,
      "upvotes": 140,
      "upvote_ratio": 0.86,
      "num_comments": 46,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l2yh2i/eli5_why_did_some_mammals_evolve_to_having_1_baby/"
    },
    {
      "id": "1l2vflg",
      "title": "ELI5: how does the WiFi router know which device to send the data packets to ?",
      "content": "I live in a hostel with 500 people. Each one has atleast two devices, a mobile and a laptop. How does the WiFi router know which data packet to send to which device ?",
      "author": "DukhiMogambo",
      "created_utc": 1749007372,
      "upvotes": 238,
      "upvote_ratio": 0.86,
      "num_comments": 107,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l2vflg/eli5_how_does_the_wifi_router_know_which_device/"
    },
    {
      "id": "1l2v17a",
      "title": "Eli5: Why do banks have such a low interest rate on savings accounts when loan interest rates are really high?",
      "content": "I may be wrong, but don't banks use loan interest rates to make money and some of that money earned goes to pay interest into savings accounts (where the bank got money to loan out)?",
      "author": "Future-Number7381",
      "created_utc": 1749006083,
      "upvotes": 253,
      "upvote_ratio": 0.83,
      "num_comments": 164,
      "flair": "Economics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l2v17a/eli5_why_do_banks_have_such_a_low_interest_rate/"
    },
    {
      "id": "1l2ssb4",
      "title": "ELI5 The first Tarzan story is in the public domain but the name Tarzan is still owned by the author's estate?",
      "content": "I just don't understand how both can be true. If the story is in the public domain, and the character in the story is called Tarzan, how is the name Tarzan still protected?",
      "author": "MyAccountWasBanned7",
      "created_utc": 1748999264,
      "upvotes": 255,
      "upvote_ratio": 0.88,
      "num_comments": 75,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l2ssb4/eli5_the_first_tarzan_story_is_in_the_public/"
    },
    {
      "id": "1l299fb",
      "title": "ELI5: Why do we wake up just before our alarm sometimes, even if we went to bed late?",
      "content": "It’s weird — sometimes I’ll go to bed at like 2 AM, set my alarm for 8, and still wake up at 7:58 feeling like I “beat” it.\nHow does my body know when to wake up, even without checking the time?\n\nDoes my brain have a built-in clock or something? How is that even possible without me consciously knowing the time?",
      "author": "ParasSharma2306",
      "created_utc": 1748949501,
      "upvotes": 2116,
      "upvote_ratio": 0.94,
      "num_comments": 133,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l299fb/eli5_why_do_we_wake_up_just_before_our_alarm/"
    },
    {
      "id": "1l2apjv",
      "title": "ELI5: Why do nut allergies seem way more common now than they were a two or three decades ago?",
      "content": "Growing up, I don’t remember anyone in my school having nut allergies, but now it feels like every classroom has at least one kid with a severe allergy. Everyone used to bring peanut butter sandwiches for lunch, now no one can...\n\nWhat changed? Is it our environment, our diets, or something else?\n\n",
      "author": "rgb168",
      "created_utc": 1748954029,
      "upvotes": 1600,
      "upvote_ratio": 0.9,
      "num_comments": 613,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l2apjv/eli5_why_do_nut_allergies_seem_way_more_common/"
    },
    {
      "id": "1l38m1q",
      "title": "ELI5 How does the body know when a wound is fully healed?",
      "content": "Currently with my sister while she receives wound care. She had a leg injury and after debreedment, her calf muscles, meat etc looked like a dog bit it and it was very eaten away. The wound is nowhere near finished healing and gets rewrapped regularly. Healing progress has been amazing and the thickness of her thigh is returning and now I’m wondering at what point does her leg stop “regenerating”. I’m sure there won’t be an instance of her leg ending up larger than normal but I’m still curious of how we know her leg/scar tissue etc won’t over grow? ",
      "author": "observantandcreative",
      "created_utc": 1749051177,
      "upvotes": 11,
      "upvote_ratio": 0.66,
      "num_comments": 3,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l38m1q/eli5_how_does_the_body_know_when_a_wound_is_fully/"
    },
    {
      "id": "1l2j7qg",
      "title": "ELI5: Why is silver the most conductive metal?",
      "content": "I recently did a trivia question that asked what the most conductive metal is, and I thought it was gold. Turns out it's silver, I looked it up to try and see why, but on the periodic table it's below copper, and above gold. I would think that gold would be more conductive by default based on valence electrons. I need help understanding why silver is the most conductive.\n\nEDIT: Thanks to everyone who helped explain, it's a fascinating concept to learn about! Also, thanks to all the people who also didn't know, it made me not feel alone in the misconception. ",
      "author": "PokeJurd",
      "created_utc": 1748974555,
      "upvotes": 410,
      "upvote_ratio": 0.93,
      "num_comments": 78,
      "flair": "Chemistry",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l2j7qg/eli5_why_is_silver_the_most_conductive_metal/"
    },
    {
      "id": "1l37mye",
      "title": "ELI5 - how does sound transfer into an analog material (vinyl, old wax spindle things, etc (?",
      "content": "That's really it. I get sounds being recorded, which makes them digital, to write on CDs or another digital medium. But how does sound transfer in analog ways onto other mediums- wax spools (like for old phonographs), vinyl records, etc. I don't understand how sound can just be put on something physical. I know it's a series of bumps and scratches and dips and valleys and whatnot, but how does Nirvana not sound like Dolly Parton (or some other example)? The bumps and valleys don't know the difference in sounds, obviously. Also, how does the analog medium pick up multiple sounds, like guitars AND drums AND bass AND vocals, etc.? \n\nEdit: thank you for the explanations! While I honestly don't know what to reply to, that's not because of any of you. I simply think my brain cannot comprehend how air pressure, air gaps, and vibrations produce SOUND. I just don't think my brain works in a way that I can understand this... Sound, something abstract, can be put into something physical... It's so mind boggling to me. \n\nI VERY MUCH appreciate the explanations, though! ",
      "author": "mastrochr",
      "created_utc": 1749048908,
      "upvotes": 10,
      "upvote_ratio": 0.67,
      "num_comments": 24,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l37mye/eli5_how_does_sound_transfer_into_an_analog/"
    },
    {
      "id": "1l32byk",
      "title": "ELI5: What is the evolutionary reason human have such few protections at the front of the torso?",
      "content": "If we must turn the front of our body to face threats, why does the back enjoy more protection from having the spine, more ribcage, and more muscles\n\nThe front ribcage seems to just open up below the heart, exposing any vital organs below to attacks, with only thin layers of muscles and fat in the way.",
      "author": "nufeze",
      "created_utc": 1749033763,
      "upvotes": 15,
      "upvote_ratio": 0.6,
      "num_comments": 38,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l32byk/eli5_what_is_the_evolutionary_reason_human_have/"
    },
    {
      "id": "1l245rv",
      "title": "ELI5: What exactly, in water, can sharks \"smell\" from over 3 miles away? If a drop of blood is in the water, what within this drop travels 3 miles?",
      "content": "Certainly the blood doesn't travel that quickly right? So what does?",
      "author": "gordonwelty",
      "created_utc": 1748929371,
      "upvotes": 2728,
      "upvote_ratio": 0.95,
      "num_comments": 265,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l245rv/eli5_what_exactly_in_water_can_sharks_smell_from/"
    },
    {
      "id": "1l34mm6",
      "title": "ELI5: How do seedless varieties of plants work?",
      "content": null,
      "author": "Eatswithducks",
      "created_utc": 1749041117,
      "upvotes": 6,
      "upvote_ratio": 0.66,
      "num_comments": 16,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l34mm6/eli5_how_do_seedless_varieties_of_plants_work/"
    },
    {
      "id": "1l1u573",
      "title": "ELI5 why are there stenographers in courtrooms, can't we just record what is being said?",
      "content": null,
      "author": "AntoTuf06",
      "created_utc": 1748899396,
      "upvotes": 9114,
      "upvote_ratio": 0.94,
      "num_comments": 693,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l1u573/eli5_why_are_there_stenographers_in_courtrooms/"
    },
    {
      "id": "1l2augl",
      "title": "ELI5 why do airplanes fly so high in the sky?",
      "content": "I’ve always wondered why airplanes fly way up high instead of closer to the ground. What makes flying at that height better or safer?\n\nAlso, how do pilots know exactly where to fly up there with so many planes in the sky? Would love a simple explanation!",
      "author": "LidiaSelden96",
      "created_utc": 1748954411,
      "upvotes": 371,
      "upvote_ratio": 0.76,
      "num_comments": 289,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l2augl/eli5_why_do_airplanes_fly_so_high_in_the_sky/"
    },
    {
      "id": "1l2m60u",
      "title": "ELI5: What is a diphthong?",
      "content": null,
      "author": "mycatisloud_",
      "created_utc": 1748981846,
      "upvotes": 91,
      "upvote_ratio": 0.72,
      "num_comments": 59,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l2m60u/eli5_what_is_a_diphthong/"
    },
    {
      "id": "1l22vnf",
      "title": "ELI5 What prevents traffic lights from giving incorrect signals?",
      "content": "I can't ever recall hearing about or seeing a traffic accident where the cause was conflicting signals. For instance, where two perpendicular turn lanes both get green arrows to turn into the same lane. Does this actually happen more often than I think? If not, what mechanism/code/engineering wizardry stops it from happening?",
      "author": "JetKusanagi",
      "created_utc": 1748924708,
      "upvotes": 418,
      "upvote_ratio": 0.86,
      "num_comments": 126,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l22vnf/eli5_what_prevents_traffic_lights_from_giving/"
    },
    {
      "id": "1l1y6hn",
      "title": "ELI5: How/why does India or China have SO many people?",
      "content": "I just really internalized for the first time that they have over a billion people in each country. How did they experience such a boom? Why don’t more countries follow a similar trajectory?  What is it about those countries that has lead to such a dense population?",
      "author": "Electrical_habit995",
      "created_utc": 1748910094,
      "upvotes": 723,
      "upvote_ratio": 0.86,
      "num_comments": 284,
      "flair": "Planetary Science",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l1y6hn/eli5_howwhy_does_india_or_china_have_so_many/"
    },
    {
      "id": "1l2ezou",
      "title": "ELI5 At what point do accents stop being considered as accents and become mispronunciations of a word?",
      "content": null,
      "author": "zzzz_zach",
      "created_utc": 1748964808,
      "upvotes": 29,
      "upvote_ratio": 0.61,
      "num_comments": 59,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l2ezou/eli5_at_what_point_do_accents_stop_being/"
    },
    {
      "id": "1l1gsnq",
      "title": "ELI5: Why have so many animals evolved to have exactly 2 eyes?",
      "content": "Aside from insects, most animals that I can think of evolved to have exactly 2 eyes. Why is that? Why not 3, or 4, or some other number?\n\nAnd why did insects evolve to have many more eyes than 2?\n\nSome animals that live in the very deep and/or very dark water evolved 2 eyes that eventually (for lack of a better term) atrophied in evolution. What I mean by this is that they evolved 2 eyes, and the 2 eyes may even still be visibly there, but eventually evolution de-prioritized the sight from those eyes in favor of other senses. I know why they evolved to rely on other senses, but why did their common ancestors also have 2 eyes?\n\nWhat's the evolutionary story here? TIA 🐟🐞😊",
      "author": "w3bcrawl3r",
      "created_utc": 1748867460,
      "upvotes": 3901,
      "upvote_ratio": 0.93,
      "num_comments": 566,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l1gsnq/eli5_why_have_so_many_animals_evolved_to_have/"
    },
    {
      "id": "1l1udqj",
      "title": "ELI5: Please explain how ‘doughnutting tickets’ work on the London Underground.",
      "content": "I’ve been watching a TV show about fare dodgers on the London Underground and the narrator talked about doughnutting. I Googled it but I still don’t understand it!",
      "author": "citizencamembert",
      "created_utc": 1748899973,
      "upvotes": 507,
      "upvote_ratio": 0.9,
      "num_comments": 136,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l1udqj/eli5_please_explain_how_doughnutting_tickets_work/"
    },
    {
      "id": "1l1yrvs",
      "title": "ELI5: Over my lifetime I’ve met several people with Down Syndrome. Some are very high functioning and some have very severe symptoms- no speech at all, etc. What causes such a vast difference?",
      "content": "Please explain.",
      "author": "Hxucivovi",
      "created_utc": 1748911867,
      "upvotes": 271,
      "upvote_ratio": 0.89,
      "num_comments": 56,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l1yrvs/eli5_over_my_lifetime_ive_met_several_people_with/"
    },
    {
      "id": "1l29zsw",
      "title": "ELI5: When the air temperature gets warmer on a sunny day, how much of that is from the sun’s rays heating up the air itself as they pass through, as opposed to heating up the ground which passes that warmth to the air?",
      "content": "Does the air get warmer mostly due to the sun’s rays warming the air molecules themselves? Or do they primarily just pass through the air and warm the ground, asphalt, buildings, cars, etc. which then transfer that heat to the air?",
      "author": "FerfyMoe",
      "created_utc": 1748951869,
      "upvotes": 25,
      "upvote_ratio": 0.73,
      "num_comments": 6,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l29zsw/eli5_when_the_air_temperature_gets_warmer_on_a/"
    },
    {
      "id": "1l2guvx",
      "title": "ELI5 difference between a bank and a credit union?",
      "content": null,
      "author": "Glittering_Skill6297",
      "created_utc": 1748969206,
      "upvotes": 11,
      "upvote_ratio": 0.7,
      "num_comments": 13,
      "flair": "Economics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l2guvx/eli5_difference_between_a_bank_and_a_credit_union/"
    },
    {
      "id": "1l1ybfr",
      "title": "ELI5: Why is it harder to breathe when air (fan, wind) is blasting in your face?",
      "content": "Why does it feel harder to breathe when a gust air of is blasting in your face? ",
      "author": "okkcoolll",
      "created_utc": 1748910505,
      "upvotes": 77,
      "upvote_ratio": 0.82,
      "num_comments": 19,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l1ybfr/eli5_why_is_it_harder_to_breathe_when_air_fan/"
    },
    {
      "id": "1l1ciac",
      "title": "ELI5 Fiber Optic War Drones",
      "content": "Excuse the possibly dumb question but.. How do the fiber optic drones, used in war, work? Is there a dangling wire attached to it? If so, should they be taken off from the top of a building and only fly horizontally (so that the wire cannot be tracked)?",
      "author": "yleNew",
      "created_utc": 1748852027,
      "upvotes": 610,
      "upvote_ratio": 0.92,
      "num_comments": 189,
      "flair": "Engineering",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l1ciac/eli5_fiber_optic_war_drones/"
    },
    {
      "id": "1l27iak",
      "title": "ELI5: What makes people have dimples?",
      "content": "I have dimples but i've noticed others don't. Why is this the case? ",
      "author": "Availbaby",
      "created_utc": 1748942988,
      "upvotes": 5,
      "upvote_ratio": 0.57,
      "num_comments": 9,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l27iak/eli5_what_makes_people_have_dimples/"
    },
    {
      "id": "1l0y4vp",
      "title": "ELI5: Why do Africa and Asia have an abundance of large animals/predators but the Americas and Europe really don’t?",
      "content": "I’m talking lions, hippos, jaguars, tigers, crocs and alligators, etc. in Asia and Africa while in Europe and the americas all I can really think of are bears, mountain lions and jaguars. \nI know US has crocs and alligators but nowhere near the population in the other two continents. So why is it like that? ",
      "author": "Pure_Newspaper_4715",
      "created_utc": 1748807557,
      "upvotes": 5196,
      "upvote_ratio": 0.91,
      "num_comments": 1359,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l0y4vp/eli5_why_do_africa_and_asia_have_an_abundance_of/"
    },
    {
      "id": "1l1vxxo",
      "title": "ELI5 Why does heartbeat/ heart rate increase while inhaling?",
      "content": "I recently found this out while messing with my phone’s mic. Even though I slowed my breathing(both inhaling and exhaling), it was pretty consistent that inhaling(no matter how slow) increases my heart rate while exhaling did the opposite. A google search summary showed that its a normal occurrence, but I couldn’t make sense of the actual explanation.",
      "author": "DevinTheTerrible",
      "created_utc": 1748903913,
      "upvotes": 32,
      "upvote_ratio": 0.76,
      "num_comments": 42,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l1vxxo/eli5_why_does_heartbeat_heart_rate_increase_while/"
    },
    {
      "id": "1l1bpg1",
      "title": "ELI5: If time passes slower when you move faster, does that mean astronauts come back younger?",
      "content": "I heard that time goes slower the faster you go, like when you're near the speed of light. So if astronauts are going super fast around Earth, does that mean when they come back they’re a little bit younger than the rest of us? Is that like real time travel?\n",
      "author": "Necessary_Sale_67",
      "created_utc": 1748848754,
      "upvotes": 440,
      "upvote_ratio": 0.86,
      "num_comments": 97,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l1bpg1/eli5_if_time_passes_slower_when_you_move_faster/"
    },
    {
      "id": "1l1ku4i",
      "title": "ELI5 What exactly does a capacitor do?",
      "content": null,
      "author": "whynot_me",
      "created_utc": 1748877752,
      "upvotes": 63,
      "upvote_ratio": 0.83,
      "num_comments": 66,
      "flair": "Engineering",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l1ku4i/eli5_what_exactly_does_a_capacitor_do/"
    },
    {
      "id": "1l1uac4",
      "title": "ELI5: What happens in the brain to cause foreign accent syndrome?",
      "content": "I just watched a YouTube interview of a woman in the midlands who went to nap off a migraine and woke up with a Geordie accent. Besides saying she had a migraine it wasn’t explained what actually happens.",
      "author": "Newuser10101010101",
      "created_utc": 1748899740,
      "upvotes": 12,
      "upvote_ratio": 0.64,
      "num_comments": 19,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l1uac4/eli5_what_happens_in_the_brain_to_cause_foreign/"
    },
    {
      "id": "1l15x7u",
      "title": "ELI5: Bladeless fans??? How do they work?",
      "content": "I don’t understand the science behind bladeless fans… lol how tf do they work and are they better than normal fans?",
      "author": "fthrcool",
      "created_utc": 1748828684,
      "upvotes": 435,
      "upvote_ratio": 0.87,
      "num_comments": 128,
      "flair": "Engineering",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l15x7u/eli5_bladeless_fans_how_do_they_work/"
    },
    {
      "id": "1l1oid2",
      "title": "ELI5: What is the evolutionary advantage to experiencing menopause?",
      "content": "Why does menopause happen and why does it happen when it does? What is the evolutionary perspective behind this?",
      "author": "waterfall203",
      "created_utc": 1748886344,
      "upvotes": 18,
      "upvote_ratio": 0.58,
      "num_comments": 75,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l1oid2/eli5_what_is_the_evolutionary_advantage_to/"
    },
    {
      "id": "1l0v9j8",
      "title": "ELI5: how does bug spray actually keep mosquitoes off?",
      "content": null,
      "author": "Metalqueen2023",
      "created_utc": 1748800480,
      "upvotes": 489,
      "upvote_ratio": 0.93,
      "num_comments": 40,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l0v9j8/eli5_how_does_bug_spray_actually_keep_mosquitoes/"
    },
    {
      "id": "1l10wo1",
      "title": "ELI5 Why don't more surgeries use spinal blocks?",
      "content": "Curious why most surgeries that are in the area effected by spinal blocks use traditional anesthesia. Example: c-sections primarily use blocks but hysterectomies use traditional. ",
      "author": "DarnHeather",
      "created_utc": 1748814480,
      "upvotes": 215,
      "upvote_ratio": 0.89,
      "num_comments": 66,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l10wo1/eli5_why_dont_more_surgeries_use_spinal_blocks/"
    },
    {
      "id": "1l1ed87",
      "title": "ELI5 How does an in display finger print sensor work even with a screen protector?",
      "content": null,
      "author": "Recent-Analysis-6880",
      "created_utc": 1748859477,
      "upvotes": 17,
      "upvote_ratio": 0.71,
      "num_comments": 6,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l1ed87/eli5_how_does_an_in_display_finger_print_sensor/"
    },
    {
      "id": "1l167as",
      "title": "ELI5: What is a sore throat",
      "content": "I just don't understand how it works, like why does specifically that region become sore? Why can people get them even without having the flu or a common cold or anything?  How does it become infected if food and water is constantly passing through it?",
      "author": "External_Insurance12",
      "created_utc": 1748829548,
      "upvotes": 80,
      "upvote_ratio": 0.8,
      "num_comments": 29,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l167as/eli5_what_is_a_sore_throat/"
    },
    {
      "id": "1l19zso",
      "title": "ELI5: How do we know for sure if the Black Holes have Singularities with an infinite density instead of say a finite 'Plank Density'?",
      "content": "Wouldn't Plank Density also explain the Black Hole observations?",
      "author": "AdClemson",
      "created_utc": 1748842108,
      "upvotes": 42,
      "upvote_ratio": 0.74,
      "num_comments": 19,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l19zso/eli5_how_do_we_know_for_sure_if_the_black_holes/"
    },
    {
      "id": "1l0q5o4",
      "title": "ELI5 Why do we feel nauseous when we see something very graphic and disturbing like for example body mutilations etc.",
      "content": null,
      "author": "VersionIll5727",
      "created_utc": 1748787795,
      "upvotes": 400,
      "upvote_ratio": 0.91,
      "num_comments": 33,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l0q5o4/eli5_why_do_we_feel_nauseous_when_we_see/"
    },
    {
      "id": "1l1fo36",
      "title": "ELI5 : How does proprioception works?",
      "content": "Close your eyes, raise one hand up. Then, touch it with your other hand while still not seeing. Even though its not perfect, I'm amazed this is even possible. The concept is simple enough that I think even cats have, but I cannot visualize how our brain stores physical attributes in the form of electricity.",
      "author": "123Todayy",
      "created_utc": 1748863976,
      "upvotes": 8,
      "upvote_ratio": 0.6,
      "num_comments": 21,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l1fo36/eli5_how_does_proprioception_works/"
    },
    {
      "id": "1l0bszp",
      "title": "ELI5: Why is it comfortable to sit in positions that are bad for you? Why do we frequently have bad posture?",
      "content": null,
      "author": "shazam1394",
      "created_utc": 1748737419,
      "upvotes": 3512,
      "upvote_ratio": 0.96,
      "num_comments": 228,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l0bszp/eli5_why_is_it_comfortable_to_sit_in_positions/"
    },
    {
      "id": "1l0gf7a",
      "title": "ELI5: What was Madoff’s Ponzi scheme and why was it not detected earlier like most Ponzi schemes?",
      "content": "I know what a Ponzi scheme is but they usually fall apart relatively early. ",
      "author": "flatbushz7",
      "created_utc": 1748752638,
      "upvotes": 1132,
      "upvote_ratio": 0.92,
      "num_comments": 253,
      "flair": "Economics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l0gf7a/eli5_what_was_madoffs_ponzi_scheme_and_why_was_it/"
    },
    {
      "id": "1l19e9j",
      "title": "ELI5: How does psychosis happen due to natural causes? (Not drug related)",
      "content": "More specifically, how can psychosis happen to someone that’s never taken drugs? What happens naturally in the brain, like how do chemicals interact? How can stress lead to psychosis? ",
      "author": "Lumpy_Passion_3973",
      "created_utc": 1748839912,
      "upvotes": 9,
      "upvote_ratio": 0.71,
      "num_comments": 17,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l19e9j/eli5_how_does_psychosis_happen_due_to_natural/"
    },
    {
      "id": "1l187fv",
      "title": "ELI5: Dopamine and dopamine related disorders",
      "content": "How is it that dopamine plays such a crucial role in our bodies? Why is it that low dopamine in one person's body presents as ADHD but another person shows symptoms of Parkinson's? Why are they treated with completely different drugs when both disorders pertain to low dopamine? \n\nOr why are high levels of dopamine associated with Mania or tourettes? How is it possible to have both high and low dopamine like in cases of schizophrenia? \n\nAnd how is it possible for so many dopamine related disorders to be comorbid when they are on opposite ends of the spectrum? \n\nThere are so many things that confuse me about dopamine, but what has me the most confused is this as well as the medication we use to treat said disorders. I read that 60-80% of individuals with tourettes experience ADHD symptoms. If tourettes is believed to be associated with too much dopamine how would ADHD be a possibility as well? Also, Ive read people who treat their ADHD with stimulant medications are more likely to develop Parkinson's later in life. Why is that when stimulant medications is meant to increase dopamine? How does it increase the odds rather than warding it off? How do stimulants operate differently that the dopamine medications used for Parkinson's disease? \n\nI don't know if this falls under biologically or chemistry. It's probably a bit of both. ",
      "author": "Solace-y",
      "created_utc": 1748835858,
      "upvotes": 9,
      "upvote_ratio": 0.67,
      "num_comments": 13,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l187fv/eli5_dopamine_and_dopamine_related_disorders/"
    },
    {
      "id": "1l0q5w9",
      "title": "ELI5: where do eyelashes go when it goes inside your eyes",
      "content": null,
      "author": "chaochao25",
      "created_utc": 1748787812,
      "upvotes": 77,
      "upvote_ratio": 0.81,
      "num_comments": 33,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l0q5w9/eli5_where_do_eyelashes_go_when_it_goes_inside/"
    },
    {
      "id": "1l0ikdz",
      "title": "ELI5: How do houseplants improve the air quality of my home?",
      "content": "I'm an apartment dweller, who doesn't have a green thumb. But I’ve heard that houseplants help. And I’m curious about how effective they really are. Do they filter indoor air or make a noticeable difference in how fresh the space feels, since opening windows isn’t always an option for me. I want to understand how adding in plants can make for better air in my home. How do houseplants improve the air quality of my home?",
      "author": "Vintage_Visionary",
      "created_utc": 1748760730,
      "upvotes": 213,
      "upvote_ratio": 0.85,
      "num_comments": 46,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l0ikdz/eli5_how_do_houseplants_improve_the_air_quality/"
    },
    {
      "id": "1kzxdfn",
      "title": "ELI5: Why isn’t all the data from the black box on airplanes get uploaded via satellite internet in real time to an airline server negating the need to find the black box if there’s an accident?",
      "content": "Is it a bandwidth issue? ",
      "author": "greenishstones",
      "created_utc": 1748698846,
      "upvotes": 4986,
      "upvote_ratio": 0.94,
      "num_comments": 564,
      "flair": "Engineering",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kzxdfn/eli5_why_isnt_all_the_data_from_the_black_box_on/"
    },
    {
      "id": "1l1160t",
      "title": "ELI5: How does firework work, especially different shapes like hearts?",
      "content": null,
      "author": "nahulife",
      "created_utc": 1748815150,
      "upvotes": 13,
      "upvote_ratio": 0.66,
      "num_comments": 5,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l1160t/eli5_how_does_firework_work_especially_different/"
    },
    {
      "id": "1l0szam",
      "title": "ELI5: How do countries pay each other?",
      "content": "Like how? For example I'm from a West African country, and sometimes I read stuff like '[insert African country] is in Y dollars of debt to Z country' and I'd imagine with debt said country would have to pay back the money directly but  what would that look like? Where and how does this happen/work?",
      "author": "AdvancedSail4151",
      "created_utc": 1748794876,
      "upvotes": 34,
      "upvote_ratio": 0.72,
      "num_comments": 12,
      "flair": "Economics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l0szam/eli5_how_do_countries_pay_each_other/"
    },
    {
      "id": "1l0f1dd",
      "title": "ELI5 How much of a difference does the depth of a pool effect a competitive swimmer? Also, is there an \"ideal\" depth of a pool?",
      "content": "I just saw that the Olympic trials for swimming is going back to Indianapolis where they set up the temporary pools last year. I assume that the pools used were as shallow as possible in order to use less water. \n\nNow Im not a swimmer, but I feel like training in a pool that's 10 feet deep would be different than swimming in one that's only 6 feet. Im just curious of how it effects the swimmers and why that is. ",
      "author": "floppysausage16",
      "created_utc": 1748747928,
      "upvotes": 338,
      "upvote_ratio": 0.92,
      "num_comments": 48,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l0f1dd/eli5_how_much_of_a_difference_does_the_depth_of_a/"
    },
    {
      "id": "1l08coc",
      "title": "ELI5: How/Why is bitcoin considered anonymous when all transactions are public?",
      "content": "As I understand it the entire purpose of Bitcoin is every transaction is verified and stored publicly and permanently across multiple independent computers. If this is true and we can trace all transactions backwards how is bitcoin anonymous or useful for anonymous transactions?",
      "author": "Prowlthang",
      "created_utc": 1748727623,
      "upvotes": 519,
      "upvote_ratio": 0.9,
      "num_comments": 135,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l08coc/eli5_howwhy_is_bitcoin_considered_anonymous_when/"
    },
    {
      "id": "1l0gw89",
      "title": "ELI5: How can soap kill bacteria but be gentle enough for our skin?",
      "content": null,
      "author": "Plane_Divide5669",
      "created_utc": 1748754344,
      "upvotes": 101,
      "upvote_ratio": 0.78,
      "num_comments": 45,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l0gw89/eli5_how_can_soap_kill_bacteria_but_be_gentle/"
    },
    {
      "id": "1kztuj6",
      "title": "[ELI5] Why don't airplanes have video cameras setup in the cockpits that can be recovered like they have for FDR and CVRs in black boxes?",
      "content": null,
      "author": "Zodiak213",
      "created_utc": 1748687033,
      "upvotes": 2900,
      "upvote_ratio": 0.93,
      "num_comments": 681,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kztuj6/eli5_why_dont_airplanes_have_video_cameras_setup/"
    },
    {
      "id": "1l0063s",
      "title": "ELI5: How did they used to solve murders 100+ years ago before DNA evidence, video, and other tools existed?",
      "content": "Unless there was an eye witness, how did that work?",
      "author": "Queltis6000",
      "created_utc": 1748706318,
      "upvotes": 1030,
      "upvote_ratio": 0.91,
      "num_comments": 202,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l0063s/eli5_how_did_they_used_to_solve_murders_100_years/"
    },
    {
      "id": "1l0a2x0",
      "title": "ELI5: How exactly did they build the ISS in space?",
      "content": null,
      "author": "cucumber1367",
      "created_utc": 1748732411,
      "upvotes": 166,
      "upvote_ratio": 0.84,
      "num_comments": 55,
      "flair": "Engineering",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l0a2x0/eli5_how_exactly_did_they_build_the_iss_in_space/"
    },
    {
      "id": "1kzz5we",
      "title": "ELI5 - Why do all old/vintage items have the same distinct old smell? What exactly am I smelling?",
      "content": "I went to put on a vintage husker du album and it had that soothing recognizable old smell. I like it…. But what is it and what causes it to smell like that?",
      "author": "General_Spring8635",
      "created_utc": 1748703734,
      "upvotes": 317,
      "upvote_ratio": 0.94,
      "num_comments": 33,
      "flair": "Chemistry",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kzz5we/eli5_why_do_all_oldvintage_items_have_the_same/"
    },
    {
      "id": "1l01ids",
      "title": "ELI5: What exactly is the speed of causality, and why can nothing ever go faster than it?",
      "content": "I just found out the speed limit of the universe is really the speed of causality (c), not the speed of light (which also happens to be c, the speed of causality).\n\nIm having a difficult time wrapping my mind around what this means; can somebody please ELI5 wth causality even means, and why it has a speed limit?\n\n",
      "author": "TwistedCollossus",
      "created_utc": 1748709748,
      "upvotes": 121,
      "upvote_ratio": 0.83,
      "num_comments": 163,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l01ids/eli5_what_exactly_is_the_speed_of_causality_and/"
    },
    {
      "id": "1l02inl",
      "title": "ELI5: how a residential heat pump makes heat in winter and cold in the summer.",
      "content": null,
      "author": "brownlawn",
      "created_utc": 1748712299,
      "upvotes": 82,
      "upvote_ratio": 0.78,
      "num_comments": 70,
      "flair": "Engineering",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l02inl/eli5_how_a_residential_heat_pump_makes_heat_in/"
    },
    {
      "id": "1l020tr",
      "title": "Eli5: How does the Tor network know, how to route traffic?",
      "content": "I understand, that it uses Private and Puplic keys to encrypt the traffic of a certain onion domain. But how does it know **where** to send the traffic?",
      "author": "TheBamPlayer",
      "created_utc": 1748711044,
      "upvotes": 65,
      "upvote_ratio": 0.78,
      "num_comments": 16,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l020tr/eli5_how_does_the_tor_network_know_how_to_route/"
    },
    {
      "id": "1l0fv3c",
      "title": "ELI5 What's so complex about two protons colliding within the large hadron collider?",
      "content": "Edit: I mean what's so complex about the collision itself after it happens, not about the experiment to setup the collision though that part was interesting to read about too",
      "author": "ProudReaction2204",
      "created_utc": 1748750676,
      "upvotes": 10,
      "upvote_ratio": 0.6,
      "num_comments": 44,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l0fv3c/eli5_whats_so_complex_about_two_protons_colliding/"
    },
    {
      "id": "1l0g33e",
      "title": "ELI5 What is a ground loop when it comes to my home network?",
      "content": "I have my router, firewall, cable modem, and WiFi AP all plugged into a UPS. \n\nI am experiencing a hum and short when I use shielded cables between my modem and firewall. When I use standard cat 6 cables without metal shields on the plugs, everything is fine. The firewall and modem company both say this is because of a ground loop.\n\nWhat is a ground loop, and how do I correct this? Both companies told me to plug all my network equipment into a single UPS but that’s what I’m already doing, so I’m confused as to what they’re talking about. ",
      "author": "LookInTheMirrorDummy",
      "created_utc": 1748751443,
      "upvotes": 5,
      "upvote_ratio": 0.6,
      "num_comments": 16,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1l0g33e/eli5_what_is_a_ground_loop_when_it_comes_to_my/"
    },
    {
      "id": "1kzwt21",
      "title": "ELI5: If gravity becomes stronger and stronger as you approach a black hole…",
      "content": "To the point where time stops at the event horizon of the black hole, then does that mean there are no actual black holes that have ever had enough time to yet form in the universe? Are they more like “almost” black holes? \n\nAccording to my admittedly very limited knowledge of time dilation, there would not have been enough time yet that has unfolded in the universe for there to be a true black hole.\n\nOr am I thinking moreso in the case of a “singularity”? And if that is the case does that mean there ARE black holes that you could never escape from, but as you pass the event horizon, the singularity would be forming before your eyes as the entire history of the universe unfolds behind you?",
      "author": "TwistedCollossus",
      "created_utc": 1748697229,
      "upvotes": 73,
      "upvote_ratio": 0.75,
      "num_comments": 64,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kzwt21/eli5_if_gravity_becomes_stronger_and_stronger_as/"
    },
    {
      "id": "1kzwrs6",
      "title": "ELI5, Finding The Beat in Music",
      "content": "I, fundamentally do not understand music. I enjoy some music - mostly in the context of musical theatre where the songs lyrics are the major focus, but I do not enjoy just listening to music. I find it kind of stressful, if I'm honest - there's a lot of competing elements that I cannot parse. \n\nThe problem comes now, because I have been taking ballroom dancing classes - I have been able to do the steps well enough and I am enjoying the process but I am not hitting the timing. And I know this is frustrating the people I dance with \"listen for the beat\" they say or \"feel for the time to move\" but I cannot hear it nor can I feel it. Sometimes they will time it out for me but I still cannot understand what part of the sound is telling them that it's time to move. Sometimes I get it by accident and for a moment people are pleased with me - but it is always by accident.\n\nThis is probably something people understand instinctively, but I'm hoping if I can just have it pulled apart the right way I will understand it mechanically and be able to practice it with different pieces of music until I understand enough to fake feeling it. \n\nCan someone please explain like I'm 5 (or perhaps explain like I'm an alien?) how beats in music work? How do you make it out underneath all the different competing elements? ",
      "author": "MoscaMye",
      "created_utc": 1748697121,
      "upvotes": 63,
      "upvote_ratio": 0.71,
      "num_comments": 113,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kzwrs6/eli5_finding_the_beat_in_music/"
    },
    {
      "id": "1kzsw5x",
      "title": "ELI5 the Doppler Effect",
      "content": "Hi everyone. An ambulance just passed by my house and I remembered a physics lesson that I never fully understood: the Doppler Effect. What should I hear as the siren comes and goes? Apart from the different volume between near and far, I never hear any differences... is just that? the volume of the sound? Also I never even understood the many drawing with the blue and the red car... \n\n✅SOLVED! THANKS EVERYONE! :D :)",
      "author": "yleNew",
      "created_utc": 1748683119,
      "upvotes": 104,
      "upvote_ratio": 0.83,
      "num_comments": 39,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kzsw5x/eli5_the_doppler_effect/"
    },
    {
      "id": "1kzefhg",
      "title": "ELI5: Why are stars the only things that turn into black holes?",
      "content": "I always see videos of “how small does [x] have to be to turn into a black hole”, and wonder why more objects, space or otherwise, don’t collapse into black holes.",
      "author": "SalsburrySteak",
      "created_utc": 1748636534,
      "upvotes": 440,
      "upvote_ratio": 0.84,
      "num_comments": 269,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kzefhg/eli5_why_are_stars_the_only_things_that_turn_into/"
    },
    {
      "id": "1kzaurr",
      "title": "ELI5: Why does quantum tunneling happen when you're trying to make very small transistors?",
      "content": "I read that when you try to make very small (<5nm) transistors, you can't reliably control where electrons go with silicon because of something called quantum tunneling. I was hoping someone could shed light onto why that is.",
      "author": "Veridically_",
      "created_utc": 1748627767,
      "upvotes": 270,
      "upvote_ratio": 0.9,
      "num_comments": 75,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kzaurr/eli5_why_does_quantum_tunneling_happen_when_youre/"
    },
    {
      "id": "1kz47me",
      "title": "ELI5: Why does a degraded battery cause your phone to swell up?",
      "content": "It’s been 4 years since I bought this iPhone and it says my battery max capacity is 60%. The phone basically stopped working and I was forced to replace the battery. However I noticed that my phone was so swollen that the screen was practically coming off. I was looking for some insight how an old battery could cause that . ",
      "author": "flatbushz7",
      "created_utc": 1748611663,
      "upvotes": 183,
      "upvote_ratio": 0.87,
      "num_comments": 51,
      "flair": "Chemistry",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kz47me/eli5_why_does_a_degraded_battery_cause_your_phone/"
    },
    {
      "id": "1kzhznp",
      "title": "ELI5: what do banks CD rates vary so much?",
      "content": "How do banks determine return rates for CDs? I've been looking at rates from different banks and almost all of them have an 18 month option that has a return at least a full percentage point higher than all of the other time periods, both the shorter and longer ones. Is something happening over the next 18 months that makes it a better deal for banks to give a higher rate for that timeframe?",
      "author": "coffeeKT",
      "created_utc": 1748645629,
      "upvotes": 34,
      "upvote_ratio": 0.7,
      "num_comments": 15,
      "flair": "Economics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kzhznp/eli5_what_do_banks_cd_rates_vary_so_much/"
    },
    {
      "id": "1kywyns",
      "title": "ELi5: why can 2.4 GHZ waves perform seemingly contradictory acts of bouncing of walls better and yet also penetrating walls better than 5 GHZ waves?",
      "content": "\nEdit: I don’t understand how a 2.4ghz wave can bounce off better yet simultaneously penetrate better; isn’t that contradictory?! \n\nAlso not sure if I’m conflating “bouncing off wall” with “bending around a wall” - heck I don’t even understand what it would mean for a wave to “bend around a wall”!\n\nThanks so much h!\n",
      "author": "Successful_Box_1007",
      "created_utc": 1748585288,
      "upvotes": 494,
      "upvote_ratio": 0.89,
      "num_comments": 104,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kywyns/eli5_why_can_24_ghz_waves_perform_seemingly/"
    },
    {
      "id": "1kzen8x",
      "title": "ELI5: Dog training commands with food",
      "content": "So if we can train dogs with treats to create positive association with certain commands/behavior how do those commands keep working as we phase out treats? \nLike, you don't just give a dog a treat every time they obey forever and ever, right? \nSo why don't dogs learn to \"ignore\" our commands when its been a month or year or 3 years after the initial training and the treats stop coming? ",
      "author": "YotwsohSM",
      "created_utc": 1748637065,
      "upvotes": 28,
      "upvote_ratio": 0.68,
      "num_comments": 39,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kzen8x/eli5_dog_training_commands_with_food/"
    },
    {
      "id": "1kz4q0b",
      "title": "ELI5: I am bit confused about how observation works in quantum physics. Is there is a difference between human observing something and a machine or tool measuring it? Does the universe care who's doing the observation?",
      "content": "I've been reading about quantum experiments like the double-slit, and it keeps mentioning observation collapsing the wavefunction. But I can't tell if that means human consciousness is required, or if any measuring device is enough. Just trying to understand if there's actually a difference between us watching and tools recording. ",
      "author": "OkAccess6128",
      "created_utc": 1748613008,
      "upvotes": 51,
      "upvote_ratio": 0.75,
      "num_comments": 67,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kz4q0b/eli5_i_am_bit_confused_about_how_observation/"
    },
    {
      "id": "1kylk1i",
      "title": "ELI5: How do belts in automobile cvts grip the pulleys and create torque given that they lack teeth as in gearbox transmissions?",
      "content": null,
      "author": "Content_Preference_3",
      "created_utc": 1748551155,
      "upvotes": 209,
      "upvote_ratio": 0.9,
      "num_comments": 77,
      "flair": "Engineering",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kylk1i/eli5_how_do_belts_in_automobile_cvts_grip_the/"
    },
    {
      "id": "1kyd570",
      "title": "ELI5 What happens to the plastic tape etc when cardboard is recycled",
      "content": "ELI5",
      "author": "fuzzypants7",
      "created_utc": 1748531154,
      "upvotes": 245,
      "upvote_ratio": 0.9,
      "num_comments": 50,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kyd570/eli5_what_happens_to_the_plastic_tape_etc_when/"
    },
    {
      "id": "1kxytj8",
      "title": "ELI5 Why don't we call the same number \"billion\" all over the world?",
      "content": "I’m from Argentina, and here a billion is 1.000.000.000.000, like one million millions (I don’t know if that make sense in English). In the other hand, I know that in USA a billion is 1.000.000.000, what we call one thousand millions.\nWhy does this happen? Which form predominates in the rest of the countries? ",
      "author": "WinSevere7304",
      "created_utc": 1748483280,
      "upvotes": 1538,
      "upvote_ratio": 0.93,
      "num_comments": 391,
      "flair": "Mathematics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kxytj8/eli5_why_dont_we_call_the_same_number_billion_all/"
    },
    {
      "id": "1kyfpnn",
      "title": "ELI5 When you post/mail something to another country, how does the recipient's country's postal service cover the cost of local delivery?",
      "content": "I'm talking about public national postal services, NOT corporations like UPS, DHL, or FedEx. For example if I post something to my mum and dad, does the United States Postal Service reimburse Pos Malaysia for sending it from the port of entry to my parents, or does Pos Malaysia just have to take it as a loss? ",
      "author": "DogsFolly",
      "created_utc": 1748537291,
      "upvotes": 86,
      "upvote_ratio": 0.85,
      "num_comments": 23,
      "flair": "Economics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kyfpnn/eli5_when_you_postmail_something_to_another/"
    },
    {
      "id": "1kyck93",
      "title": "ELI5 how do we know the shape of a molecule?",
      "content": "I am in the final year of highschool and we were doing SN2 reactions in organic chem and the teacher said that the molecule inverts its shape in that kind of reaction then I hit me.. how the hell do we know the shape of a molecule if it's so tiny?\n\n\nHELP!!",
      "author": "Historical-Brick-425",
      "created_utc": 1748529763,
      "upvotes": 87,
      "upvote_ratio": 0.87,
      "num_comments": 25,
      "flair": "Chemistry",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kyck93/eli5_how_do_we_know_the_shape_of_a_molecule/"
    },
    {
      "id": "1kxuk9c",
      "title": "ELI5: Why don’t fighter jets have angled guns?",
      "content": "As far as I understand, when dogfighting planes try to get their nose up as much as possible to try and hit the other plane without resorting to a cobra. I’ve always wondered since I was a kid, why don’t they just put angled guns on the planes? Or guns that can be manually angled up/down a bit? Surely there must be a reason as it seems like such a simple solution?\n\nOfc I understand that dogfighting is barely a thing anymore, but I have to know!",
      "author": "NahuM8s",
      "created_utc": 1748471329,
      "upvotes": 1686,
      "upvote_ratio": 0.92,
      "num_comments": 360,
      "flair": "Engineering",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kxuk9c/eli5_why_dont_fighter_jets_have_angled_guns/"
    },
    {
      "id": "1kyqu4r",
      "title": "ELI5: what is quantum material, what constitutes something being quantum, and what makes quantum research significant?",
      "content": "I’ve tried to read about it online, but I feel like I keep running into another thing I don’t quite get - so I turn to you guys! Thanks in advance ",
      "author": "rayyxx",
      "created_utc": 1748565233,
      "upvotes": 13,
      "upvote_ratio": 0.63,
      "num_comments": 26,
      "flair": "Planetary Science",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kyqu4r/eli5_what_is_quantum_material_what_constitutes/"
    },
    {
      "id": "1ky2eq5",
      "title": "ELI5: Despite declining population why do property prices rise in countries like Japan?",
      "content": "Japan's population is under decline for some time. However, property prices seems to be rising. Is it due to purchases by foreigners?",
      "author": "1z4e5",
      "created_utc": 1748494843,
      "upvotes": 231,
      "upvote_ratio": 0.83,
      "num_comments": 92,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ky2eq5/eli5_despite_declining_population_why_do_property/"
    },
    {
      "id": "1kxpc1e",
      "title": "ELI5 What are pimple puss made of?",
      "content": "You know how when you pop pimple u get white goo of pus? What are those made of? Are they bacteria? And sometimes when you squeeze too much some kind clear liquid comes out, what are those?",
      "author": "KaleidoscopeDue4603",
      "created_utc": 1748458693,
      "upvotes": 1062,
      "upvote_ratio": 0.85,
      "num_comments": 190,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kxpc1e/eli5_what_are_pimple_puss_made_of/"
    },
    {
      "id": "1kxobdr",
      "title": "ELI5 Why doesn't our ancestry expand exponentially?",
      "content": "We come from 2 parents, and they both had 2 parents, making 4 grandparents who all had 2 parents. Making 8 Great Grandparents, and so on. \n\nIf this logic continues, you wind up with about a quadrillion genetic ancestors in the 9th century, if the average generation is 20 years (2 to the power of 50 for 1000 years) \n\nWhen googling this idea you will find the idea of pedigree collapse. But I still don't really get it. Is it truly just incest that caps the number of genetic ancestors? I feel as though I need someone smarter than me to dumb down the answer to why our genetic ancestors don't multiply exponentially. Thanks!\n\nP.S. what I wrote is basically napkin math so if my numbers are a little wrong forgive me, the larger question still stands.\n\nEdit: I see some replies that say \"because there aren't that many people in the world\" and I forgot to put that in the question, but yeah. I was more asking how it works. Not literally why it doesn't work that way. I was just trying to not overcomplicate the title.\n Also when I did some very basic genealogy of my own my background was a lot more varied than I expected, and so it just got me thinking. I just thought it was an interesting question and when I posed it to my friends it led to an interesting conversation.",
      "author": "pjpsamson",
      "created_utc": 1748456263,
      "upvotes": 950,
      "upvote_ratio": 0.87,
      "num_comments": 429,
      "flair": "Mathematics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kxobdr/eli5_why_doesnt_our_ancestry_expand_exponentially/"
    },
    {
      "id": "1kybqju",
      "title": "ELI5: Why do some allergies get worse the more you're exposed to them(like poison ivy), but some get better through exposure and exposure therapy is used to desensitize to some allergies and works?",
      "content": null,
      "author": "ArtistAmy420",
      "created_utc": 1748527730,
      "upvotes": 26,
      "upvote_ratio": 0.75,
      "num_comments": 13,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kybqju/eli5_why_do_some_allergies_get_worse_the_more/"
    },
    {
      "id": "1kyab1v",
      "title": "ELI5 - How do flood waters stay high for so long around a river mouth/harbour?",
      "content": "I’m in regional NSW Australia and we just had a week of torrential rain leading to lots of flooding.\n\nWe have a lot of rivers, and I don’t understand riverine flooding well enough and can easily see the peaks as they travel downstream.\n\nWhat I don’t understand is what is happening at the end of the flow. I drive over a bridge ~3km inland from the mouth of the harbour (Newcastle if you’re curious), and the mangroves and swampland still seem very swollen with trees barely above water. \n\nThis close to the ocean id have thought after 5 days since the rains eased that it would be dropping there.\n\nIs it that the force and swell of the ocean pushing against the river acts like a wall, only letting waters out slowly? Or is it simply still the volume of water coming downstream being more than can be let out to the ocean? Or a combination or something else completely?",
      "author": "PrideKnight",
      "created_utc": 1748523951,
      "upvotes": 15,
      "upvote_ratio": 0.75,
      "num_comments": 10,
      "flair": "Planetary Science",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kyab1v/eli5_how_do_flood_waters_stay_high_for_so_long/"
    },
    {
      "id": "1ky2npe",
      "title": "ELI5: Why are some tastes slow and some tastes fast?",
      "content": "If I taste a meat, or a salty sauce or chip, the flavour is immediate, but with other things, like fruit juice or certain vegetables for example, I can almost get the food swallowed before the real flavour kicks in. How do certain foods have tastes that don't hit you immediately?",
      "author": "Creepercraft110",
      "created_utc": 1748495740,
      "upvotes": 53,
      "upvote_ratio": 0.81,
      "num_comments": 7,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ky2npe/eli5_why_are_some_tastes_slow_and_some_tastes_fast/"
    },
    {
      "id": "1kxcltz",
      "title": "ELI5: Why is it more efficient to turn on the AC unit for a long time than switching it on/off per use?",
      "content": "In my mind, leaving the AC unit on for long costs more electricity and money than just turning it off when not in use. I can't grasp the idea of the former being more cost- and energy-efficient than the latter.\n\nEDIT: Thank you everyone for your answers. It seems that this topic is quite debated over. I will try to do my own research regarding this.",
      "author": "Critical_Resort_3670",
      "created_utc": 1748423904,
      "upvotes": 1634,
      "upvote_ratio": 0.91,
      "num_comments": 548,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kxcltz/eli5_why_is_it_more_efficient_to_turn_on_the_ac/"
    },
    {
      "id": "1kxtmf6",
      "title": "ELI5: How come beetroot colour can survive a trip through the colon when most food dyes cant?",
      "content": "I pooped and it was red, thankfully due to a beet or few the night before! How does this colour manage not to be broken down by the digestion process? ",
      "author": "Lancs_wrighty",
      "created_utc": 1748468924,
      "upvotes": 140,
      "upvote_ratio": 0.87,
      "num_comments": 36,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kxtmf6/eli5_how_come_beetroot_colour_can_survive_a_trip/"
    },
    {
      "id": "1ky136f",
      "title": "ELI5 why modern games need shader precompilation stage compared to old games",
      "content": "How complicated are modern shaders in games?\n\nI’ve gotten back into gaming after a few years of barely touching a PC and I’m noticing that so many games force me to precompile shaders before loading the game in any way. Split fiction, Marvel Rivals, cod, so many of the modern titles have this and it sometimes gets annoying. I can run up plenty of older games that have comparable or even up to par looking graphics compared to say Marvel Rivals, and it loads the game just fine without needing that pre-loading stage. How much more complex could it be that it requires a whole new stage just to get them ready? Shouldn’t our modern tech be even more efficient in doing these tasks? Why do developers do this? Is this out of laziness? Lack of funding? ",
      "author": "Bentendo24",
      "created_utc": 1748490296,
      "upvotes": 37,
      "upvote_ratio": 0.71,
      "num_comments": 42,
      "flair": "Engineering",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ky136f/eli5_why_modern_games_need_shader_precompilation/"
    },
    {
      "id": "1kxzfhg",
      "title": "ELI5: How is manufacturing equipment created and maintained?",
      "content": "Pretty much every product that I deal with day-to-day (except produce) was mass-produced in a factory.  If it needs to be serviced, it's done using parts created in a factory with mass-produced tools and equipment also made in a factory somewhere.\n\nIf I look at stuff being made in those factories though - It's a bunch of guides and rollers, machines moving around, nozzles, heaters, and a bunch of other stuff that is super specific, like machines to push down the metal caps down on to glass bottles.\n\nWhere do they get THAT from? Are there other companies that make those components? Do they contract other companies to fabricate the things they need? Do they have their own departments to make it themselves? What happens when some custom thing they have at the factory breaks and they need someone to service it?\n\n",
      "author": "ParsingError",
      "created_utc": 1748485097,
      "upvotes": 44,
      "upvote_ratio": 0.78,
      "num_comments": 50,
      "flair": "Engineering",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kxzfhg/eli5_how_is_manufacturing_equipment_created_and/"
    },
    {
      "id": "1kxzjk3",
      "title": "ELI5 What happens during radiation treatment?",
      "content": "I'm currently going through radiation treatment for breast cancer and every single day I lay there and wonder what the hell is happening. I guess my question is two-fold: how does radiation treatment worked to treat cancer and also how does the machine I am laying in create a beam of radiation to specifically target my chest wall?",
      "author": "randompotato11",
      "created_utc": 1748485438,
      "upvotes": 35,
      "upvote_ratio": 0.86,
      "num_comments": 20,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kxzjk3/eli5_what_happens_during_radiation_treatment/"
    },
    {
      "id": "1kxcvi0",
      "title": "eli5: how do animals in ocean parks do not prey on one another?",
      "content": "Since ocean parks are designed to be like an ecosystem for each life to live as they were in the wild, how come that they do not prey on the smaller species? ",
      "author": "bear-in-the-city22",
      "created_utc": 1748424996,
      "upvotes": 653,
      "upvote_ratio": 0.93,
      "num_comments": 65,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kxcvi0/eli5_how_do_animals_in_ocean_parks_do_not_prey_on/"
    },
    {
      "id": "1kxg7iu",
      "title": "ELI5 What's an example of a triple bluff in a context other than poker?",
      "content": "I understand bluffs and double bluffs but if a bluff and triple bluff have the same outcome, how are they different?",
      "author": "Any-Display-7599",
      "created_utc": 1748436484,
      "upvotes": 256,
      "upvote_ratio": 0.85,
      "num_comments": 96,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kxg7iu/eli5_whats_an_example_of_a_triple_bluff_in_a/"
    },
    {
      "id": "1kwuo2n",
      "title": "ELi5: why do girls go into puberty so young when pregnancy for them would be unsafe and lead to poor outcomes?",
      "content": "Ignore the social and legal aspects of this. My interests in this are purely from a biological and  evolutionary perspective. If a girl started puberty at 10 and was to hypothetically get pregnant at 12, which leads to poor outcomes for both. What is the point in girls starting puberty at 10? Why not start it at 16, when it is much safer and lead to better outcomes? It seems like an evolutionary flaw. ",
      "author": "DoctorMobius21",
      "created_utc": 1748370153,
      "upvotes": 8763,
      "upvote_ratio": 0.9,
      "num_comments": 1949,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kwuo2n/eli5_why_do_girls_go_into_puberty_so_young_when/"
    },
    {
      "id": "1kxyz09",
      "title": "ELI5: Why are the dangers of electromagnetic radiation more associated higher frequency and not higher amplitude?",
      "content": null,
      "author": "MassiveWay3164",
      "created_utc": 1748483730,
      "upvotes": 21,
      "upvote_ratio": 0.74,
      "num_comments": 25,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kxyz09/eli5_why_are_the_dangers_of_electromagnetic/"
    },
    {
      "id": "1kxni9v",
      "title": "ELI5 How do we have ANY fossil record of single celled organisms?",
      "content": "It seems like biologists are confident about a time period in which only single-cell life was found on the planet, and that this was the case for a very, very long time. How do we have evidence that that life from this period existed at all? What is being preserved? At that scale, how can we distinguish a fossil from just...a tiny bubble?",
      "author": "Lukematikk",
      "created_utc": 1748454364,
      "upvotes": 77,
      "upvote_ratio": 0.8,
      "num_comments": 26,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kxni9v/eli5_how_do_we_have_any_fossil_record_of_single/"
    },
    {
      "id": "1kxlxvy",
      "title": "ELI5 why do electrons and protons have equal charges?",
      "content": "i know they’re opposite and equal, but why exactly is that? or is this one of those fundamentals questions that doesn’t really have an answer?",
      "author": "Connect-Violinist-30",
      "created_utc": 1748450652,
      "upvotes": 84,
      "upvote_ratio": 0.81,
      "num_comments": 51,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kxlxvy/eli5_why_do_electrons_and_protons_have_equal/"
    },
    {
      "id": "1kxnyuj",
      "title": "ELI5: How does being “cold blooded” work?",
      "content": "I never quite understood this. If you owned a lizard or a frog, kept it in a cage in your living room, and forgot to turn the heat on during winter, would it just die?\n\nWith that said, how do cold blooded animals exist in places with 4 seasons? Seems to me that the slightest variation in temperature change could be catastrophic. In humans, if your core body temp goes even 2 or 3 degrees below or above normal, you could die within hours or minutes. \n\nHow does a toad handle being outside when it’s 40 degrees f in the morning then jumps up to 90f in the afternoon?",
      "author": "papiforyou",
      "created_utc": 1748455440,
      "upvotes": 50,
      "upvote_ratio": 0.71,
      "num_comments": 32,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kxnyuj/eli5_how_does_being_cold_blooded_work/"
    },
    {
      "id": "1kxkvmd",
      "title": "ELI5 GUYS can you explain sleepwalking or like how it even happens",
      "content": "long story short i remember goin to sleep at like late 1am or early 2am last night and my mom asked me recently today why was i standing in her doorway last night, and i was like i dont remember that and she goes on to say that i was just standing there and my eyes were open and i do not recall that ever happening because i was sleep before 3am which is the time she said she saw me, im kind of creeped out by this because its never happened before.",
      "author": "Ambitious-Mistake-91",
      "created_utc": 1748448140,
      "upvotes": 49,
      "upvote_ratio": 0.66,
      "num_comments": 41,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kxkvmd/eli5_guys_can_you_explain_sleepwalking_or_like/"
    },
    {
      "id": "1kxtpm5",
      "title": "ELI5 WHY/HOW does prednisone increase appetite?",
      "content": "I was on a very large dose of prednisone as a child for a prolonged period, and I remember being constantly hungry. I've tried researching what was going on internally - like what receptors and whatnot were being triggered, but I can't find any info beyond \"prednisone increases appetite\" - so could anyone ELI5 what the mechanisms are that lead to prednisone inducing appetite?",
      "author": "RobinSavannahCarver",
      "created_utc": 1748469145,
      "upvotes": 9,
      "upvote_ratio": 0.62,
      "num_comments": 10,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kxtpm5/eli5_whyhow_does_prednisone_increase_appetite/"
    },
    {
      "id": "1kxvf82",
      "title": "ELI5 Why do some countries have an artificial value on their currency?",
      "content": "For context I live in Bolivia and we're undergoing some economic hardships. The international value of the boliviano (compared to USD) has gone from 7 to 21 in under a year. However, the government has maintained an official exchange rate of 6.96. The same thing happened in Argentina in the past with the blue dollar.\n\nApart from just burying their heads in the sand and refusing to acknowledge the problem, why do governments do this?",
      "author": "MobileManager6757",
      "created_utc": 1748473605,
      "upvotes": 5,
      "upvote_ratio": 0.58,
      "num_comments": 14,
      "flair": "Economics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kxvf82/eli5_why_do_some_countries_have_an_artificial/"
    },
    {
      "id": "1kxsb9k",
      "title": "ELI5 How exactly do gyro gunsights and radar gunsights work on fighter aircraft?",
      "content": "I've seen gyro and radar gunsights in video games, combat footage and training videos but that is about it. \n\nI saw in wikipedia that gyros calculate target lead and ballistic trajectory and some other source I forgot that radar gunsights do the same but also calculate position, velocity and acceleration. I could be wrong about some stuff here I don't know.",
      "author": "ihaveabehelit",
      "created_utc": 1748465762,
      "upvotes": 7,
      "upvote_ratio": 0.69,
      "num_comments": 7,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kxsb9k/eli5_how_exactly_do_gyro_gunsights_and_radar/"
    },
    {
      "id": "1kwu86a",
      "title": "ELI5 being as energy can never be created or destroyed, is there a limit to wind power? Could we ever just like \"use\" all the wind?",
      "content": null,
      "author": "AceBv1",
      "created_utc": 1748369120,
      "upvotes": 317,
      "upvote_ratio": 0.78,
      "num_comments": 155,
      "flair": "Planetary Science",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kwu86a/eli5_being_as_energy_can_never_be_created_or/"
    },
    {
      "id": "1kwvjwz",
      "title": "ELI5 the optimization of a video game.",
      "content": "I've been a gamer since I was 16. I've always had a rough idea of how video games were optimized but never really understood it. \n\nThanks in advance for your replies! ",
      "author": "spartanb301",
      "created_utc": 1748372228,
      "upvotes": 151,
      "upvote_ratio": 0.85,
      "num_comments": 95,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kwvjwz/eli5_the_optimization_of_a_video_game/"
    },
    {
      "id": "1kx1q6z",
      "title": "ELI5: How do people survive explosions like this?",
      "content": "I’m always surprised when I see videos or read about explosions like this and learn no one died. Seems to happen fairly often with gas leaks in houses. I’d there something about gas explosions that makes them survivable? https://abc7chicago.com/amp/post/truck-explosion-addison-illinois-cleanup-continues-propane-tank-wood-dale-road-lake-street/16541290/",
      "author": "Legitimate_Item_6763",
      "created_utc": 1748387239,
      "upvotes": 51,
      "upvote_ratio": 0.76,
      "num_comments": 14,
      "flair": "Chemistry",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kx1q6z/eli5_how_do_people_survive_explosions_like_this/"
    },
    {
      "id": "1kw78sl",
      "title": "ELI5: Why is a grenade more dangerous underwater than on land?",
      "content": "I was always under the impression that being underwater reduces the impact of a blast but I just read that a grenade explosion is more likely to be fatal underwater . ",
      "author": "flatbushz7",
      "created_utc": 1748297913,
      "upvotes": 3411,
      "upvote_ratio": 0.94,
      "num_comments": 373,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kw78sl/eli5_why_is_a_grenade_more_dangerous_underwater/"
    },
    {
      "id": "1kwnbzp",
      "title": "ELI5: What happens when lightning strikes the ocean or other large body of water?",
      "content": "Or what happens to living things that are in the water around the lightning? How far does the lightning get dispersed? How far away would someone have to be from the strike to not get electrocuted?",
      "author": "JetKusanagi",
      "created_utc": 1748352671,
      "upvotes": 188,
      "upvote_ratio": 0.91,
      "num_comments": 47,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kwnbzp/eli5_what_happens_when_lightning_strikes_the/"
    },
    {
      "id": "1kwqh2x",
      "title": "ELI5: How can a lighting split a tree when it is just electricity and not solid?",
      "content": "How is it possible for a lighting to break something when it is not solid or physical(might not Be The right word but something you can touch)?",
      "author": "Lego_city_undercover",
      "created_utc": 1748360410,
      "upvotes": 106,
      "upvote_ratio": 0.75,
      "num_comments": 73,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kwqh2x/eli5_how_can_a_lighting_split_a_tree_when_it_is/"
    },
    {
      "id": "1kwxl76",
      "title": "ELI5 How does super glue actually work?",
      "content": null,
      "author": "ElectricalDiamond136",
      "created_utc": 1748376969,
      "upvotes": 46,
      "upvote_ratio": 0.75,
      "num_comments": 21,
      "flair": "Chemistry",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kwxl76/eli5_how_does_super_glue_actually_work/"
    },
    {
      "id": "1kwzi7f",
      "title": "ELI5: The difference between HMO and PPO",
      "content": "Help! I’m 25 and trying to get insurance on my own for the first time. I don’t understand which one is better or health insurance at all! ",
      "author": "SpecialistYoghurt997",
      "created_utc": 1748381524,
      "upvotes": 23,
      "upvote_ratio": 0.73,
      "num_comments": 33,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kwzi7f/eli5_the_difference_between_hmo_and_ppo/"
    },
    {
      "id": "1kwb366",
      "title": "ELI5 - Why can't rats throw up?",
      "content": "I know they can't, as that's the entire reason that rat poison works. But do they just not have a gag reflex? What makes it possible anatomically for an organism to throw up, and what is it that rats are missing to be able to do that?",
      "author": "Much-Card3000",
      "created_utc": 1748309149,
      "upvotes": 904,
      "upvote_ratio": 0.93,
      "num_comments": 87,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kwb366/eli5_why_cant_rats_throw_up/"
    },
    {
      "id": "1kwjf7j",
      "title": "ELI5: explain how we know that isotopes that have half lives of millions of years will actually take millions of years",
      "content": null,
      "author": "THP801",
      "created_utc": 1748340050,
      "upvotes": 144,
      "upvote_ratio": 0.85,
      "num_comments": 58,
      "flair": "Chemistry",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kwjf7j/eli5_explain_how_we_know_that_isotopes_that_have/"
    },
    {
      "id": "1kwci9f",
      "title": "ELI5 why do so many shower mixers only have a very narrow range for a comfortable water temperature?",
      "content": "Seems like every shower mixer I have encountered has a huge dial, \"cold-warm-hot\", but actually there's only a tiny area where the water isn't either freezing cold or unbearably hot. Worse are those ones with a lever jutting out to control the water volume, just one little nudge is enough to suddenly make the mixer jump from one zone to the other. \n\nThe number of times I have had shampoo or soap in my eyes, accidentally bumped the mixer and then had to desperately try to reset the mixer is uncountable. In my present house the mixer has such a narrow range that I need to use both hands on either side to give it a tiny precision turn, otherwise its far too easy to get scolding water or a deluge of ice water.\n\nThis situations seems so common, I have heard so many others complain about it too. Yet surely just installing a properly made mixer according to the house's water pressure and plumbing should not be rocket science? ",
      "author": "Kathyamoldd",
      "created_utc": 1748313550,
      "upvotes": 554,
      "upvote_ratio": 0.9,
      "num_comments": 136,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kwci9f/eli5_why_do_so_many_shower_mixers_only_have_a/"
    },
    {
      "id": "1kwmtl7",
      "title": "ELI5 - What exactly is a \"consent decree\"?",
      "content": "Tried reading about it online and no further closer to an understandable answer.",
      "author": "BryTupper",
      "created_utc": 1748351282,
      "upvotes": 53,
      "upvote_ratio": 0.8,
      "num_comments": 17,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kwmtl7/eli5_what_exactly_is_a_consent_decree/"
    },
    {
      "id": "1kvue3i",
      "title": "ELI5 How does my dog \"make\" himself heavy when he doesn't want to be picked up?",
      "content": "So my boy is just shy of 50 lbs and is normally fairly easy to pick up. But when he doesn't want to move it seems as if he increases his weight 10 fold. I know that's not actually happening so what mechanism makes him so much harder to pick up when he does that",
      "author": "fenwayb",
      "created_utc": 1748266177,
      "upvotes": 2883,
      "upvote_ratio": 0.94,
      "num_comments": 186,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kvue3i/eli5_how_does_my_dog_make_himself_heavy_when_he/"
    },
    {
      "id": "1kwkp1y",
      "title": "ELI5:How can a fall kill someone who’s elderly? Vs. someone in normal health could easily recover from?",
      "content": null,
      "author": "23cgc",
      "created_utc": 1748344728,
      "upvotes": 41,
      "upvote_ratio": 0.65,
      "num_comments": 64,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kwkp1y/eli5how_can_a_fall_kill_someone_whos_elderly_vs/"
    },
    {
      "id": "1kwc9wp",
      "title": "ELI5: Why can the human body cause a fever so high that our organs fail?",
      "content": "I know that a fever is our way of fight off sickness but why can it heat it’s self up enough to practically self-destruct",
      "author": "Big-doggo_",
      "created_utc": 1748312819,
      "upvotes": 210,
      "upvote_ratio": 0.85,
      "num_comments": 37,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kwc9wp/eli5_why_can_the_human_body_cause_a_fever_so_high/"
    },
    {
      "id": "1kwd70w",
      "title": "ELI5 How did Greece go bankrupt? Or a country in general. And how did it affect it’s people",
      "content": "I’ve always heard that they declared bankruptcy but is there a specific reason? And why wasn’t prevented and what was the fallout",
      "author": "Psychological-Ad2145",
      "created_utc": 1748315757,
      "upvotes": 94,
      "upvote_ratio": 0.8,
      "num_comments": 39,
      "flair": "Economics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kwd70w/eli5_how_did_greece_go_bankrupt_or_a_country_in/"
    },
    {
      "id": "1kvwygw",
      "title": "ELI5 Is there a point at which increasing the size of a computer will not make it more powerful and if so, why?",
      "content": "I'm just curious if you could theoretically always add components in the proper ratio to a computer to make it faster or if that would either stop working altogether or you would see rapid decreases in marginal efficiency. If constraints outside of pure economics exist, what are they? \n\nEdit: Like if you could just Minecraft creative mode style spawn from the ether any kind or quantity of computer component as long as it is currently in existence and had no limit to how big you were allowed to build it would it just get more and more powerful as you add to it",
      "author": "CroutonLover4478",
      "created_utc": 1748272682,
      "upvotes": 536,
      "upvote_ratio": 0.89,
      "num_comments": 127,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kvwygw/eli5_is_there_a_point_at_which_increasing_the/"
    },
    {
      "id": "1kvwj58",
      "title": "ELI5: Why does the upper Midwest region in the US have so many amusement parks despite being seasonal?",
      "content": "Compared to its general seasonal climate and the challenges that creates it seems like the northern interior eastern states in the us have a large number of well known theme parks per capita: Kings Island, cedar point, Hershey park, kennywood, etc etc     This climate is quite seasonal compared to the southern and western us but it seems that the park numbers are high despite the challenge.  ESP compared to more favorable climate areas of the US. \n",
      "author": "Content_Preference_3",
      "created_utc": 1748271642,
      "upvotes": 461,
      "upvote_ratio": 0.91,
      "num_comments": 155,
      "flair": "Economics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kvwj58/eli5_why_does_the_upper_midwest_region_in_the_us/"
    },
    {
      "id": "1kvyv9e",
      "title": "ELI5: Why haven’t hydrogen powered vehicles taken off?",
      "content": "To the best of my understanding the exhaust from hydrogen cars is (technically, not realistically) drinkable water. So why haven’t they taken off sales wise like ev’s have?",
      "author": "randumbnumbers",
      "created_utc": 1748277327,
      "upvotes": 338,
      "upvote_ratio": 0.81,
      "num_comments": 274,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kvyv9e/eli5_why_havent_hydrogen_powered_vehicles_taken/"
    },
    {
      "id": "1kvykt1",
      "title": "ELI5 why do some potato chips have green edges that taste nasty?",
      "content": null,
      "author": "outsideskyy",
      "created_utc": 1748276624,
      "upvotes": 147,
      "upvote_ratio": 0.74,
      "num_comments": 54,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kvykt1/eli5_why_do_some_potato_chips_have_green_edges/"
    },
    {
      "id": "1kvcu8m",
      "title": "ELI5: How is blackjack \"rigged\" for the casino?",
      "content": "If you play with the same rules as the dealer, shouldn't your wins be roughly the same as the casino?\n\nAdditionally how does multiple decks affect those winnings for the player and the casino?\n\nThank you :)\n\n(I added NSFW as it involves gambling, unsure if this is required)",
      "author": "BlalkeM",
      "created_utc": 1748206523,
      "upvotes": 5464,
      "upvote_ratio": 0.92,
      "num_comments": 862,
      "flair": "Mathematics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kvcu8m/eli5_how_is_blackjack_rigged_for_the_casino/"
    },
    {
      "id": "1kwav94",
      "title": "ELI5: Why are lithium and beryllium so rare, despite having a relatively simple atomic structure?",
      "content": "Some elements that have a more complex atomic structure are more common than them, like oxygen, carbon and iron for example",
      "author": "Idontknowofname",
      "created_utc": 1748308458,
      "upvotes": 29,
      "upvote_ratio": 0.7,
      "num_comments": 23,
      "flair": "Chemistry",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kwav94/eli5_why_are_lithium_and_beryllium_so_rare/"
    },
    {
      "id": "1kvp3d7",
      "title": "ELI5: children mastering chess??",
      "content": "how can children and toddlers be so amazing at chess even though it's such a tactical and strategic game? it's such a common occurrence too, is it just that they hyper fixate on it so much?",
      "author": "Zealousideal-Ad-7839",
      "created_utc": 1748247169,
      "upvotes": 459,
      "upvote_ratio": 0.83,
      "num_comments": 113,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kvp3d7/eli5_children_mastering_chess/"
    },
    {
      "id": "1kvwraq",
      "title": "ELI5: Why does the world appear blueish after closing your eyes for a little while on a bright day?",
      "content": null,
      "author": "fugomert",
      "created_utc": 1748272186,
      "upvotes": 61,
      "upvote_ratio": 0.82,
      "num_comments": 8,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kvwraq/eli5_why_does_the_world_appear_blueish_after/"
    },
    {
      "id": "1kvkp6b",
      "title": "ELI5: How do competitive drinkers like Badlandschugs not get water intoxication when chugging large amounts of fluid in such a short amount of time?",
      "content": null,
      "author": "Still-Mistake-3621",
      "created_utc": 1748230745,
      "upvotes": 338,
      "upvote_ratio": 0.92,
      "num_comments": 46,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kvkp6b/eli5_how_do_competitive_drinkers_like/"
    },
    {
      "id": "1kvz61j",
      "title": "ELI5: weight loss and loose skin",
      "content": "When overweight people loose weight and get smaller there’s excess skin that has to be removed surgically. \n\nBut when normal weight or skinny people loose 5-10 kg there’s no access skin. \n\nWhy is that? ",
      "author": "WebBorn2622",
      "created_utc": 1748278058,
      "upvotes": 23,
      "upvote_ratio": 0.61,
      "num_comments": 32,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kvz61j/eli5_weight_loss_and_loose_skin/"
    },
    {
      "id": "1kvspu9",
      "title": "ELI5: What’s the difference between a bay and a gulf?",
      "content": "I can’t ",
      "author": "Outrageous_Land8828",
      "created_utc": 1748261259,
      "upvotes": 46,
      "upvote_ratio": 0.71,
      "num_comments": 26,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kvspu9/eli5_whats_the_difference_between_a_bay_and_a_gulf/"
    },
    {
      "id": "1kvfk7c",
      "title": "Eli5: how do baseball pitchers throw faster than their cricket counterparts?",
      "content": "Cricket players have a running start and still throw the ball slower on average compared to baseball where balls are thrown from a standstill. ",
      "author": "devsterl",
      "created_utc": 1748214127,
      "upvotes": 380,
      "upvote_ratio": 0.86,
      "num_comments": 100,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kvfk7c/eli5_how_do_baseball_pitchers_throw_faster_than/"
    },
    {
      "id": "1kvk0ma",
      "title": "ELI5: Why does a pot of water make noise for a couple minutes before it starts boiling?",
      "content": null,
      "author": "ColoradoScoop",
      "created_utc": 1748228453,
      "upvotes": 179,
      "upvote_ratio": 0.85,
      "num_comments": 33,
      "flair": "Chemistry",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kvk0ma/eli5_why_does_a_pot_of_water_make_noise_for_a/"
    },
    {
      "id": "1kvxxi9",
      "title": "ELI5 Why do we even procrastinate? What is the science behind it?",
      "content": "Why most of us procrastinate?\n\nOne week later, I have an exam - the syllabus is huge, and I have not even started (this is my scenario in every test)... But why is this scenario?\n\nI don't take action; I just pretend to take action.\n\nEvery day I think of starting my day and not waste a single minute.... At the middle of the day, I have wasted almost the whole day... And in the rest half of the day, I plan how will I utilize my other day...\n\nIn that other half, I make strict timetables, watch books summary, watch motivational videos, etc...  \nYes, I am writing this post in that half of the day - where I am regretting and thinking of starting new tomorrow....\n\nThis is the typical scenario, until the exam day...\n\nDuring the exam's morning too - I procrastinate - thinking that I will do worse in this exam, but will do the comeback in next exam... But again, the scenario repeats...\n\nEven in exams too - I think - why does this even matter? Can a piece of paper decide my future?, etc...\n\nBefore every exam, I make cheats... I procrastinate in that too... I waste the whole night and start making cheats just one or two hours before exams...\n\nBy the help of cheats only, I am (was) able to get good grades (not ace it, but yes) in almost every tests I have given in the past - this have made my family (especially parents), friends, and close ones have high hopes from me in academic...\n\nI am currently in class 12, I am preparing for JEE (competitive exam)... I have wasted almost1.5yrs (if not more), I am sure of failing if I don't do deep work (monastic) for the remaining time (as I would have to do 2 years task in 6 months), but again I procrastinate and think of starting later...\n\nI am aware that parents have high hopes from me, cheating is not possible, this is future deciding exam, deep work is the only way of success, action taking is the only way, etc..\n\nBut at the end, I pretend to take action - by uselessly watching self-help book summaries, motivational videos, making time table, thinking of the applause I achieve the imaginary results, etc...\n\nFrom class 2, I have thought of becoming a successful tech entrepreneur by class 12 and skip college, but I have not even taken a single step - I just have written very detailed plan and pitch of the plan - but have never taken a single action..\n\nFrom class 9, I have thought of going to international colleges, I failed and had not taken a single step.\n\nI am a failure, but I am not able to change it.",
      "author": "WeightOtherwise7254",
      "created_utc": 1748275081,
      "upvotes": 7,
      "upvote_ratio": 0.59,
      "num_comments": 45,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kvxxi9/eli5_why_do_we_even_procrastinate_what_is_the/"
    },
    {
      "id": "1kvamvd",
      "title": "ELI5: how do spiders know the location they are building their webs is good for catching bugs?",
      "content": null,
      "author": "brownlawn",
      "created_utc": 1748200730,
      "upvotes": 217,
      "upvote_ratio": 0.92,
      "num_comments": 19,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kvamvd/eli5_how_do_spiders_know_the_location_they_are/"
    },
    {
      "id": "1kuv3wo",
      "title": "ELI5: Why are deli meats from the packaged section more \"slimey\" than the ones from the deli counter?",
      "content": "I noticed this when trying out different meats for sandwiches. Also, does being less slimey mean that deli counter meat is better quality/healthier?\n\nThanks!",
      "author": "Legendary_GrumpyCat",
      "created_utc": 1748151180,
      "upvotes": 1725,
      "upvote_ratio": 0.93,
      "num_comments": 153,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kuv3wo/eli5_why_are_deli_meats_from_the_packaged_section/"
    },
    {
      "id": "1kvshyt",
      "title": "ELI5: how deep can plant roots get?",
      "content": null,
      "author": "squirrellydanman",
      "created_utc": 1748260562,
      "upvotes": 6,
      "upvote_ratio": 0.63,
      "num_comments": 3,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kvshyt/eli5_how_deep_can_plant_roots_get/"
    },
    {
      "id": "1kv95n8",
      "title": "ELI5: Why are insects considered essential to the food chain if they are not present in winter and their predators feed on other things?",
      "content": null,
      "author": "Technical_Ad_4299",
      "created_utc": 1748196885,
      "upvotes": 120,
      "upvote_ratio": 0.75,
      "num_comments": 47,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kv95n8/eli5_why_are_insects_considered_essential_to_the/"
    },
    {
      "id": "1kv2vql",
      "title": "ELI5: How Do TSA Compliant Locks Work?",
      "content": "How can a lock be easily accessed by the TSA, while also being difficult to access for anyone else wanting to get in? ",
      "author": "[deleted]",
      "created_utc": 1748180638,
      "upvotes": 196,
      "upvote_ratio": 0.85,
      "num_comments": 155,
      "flair": "Engineering",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kv2vql/eli5_how_do_tsa_compliant_locks_work/"
    },
    {
      "id": "1kup4nq",
      "title": "ELI5: As a kid, all meats were cured. Today I notice the packaging touts that they are uncured. When did this reversal happen and why?",
      "content": "I recall being taught in school that things like ham were cured to prevent hunana from contractingv Trichinellosis as well as other diseases. I go buy deli meat, and the packages proudly clam it's uncured. What happened?",
      "author": "Swiggy1957",
      "created_utc": 1748130360,
      "upvotes": 2586,
      "upvote_ratio": 0.92,
      "num_comments": 415,
      "flair": "Chemistry",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kup4nq/eli5_as_a_kid_all_meats_were_cured_today_i_notice/"
    },
    {
      "id": "1kuu1v2",
      "title": "ELI5: Why are \"one\" and \"once\" the only O words that start with a \"w\" sound?",
      "content": null,
      "author": "LayeredOwlsNest",
      "created_utc": 1748147157,
      "upvotes": 1074,
      "upvote_ratio": 0.92,
      "num_comments": 209,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kuu1v2/eli5_why_are_one_and_once_the_only_o_words_that/"
    },
    {
      "id": "1kv95u1",
      "title": "ELI5 What exactly happened in the transition from non living material to life?",
      "content": "Like I know that mix in water, carbon , lightening and you got building blocks for life but what exactly happened that lead to them able to propagate.",
      "author": "EducationalMoron15",
      "created_utc": 1748196898,
      "upvotes": 63,
      "upvote_ratio": 0.77,
      "num_comments": 39,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kv95u1/eli5_what_exactly_happened_in_the_transition_from/"
    },
    {
      "id": "1kv3oid",
      "title": "ELI5- How Do Carnivores Get Balanced Nutrients",
      "content": "Humans have to eat tons of different fruits and veggies to get all of ours, so how do carnivores  eat only meat and seem to live healthy lives?",
      "author": "JewelerElectrical107",
      "created_utc": 1748182788,
      "upvotes": 113,
      "upvote_ratio": 0.83,
      "num_comments": 59,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kv3oid/eli5_how_do_carnivores_get_balanced_nutrients/"
    },
    {
      "id": "1kur66l",
      "title": "ELI5: Why is so hard to reverse engineer and steal technologies?",
      "content": "I have always wondered why countries like China don’t just reverse engineer tech and simply make their own. For example China has been trying to produce aircraft that rival Boeing or Airbus but hasn’t done so successfully. They have these aircraft in their fleet and what is stopping them from tearing them down and learning how to make it themselves?",
      "author": "MajinDawood",
      "created_utc": 1748137092,
      "upvotes": 1111,
      "upvote_ratio": 0.88,
      "num_comments": 406,
      "flair": "Engineering",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kur66l/eli5_why_is_so_hard_to_reverse_engineer_and_steal/"
    },
    {
      "id": "1kvf2m9",
      "title": "ELI5: What is “earthing” in relation to electrical circuits? Why do you need to do it, and how do you achieve it?",
      "content": "I see people referring to it a lot in videos about repairing engines and things like that - also my brother is an electrician, and I’m slightly embarrassed that I don’t know what I assume is an elementary principle of his job. \n\nEDIT: maybe I actually meant “grounding”? I know nothing about this stuff and the 2 things sounded pretty identical to me",
      "author": "jazzypurtos",
      "created_utc": 1748212689,
      "upvotes": 24,
      "upvote_ratio": 0.63,
      "num_comments": 51,
      "flair": "Engineering",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kvf2m9/eli5_what_is_earthing_in_relation_to_electrical/"
    },
    {
      "id": "1kve34b",
      "title": "ELI5 - How do scabs stay attached to the skin/wound Theyre covering? What makes them fall off when the wound is healed?",
      "content": "I assume that the scab falls off when the new skin layer underneath essentially pushes it off? But how does the scab stay on in the first place?",
      "author": "Much-Card3000",
      "created_utc": 1748209875,
      "upvotes": 22,
      "upvote_ratio": 0.71,
      "num_comments": 12,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kve34b/eli5_how_do_scabs_stay_attached_to_the_skinwound/"
    },
    {
      "id": "1kv7h8y",
      "title": "ELI5: What is entropy?",
      "content": null,
      "author": "nayarrahul",
      "created_utc": 1748192694,
      "upvotes": 34,
      "upvote_ratio": 0.73,
      "num_comments": 50,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kv7h8y/eli5_what_is_entropy/"
    },
    {
      "id": "1kumv78",
      "title": "ELI5: What is the purpose of gravel underneath train tracks?",
      "content": "Genuinely curious, what is the purpose of gravel under most rail road tracks? Why are they usually lifted from the flat grounds?",
      "author": "Renunderum",
      "created_utc": 1748123661,
      "upvotes": 1025,
      "upvote_ratio": 0.93,
      "num_comments": 141,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kumv78/eli5_what_is_the_purpose_of_gravel_underneath/"
    },
    {
      "id": "1kuswcv",
      "title": "ELI5: How do chess AIs play at different skill levels?",
      "content": "Most chess computers can determine the top X moves in a given position. The rating of the best computers like Stockfish always play the best move, but there are bots that can play as any level - do they simply play the 5th (random lower-tier) best move in critical positions? How do they know when to make reasonable moves that aren’t blunders and when to simply make slightly inaccurate ones?",
      "author": "bentzigitig",
      "created_utc": 1748143036,
      "upvotes": 283,
      "upvote_ratio": 0.88,
      "num_comments": 42,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kuswcv/eli5_how_do_chess_ais_play_at_different_skill/"
    },
    {
      "id": "1kvby05",
      "title": "ELI5: How Neighborhoods remain insular.",
      "content": "One of those unusual things I've noticed in cities is how insular various neighborhoods are from one another. \n\nThe differences from one neighborhood to next can\nbe extremely stark even if they are but one crosswalk apart. Different cultures, people, income, and so on are seemingly divided by...nothing?\n\nWhat are the mechanics that keep neighborhoods seperate from one another? Why don't neighborhoods spread or recede or mix? What stops people from simply walking across the street?",
      "author": "DefinitelyNotKuro",
      "created_utc": 1748204148,
      "upvotes": 7,
      "upvote_ratio": 0.62,
      "num_comments": 4,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kvby05/eli5_how_neighborhoods_remain_insular/"
    },
    {
      "id": "1kuok1i",
      "title": "ELI5: Why do investors care so much about growth, even if a company is already making a lot of money?",
      "content": "Let’s say a company is making billions every year and stays profitable isn’t that a success? Why is there so much pressure for them to keep growing profits every quarter?\n\nWouldn’t “good and stable” be enough? What happens if they just… stop growing but keep making solid money?",
      "author": "TheblackNinja94",
      "created_utc": 1748128598,
      "upvotes": 177,
      "upvote_ratio": 0.83,
      "num_comments": 169,
      "flair": "Economics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kuok1i/eli5_why_do_investors_care_so_much_about_growth/"
    },
    {
      "id": "1kuvgrs",
      "title": "ELI5: How do computers shut down?",
      "content": "How does software (the code that runs when I press the shut down button) control the operation of the cpu? Does it just signal the power controller to cut power? How does a device reboot automatically? What about clock speed during operation? How does software control the clock (what and where even is the clock, on the cpu itself or on the motherboard? ",
      "author": "OhFuckThatWasDumb",
      "created_utc": 1748152572,
      "upvotes": 39,
      "upvote_ratio": 0.8,
      "num_comments": 9,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kuvgrs/eli5_how_do_computers_shut_down/"
    },
    {
      "id": "1kubmac",
      "title": "ELI5: Mississippi river: How is the drop from Minnesota (1400 feet above sea level) to sea level enough to travel  2300 miles?",
      "content": "The Mississippi River is 2300 miles long and at the start Lake Itasca is only 1475 feet above sea level. How can that be enough drop to travel that far?",
      "author": "hm4371239841237rh",
      "created_utc": 1748093306,
      "upvotes": 687,
      "upvote_ratio": 0.85,
      "num_comments": 230,
      "flair": "Planetary Science",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kubmac/eli5_mississippi_river_how_is_the_drop_from/"
    },
    {
      "id": "1kv4vsr",
      "title": "ELI5: How does our brain immediately calculate the precise distance and stride alignment to the next kick when you’re kicking a rock down the sidewalk?",
      "content": "Y’know when you’re walking down the sidewalk and start kicking a rock, giving it a good boot 20 feet ahead of you…? How does our brain **immediately** know whether or not your current stride will meet up with the rock for the next kick, or if your stride needs to be adjusted to do so?",
      "author": "PHOTO500",
      "created_utc": 1748185967,
      "upvotes": 7,
      "upvote_ratio": 0.55,
      "num_comments": 15,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kv4vsr/eli5_how_does_our_brain_immediately_calculate_the/"
    },
    {
      "id": "1kuvd5u",
      "title": "ELI5: Why is it that catching and getting over most common contagious illnesses provides acquired immunity to them, but this doesn't seem to apply with strep throat?",
      "content": "Is it just because strep is bacterial, while most common illnesses (ie flu, covid) are viral? If so, why don't bacterial diseases result in that same kind of acquired immunity?\n\nETA i get that strep isnt just one strain of bacteria. but that's true of colds, flus, etc too. if i get a flu, give it to my partner, get better, then help take care of them, i have basically no chance of getting that same flu back from them. but in that same scenario with strep, we can absolutely just keep ping-ponging it back and forth.",
      "author": "aftergaylaughter",
      "created_utc": 1748152185,
      "upvotes": 28,
      "upvote_ratio": 0.74,
      "num_comments": 13,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kuvd5u/eli5_why_is_it_that_catching_and_getting_over/"
    },
    {
      "id": "1ku8obi",
      "title": "ELI5: How do elevators decide who to pick up first when people on different floors press the button?",
      "content": "Say if I’m on 15 heading down, someone’s on 10 trying to go up, how does the system figure out who gets picked up first? Given that there’s only one elevator ",
      "author": "an-76",
      "created_utc": 1748083277,
      "upvotes": 674,
      "upvote_ratio": 0.9,
      "num_comments": 81,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ku8obi/eli5_how_do_elevators_decide_who_to_pick_up_first/"
    },
    {
      "id": "1kumbn4",
      "title": "ELI5: What is a tax write off?",
      "content": "Why do people say this about companies and rich people? ",
      "author": "PolarpopK1985",
      "created_utc": 1748122091,
      "upvotes": 72,
      "upvote_ratio": 0.72,
      "num_comments": 105,
      "flair": "Economics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kumbn4/eli5_what_is_a_tax_write_off/"
    },
    {
      "id": "1ku97ic",
      "title": "ELI5 Why is there 60 seconds in a minute?",
      "content": "Why was the time of a second decided to be what we know as a second. For example. If a second was actually half a second then there would be 120 seconds in a minute. Or if a second was what we know as 2 seconds, there would be 30 seconds in a minute. ",
      "author": "No-Foot3938",
      "created_utc": 1748085333,
      "upvotes": 340,
      "upvote_ratio": 0.78,
      "num_comments": 112,
      "flair": "Mathematics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ku97ic/eli5_why_is_there_60_seconds_in_a_minute/"
    },
    {
      "id": "1ku6gd2",
      "title": "ELI5 Why is Roko's Basilisk considered to be \"scary\"?",
      "content": "I recently read a post about it, and to summarise:\n\nA future superintelligent AI will punish those who heard about it but didn't help it come into existence. So by reading it, you are in danger of such punishment\n\nBut what exactly makes it scary? I don't really understand when people say its creepy or something because its based on a LOT of assumptions. ",
      "author": "ConnectionOk8555",
      "created_utc": 1748073942,
      "upvotes": 427,
      "upvote_ratio": 0.81,
      "num_comments": 382,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ku6gd2/eli5_why_is_rokos_basilisk_considered_to_be_scary/"
    },
    {
      "id": "1kubs8b",
      "title": "ELI5 - How do rechargeable electronics charge 70% in 20 mins but a full charge takes over 2 hours?",
      "content": "These are hypothetical numbers but I feel like I’ve heard claims of batteries being charged quite quickly to get to X% but the rest take much longer. How does that work?",
      "author": "Et3rna1Sunshine",
      "created_utc": 1748093777,
      "upvotes": 132,
      "upvote_ratio": 0.83,
      "num_comments": 51,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kubs8b/eli5_how_do_rechargeable_electronics_charge_70_in/"
    },
    {
      "id": "1kuuw7o",
      "title": "ELI5: The deep. How do they know how \"old\" the creatures they find down there are?",
      "content": "How do they know that this newly discovered species of deep-sea copipod, for example, is 50 million years old?\n\nAlso, how do these animals adapt to the IMMENSE pressure under there? A lot of the fish down there look like regular fish (like the fangtooth). \n\nWhat kind of training does one even need to hitch a ride on a sub that would go that deep?",
      "author": "NyFlow_",
      "created_utc": 1748150327,
      "upvotes": 6,
      "upvote_ratio": 0.6,
      "num_comments": 5,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kuuw7o/eli5_the_deep_how_do_they_know_how_old_the/"
    },
    {
      "id": "1ku6f5s",
      "title": "ELI5: why is it harmful to use a scratched non-stick pan",
      "content": null,
      "author": "Mundane-Werewolf9541",
      "created_utc": 1748073800,
      "upvotes": 133,
      "upvote_ratio": 0.82,
      "num_comments": 81,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ku6f5s/eli5_why_is_it_harmful_to_use_a_scratched/"
    },
    {
      "id": "1ktnyqb",
      "title": "ELI5: What made only humans, rather than any other species, evolve to become so advanced?",
      "content": null,
      "author": "Legitimate_Mail_2064",
      "created_utc": 1748017887,
      "upvotes": 2099,
      "upvote_ratio": 0.91,
      "num_comments": 618,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ktnyqb/eli5_what_made_only_humans_rather_than_any_other/"
    },
    {
      "id": "1kujgo1",
      "title": "ELI5: How on earth do they get those massive electrical towers/lines on the side of towering mountains?",
      "content": "I w",
      "author": "rech1er",
      "created_utc": 1748114168,
      "upvotes": 15,
      "upvote_ratio": 0.69,
      "num_comments": 6,
      "flair": "Engineering",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kujgo1/eli5_how_on_earth_do_they_get_those_massive/"
    },
    {
      "id": "1ku2t28",
      "title": "ELI5 Why is it so easy to spill liquid when moving it from a cup to another cup?",
      "content": null,
      "author": "tigerjjw53",
      "created_utc": 1748059500,
      "upvotes": 190,
      "upvote_ratio": 0.77,
      "num_comments": 36,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ku2t28/eli5_why_is_it_so_easy_to_spill_liquid_when/"
    },
    {
      "id": "1kufifv",
      "title": "ELI5: how do phones block out certain sounds?",
      "content": "So I'm a phone call with my wife, but still have YouTube music playing in the background. But she can't hear that at all. How does my/her phone completely cancel out that sound? ",
      "author": "PaulMichaelJordan64",
      "created_utc": 1748103810,
      "upvotes": 14,
      "upvote_ratio": 0.7,
      "num_comments": 14,
      "flair": "Engineering",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kufifv/eli5_how_do_phones_block_out_certain_sounds/"
    },
    {
      "id": "1ku4lnd",
      "title": "ELI5: Why cant our body skip the \"light sleep\" part in our sleep cycle?",
      "content": "I read somewhere deep sleep and REM sleep are the most restorative parts of our sleep. Why can't our body just skip the light sleep part in our sleep cycle and enter REM sleep for 2 hours and then deep sleep for 2 hours or alternate between them? Is there a reason from an evolutionary perspective?",
      "author": "HanjinOnReddit",
      "created_utc": 1748066299,
      "upvotes": 101,
      "upvote_ratio": 0.85,
      "num_comments": 37,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ku4lnd/eli5_why_cant_our_body_skip_the_light_sleep_part/"
    },
    {
      "id": "1ktxv11",
      "title": "ELI5: Why does shower curtain liners seem to blow into the shower?",
      "content": "What is the cause for a liner to act like a breeze is blowing it into a shower while it’s running? ",
      "author": "ErebusTheKid",
      "created_utc": 1748043420,
      "upvotes": 223,
      "upvote_ratio": 0.83,
      "num_comments": 63,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ktxv11/eli5_why_does_shower_curtain_liners_seem_to_blow/"
    },
    {
      "id": "1kuix5v",
      "title": "ELI5: what is the difference between intellectual property and copyright",
      "content": null,
      "author": "Escajaver",
      "created_utc": 1748112727,
      "upvotes": 6,
      "upvote_ratio": 0.6,
      "num_comments": 12,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kuix5v/eli5_what_is_the_difference_between_intellectual/"
    },
    {
      "id": "1kubas2",
      "title": "ELi5 why insects are able to crawl up walls",
      "content": "Doesn't rules of gravity apply to them?!",
      "author": "passion_for_know-how",
      "created_utc": 1748092371,
      "upvotes": 17,
      "upvote_ratio": 0.63,
      "num_comments": 18,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kubas2/eli5_why_insects_are_able_to_crawl_up_walls/"
    },
    {
      "id": "1ktr6q4",
      "title": "ELI5. Why is it so common to lose a sense of your own voice’s volume when on the phone?",
      "content": "Why do we all talk so loudly when we’re on the phone?",
      "author": "Neat_Philosophy1552",
      "created_utc": 1748025715,
      "upvotes": 387,
      "upvote_ratio": 0.9,
      "num_comments": 37,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ktr6q4/eli5_why_is_it_so_common_to_lose_a_sense_of_your/"
    },
    {
      "id": "1ktlqol",
      "title": "ELI5: Why does it feel like sleep resets the brain of negative emotions? Whether it's a nap or a good night's rest.",
      "content": "Have you ever went to sleep angry, sad, or anxious and woken up fresh and free of those emotions?",
      "author": "xKhira",
      "created_utc": 1748012448,
      "upvotes": 752,
      "upvote_ratio": 0.95,
      "num_comments": 48,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ktlqol/eli5_why_does_it_feel_like_sleep_resets_the_brain/"
    },
    {
      "id": "1ktw5vz",
      "title": "ELI5: Why is methanol more poisonous than ethanol?",
      "content": null,
      "author": "IncoherentTuatara",
      "created_utc": 1748038532,
      "upvotes": 97,
      "upvote_ratio": 0.82,
      "num_comments": 47,
      "flair": "Chemistry",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ktw5vz/eli5_why_is_methanol_more_poisonous_than_ethanol/"
    },
    {
      "id": "1ktakq9",
      "title": "ELI5: how does electric current “know” what the shorter path is?",
      "content": "I always hear that current will take the shorter path, but how does it know it?",
      "author": "Just_a_happy_artist",
      "created_utc": 1747973520,
      "upvotes": 2764,
      "upvote_ratio": 0.92,
      "num_comments": 524,
      "flair": "Engineering",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ktakq9/eli5_how_does_electric_current_know_what_the/"
    },
    {
      "id": "1ktgmrw",
      "title": "ELI5: Why did it take so long for humans to start advancing technologically?",
      "content": "So somewhere around 4000-2000 BCE the discovery of metalworking came around. From there, we rapidly accelerated through the bronze age to the iron age.\n\nBut humans have existed for over 1 million years. Why was it only 7000 years ago that humans begun to advance so quickly?",
      "author": "EchoOwn5967",
      "created_utc": 1747997894,
      "upvotes": 677,
      "upvote_ratio": 0.86,
      "num_comments": 249,
      "flair": "Other",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ktgmrw/eli5_why_did_it_take_so_long_for_humans_to_start/"
    },
    {
      "id": "1ku30ag",
      "title": "ELI5: Dog’s selective hearing whilst sleeping",
      "content": "How is it that dogs can wake up only after hearing certain words/phrases? This hence would mean they are listening the whole time. So are they really sleeping at all? Of course this is all based off social media videos showcasing dogs waking up from their favorite words. But possibly the dogs in those videos aren’t fully sleeping? I don’t own a dog so i’m not sure.",
      "author": "SpeedDirect2092",
      "created_utc": 1748060204,
      "upvotes": 25,
      "upvote_ratio": 0.73,
      "num_comments": 19,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ku30ag/eli5_dogs_selective_hearing_whilst_sleeping/"
    },
    {
      "id": "1ku91iq",
      "title": "ELI5: How do we decide an animal has evolved enough to call it a different species?",
      "content": null,
      "author": "gdp1",
      "created_utc": 1748084710,
      "upvotes": 6,
      "upvote_ratio": 0.64,
      "num_comments": 9,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ku91iq/eli5_how_do_we_decide_an_animal_has_evolved/"
    },
    {
      "id": "1ktcudd",
      "title": "ELI5: Why is flooring it to 60mph less fuel efficient than slowly accelerating?",
      "content": null,
      "author": "KippaQ",
      "created_utc": 1747982187,
      "upvotes": 999,
      "upvote_ratio": 0.89,
      "num_comments": 275,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ktcudd/eli5_why_is_flooring_it_to_60mph_less_fuel/"
    },
    {
      "id": "1ktkcp8",
      "title": "ELI5: how do our bodies crave specific foods? do they somehow \"remember\" what foods are made of?",
      "content": null,
      "author": "bruceleroy99",
      "created_utc": 1748008938,
      "upvotes": 200,
      "upvote_ratio": 0.87,
      "num_comments": 47,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ktkcp8/eli5_how_do_our_bodies_crave_specific_foods_do/"
    },
    {
      "id": "1ktah5t",
      "title": "ELI5: Why do semis have nine to even fifteen gears?",
      "content": null,
      "author": "rech1er",
      "created_utc": 1747973174,
      "upvotes": 873,
      "upvote_ratio": 0.91,
      "num_comments": 159,
      "flair": "Engineering",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ktah5t/eli5_why_do_semis_have_nine_to_even_fifteen_gears/"
    },
    {
      "id": "1ku4eq8",
      "title": "ELI5 Instant incineration of wood",
      "content": "ELI5\n\nProbably missing some protocols in the title and question, sorry. \n\nHowever I was wondering if there is a certain temperature that wood would instantaneously combust. Sticking a piece of wood into the burn barrel and it instantly catches alight lead me to wonder is there a max temp the wood could handle? \n\nOr like water to steam, is there another way to achieve this instant incineration, like a pressure cooker and the right amount of heat etc. \n\nThanks : ) ",
      "author": "cheffkoo",
      "created_utc": 1748065518,
      "upvotes": 8,
      "upvote_ratio": 0.71,
      "num_comments": 14,
      "flair": "Biology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ku4eq8/eli5_instant_incineration_of_wood/"
    },
    {
      "id": "1ku87kg",
      "title": "ELI5: How does the mobile internet work in subway tunnels?",
      "content": "Are there many internet transponders connected to each other in every 30m? If yes how is this work?",
      "author": "foxey21",
      "created_utc": 1748081364,
      "upvotes": 5,
      "upvote_ratio": 0.59,
      "num_comments": 17,
      "flair": "Engineering",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ku87kg/eli5_how_does_the_mobile_internet_work_in_subway/"
    },
    {
      "id": "1ku1rga",
      "title": "ELI5: In the sport of basketball, is the flight of the ball affected by the air pressure and air like at different ballparks for baseballs?",
      "content": "I recognize basketballs are a different weight and size and travel a shorter distance. My question involves do teams or players factor it in to their play. Such as playing in Denver vs playing in Miami, as an example. ",
      "author": "Beginners23mind",
      "created_utc": 1748055912,
      "upvotes": 6,
      "upvote_ratio": 0.59,
      "num_comments": 20,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ku1rga/eli5_in_the_sport_of_basketball_is_the_flight_of/"
    },
    {
      "id": "1kttw5u",
      "title": "ELI5: Bernoulli’s Principle",
      "content": "Bernoulli’s principle that an increase in the speed of a fluid decreases its pressure seems kind of unintuitive to me. Maybe I’m approaching it the wrong way. \n\nThe way I imagine it in my head is like a fire hose. If you increase the speed at which the water shoots out of the hose wouldn’t its pressure be higher as well. Conversely, if you were to turn down the hose pressure, wouldn’t the speed of the water decrease and even stop if there was no pressure? \n\nOr is it about the pressure exerted “on” the fluid and not the pressure exerted “by” the fluid? For example, if I were to step on a hose. I’m exerting pressure on it, thus slowing and even stopping the speed at which water sprays out of the hose? \n\nI don’t even know the frame from which to understand this. ",
      "author": "IceCreamChillinn",
      "created_utc": 1748032583,
      "upvotes": 10,
      "upvote_ratio": 0.75,
      "num_comments": 11,
      "flair": "Physics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1kttw5u/eli5_bernoullis_principle/"
    },
    {
      "id": "1ksvplo",
      "title": "ELI5 empty apartments yet housing crises?",
      "content": "How is it possible that in America we have so many abandoned houses and apartments, yet also have a housing crises where not everyone can find a place to live? ",
      "author": "DerpedOffender",
      "created_utc": 1747932810,
      "upvotes": 1221,
      "upvote_ratio": 0.87,
      "num_comments": 430,
      "flair": "Economics",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ksvplo/eli5_empty_apartments_yet_housing_crises/"
    },
    {
      "id": "1ktiet9",
      "title": "ELI5: How do twin-rotor helicopters like the Chinook work?",
      "content": "For a single rotor helicopter, I know there are basically three controls:\n\n* A lever at the side, which is the collective, which makes the aircraft go up or down\n* A stick at the center, which governs left/right/forward/backward motion.\n* Foot pedals which govern yaw, rotating the craft left/right.\n\nHow does this work for a twin-rotor craft like a Chinook?\n\n* Are there SIX controls for one pilot?  Two each of the three listed above?\n* Does it require two pilots, one for the front rotor and one for the back rotor?\n\nHow does this all work?",
      "author": "whomp1970",
      "created_utc": 1748003593,
      "upvotes": 28,
      "upvote_ratio": 0.71,
      "num_comments": 21,
      "flair": "Engineering",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ktiet9/eli5_how_do_twinrotor_helicopters_like_the/"
    },
    {
      "id": "1ktdgua",
      "title": "ELI5: what determines whether clothes are allowed to put in dryer",
      "content": "Seriously - I am apparently too stupid to understand what determines whether stuff can be put into the tumble dryer. Obviously I know the symbol and that some fabrics like silk and cashmere or cloth with prints are not allowed to tumble dry but some cloth if my 3y old son and myself have the same fabrics but some are allowed for tumble dry and others are not. Is there a simple logic behind this?",
      "author": "LS7H",
      "created_utc": 1747984757,
      "upvotes": 74,
      "upvote_ratio": 0.87,
      "num_comments": 24,
      "flair": "Technology",
      "url": null,
      "is_self": true,
      "permalink": "/r/explainlikeimfive/comments/1ktdgua/eli5_what_determines_whether_clothes_are_allowed/"
    }
  ]
}