{
  "subreddit": "LegalAdvice",
  "collection_date": "2025-06-05T14:45:46.302277",
  "total_posts_with_comments": 154,
  "total_comments": 542,
  "comments": {
    "1l3bm5d": [
      {
        "id": "mvzn1jj",
        "body": "Don't sign that waiver immediately. Seriously, do NOT. That waiver is designed to protect them from any legal action you might take. Three weeks of SUB payments is chump change if they've actually violated his rights. What he signed off on was a request for leave under FMLA, which protects him from being fired because he took leave. The timing is super suspicious, and it sounds like he was laid off because of the impending paternity leave, not for legitimate cost-cutting.",
        "author": "mycupsareA",
        "created_utc": 1749059132,
        "score": 3311,
        "parent_id": "t3_1l3bm5d",
        "depth": 0
      },
      {
        "id": "mvzn5d5",
        "body": "Sign nothing without talking to a lawyer.",
        "author": "notsubwayguy",
        "created_utc": 1749059161,
        "score": 589,
        "parent_id": "t3_1l3bm5d",
        "depth": 0
      },
      {
        "id": "mw01aig",
        "body": "As an HR professional myself, this is highly dependent on state law. However, what you have going for you is that you have an agreed contract for leave. Do not sign what they asked you. I actually think you have a good case for him to simply go on leave immediately and for the company to pay for it, but you need to talk to a lawyer and go to the DOL.\n\nEdit: Just noticed this said Georgia. I think you have a pretty damn good case under PPL that this was a retaliation action, especially if it was not a mass layoff.",
        "author": "Dry_Topic_7333",
        "created_utc": 1749063153,
        "score": 561,
        "parent_id": "t3_1l3bm5d",
        "depth": 0
      },
      {
        "id": "mw00efa",
        "body": "I don't know about Georgia labor law, but from what you've described I'm not even sure they can effectively defend themselves from a claim. \n\nThis is one of those things that will never go to trial so sign nothing, get a good HR lawyer, and go for the settlement. And they will settle.\n\nFor reference, I once laid off an employee who told me the day after that she was pregnant. She filed a lawsuit and my business ended up settling for $100k. A trial would have cost us $300k. \n\nYou've got 'em so stick it to 'em.",
        "author": "napalm_beach",
        "created_utc": 1749062900,
        "score": 393,
        "parent_id": "t3_1l3bm5d",
        "depth": 0
      },
      {
        "id": "mvzplfr",
        "body": "“Others were laid off” too…really? Any proof of that whatsoever?",
        "author": "4hhsumm",
        "created_utc": 1749059830,
        "score": 137,
        "parent_id": "t3_1l3bm5d",
        "depth": 0
      },
      {
        "id": "mw0ilqu",
        "body": "As an employment lawyer not in GA, GET A LAWYER GET A LAWYER GET A LAWYER!\n\nThis is so sus.",
        "author": "TheFakeChiefKeef",
        "created_utc": 1749068126,
        "score": 71,
        "parent_id": "t3_1l3bm5d",
        "depth": 0
      },
      {
        "id": "mvzxygt",
        "body": "Three weeks pay is not a severance amount even worth considering.",
        "author": "ryhopewood",
        "created_utc": 1749062207,
        "score": 51,
        "parent_id": "t3_1l3bm5d",
        "depth": 0
      },
      {
        "id": "mvzktyi",
        "body": "With multiple people being laid off it’s difficult to point to it being retaliation. There’s no leverage here. But you’re free to discuss details with a lawyer.",
        "author": "monkeyman80",
        "created_utc": 1749058523,
        "score": 43,
        "parent_id": "t3_1l3bm5d",
        "depth": 0
      },
      {
        "id": "mvzl8iw",
        "body": "Was your husband taking any sort of protected leave (such as FMLA or a state equivalent) when he was fired? If the leave was federally protected, he may have recourse to say the termination was wrongful and motivated by the submission for leave. Talk to a lawyer or someone at the Georgia Department of Labor.",
        "author": "ballofspacetrash",
        "created_utc": 1749058634,
        "score": 38,
        "parent_id": "t3_1l3bm5d",
        "depth": 0
      },
      {
        "id": "mw013x5",
        "body": "Talk to your State Labor Board. Even if they were downsizing, it looks very suspicious to fire someone right after they put in for paternity leave.",
        "author": "Repulsive-Flamingo47",
        "created_utc": 1749063102,
        "score": 37,
        "parent_id": "t3_1l3bm5d",
        "depth": 0
      },
      {
        "id": "mw02eja",
        "body": "Talk to a lawyer.  Even if this is legit (was going to happen anyway and just bad coincidence on timing), it LOOKS really bad and could be difficult for the company to defend.\n\nAt very least I would expect him to be able to negotiate a better severence than what they offered.",
        "author": "rglogowski",
        "created_utc": 1749063467,
        "score": 18,
        "parent_id": "t3_1l3bm5d",
        "depth": 0
      },
      {
        "id": "mw12c8h",
        "body": "Worth conversation with a lawyer. \n\nI was a manager of a not well performing employee that I realized we needed to part ways with, but who submitted paternity leave paperwork (3 months here). HR was very clear that unless he did something that was grounds for immediate termination, he will get the full paternity leave AND we'll need to wait at least a quarter until we start the PIP process. It wasn't that he'd win the wrongful termination case (there was plenty of evidence of subpar work), but if he just took us to court the lawyers would be so expensive that it was just simpler and cheaper to pay him.",
        "author": "Gesha24",
        "created_utc": 1749073888,
        "score": 17,
        "parent_id": "t3_1l3bm5d",
        "depth": 0
      },
      {
        "id": "mvzmgy7",
        "body": "NAL. Timing definitely feels suspect. Finding a local employment lawyer would be able to answer whether you have a case or not. \n\nThey’ll likely want to know about his evaluation history and whether he had any write ups. Mainly signs it could be retaliation for filing the leave request.",
        "author": "DesertGTI",
        "created_utc": 1749058975,
        "score": 15,
        "parent_id": "t3_1l3bm5d",
        "depth": 0
      },
      {
        "id": "mw0lqe0",
        "body": "Having recently gone through this from the other side, some thing I learned: \n1. Lawsuits are expensive and employers want to avoid them. You will find a lawyer to take your case. Start with a letter and go from there. \n2. Severance is negotiable and your signature on the form is worth a lot \n3. If you’re over 40 you have additional rights wrt severance (20 (ish??) days to decide and then time after you sign to take back if you want)\n4. Your company is being very stupid and you likely have a valid and expensive claim and they should easily pay out 3-6 months of severance to avoid being sued by you. You may be able to extract this out of them by hiring a lawyer only to write them a letter. But if they are too stupid, you might have to sue them. ",
        "author": "Auspicious_number",
        "created_utc": 1749069006,
        "score": 14,
        "parent_id": "t3_1l3bm5d",
        "depth": 0
      },
      {
        "id": "mw18kr0",
        "body": "Obviously like most people said already don't sign anything without consulting some attorneys.\n\nBut I'm cautiously going to give the employer the benefits of the doubt. The math doesn't quite add up that they are laying him off over a mere 2-week paid leave. It's not like he'll be out for 2 months. Plus they are still going to pay out 3 weeks anyway.\n\nI'm guessing it's a very unfortunate coincidence. \n\nThat said, the court may very well interpret it differently. It does look very suspicious. So anyway, talk to a lawyer.",
        "author": "colonelheero",
        "created_utc": 1749075830,
        "score": 14,
        "parent_id": "t3_1l3bm5d",
        "depth": 0
      },
      {
        "id": "mw0m3wr",
        "body": "Whether or not you have a case or a good case is irrelevant. It’s in the company’s interest to not get sued, however frivolous, and if they don’t have their head completely up their ass they will pay to get your signature. ",
        "author": "Auspicious_number",
        "created_utc": 1749069110,
        "score": 13,
        "parent_id": "t3_1l3bm5d",
        "depth": 0
      },
      {
        "id": "mw0we76",
        "body": "Do not sign that waiver. Have him talk to an employment attorney. That really is going to be your best recourse.\n\nIn the meantime, he files for unemployment. I know it’s not much, but it will help. But never, ever, sign something like that.",
        "author": "mtngrl60",
        "created_utc": 1749072070,
        "score": 9,
        "parent_id": "t3_1l3bm5d",
        "depth": 0
      },
      {
        "id": "mw20a5o",
        "body": "These simple words… “my attorney told me not to sign” and immediately stop talking. Don’t be nice, explain or anything literally don’t talk. The other person will fall all over them selves. See what you can get and tell him to go get to work.",
        "author": "30062",
        "created_utc": 1749085238,
        "score": 9,
        "parent_id": "t3_1l3bm5d",
        "depth": 0
      },
      {
        "id": "mvzmidy",
        "body": "Did he apply for FLMA? If so you may have a case but it’s hard to prove.",
        "author": "Effective_Spirit_126",
        "created_utc": 1749058985,
        "score": 9,
        "parent_id": "t3_1l3bm5d",
        "depth": 0
      },
      {
        "id": "mw247yl",
        "body": "Easy FMLA case. HR fucked up bad.",
        "author": "modernhippy72",
        "created_utc": 1749086618,
        "score": 8,
        "parent_id": "t3_1l3bm5d",
        "depth": 0
      }
    ],
    "1l3km4l": [
      {
        "id": "mw1qn9j",
        "body": "Given the circumstances, it seems your daughter was provoked, she was choked and then locked in her room and the boyfriend kept approaching her in an aggressive manner that could cause her to fear for her safety.\n\nIt is possible she threw the items in an attempt to get him to leave her alone, it seems the items were unlikely to cause significant injury, it could be argued she used reasonable force to try to get him to leave her alone.\n\nThe boyfriend seems to be eligible for some charges as well, the choking was assault, locking her in her room could very well be considered false imprisonment. You should be filing charges as well, as soon as possible.\n\nIt seems everyone on the side of the boyfriend is betting on you being overwhelmed and not defending yourself, from how I see it, the boyfriends stands to lose much more. Teach him that playing stupid games gets you stupid prizes. He f*cked around, now let him find out.\n\nYOU NEED A LAWYER ASAP.",
        "author": "UmmDontBeThatGuy",
        "created_utc": 1749081843,
        "score": 1378,
        "parent_id": "t3_1l3km4l",
        "depth": 0
      },
      {
        "id": "mw1zsxc",
        "body": "Everyone is giving good advice, but I just wanted to add a little different take.\n\nYou could file a child abuse restraining order on her behalf. This would benefit you because you don't NEED a lawyer, you can do it yourself, and they usually have to be heard extremely quickly, within 2ish weeks.  This would allow you to present the video evidence and get a civil judgment against him.  This kind of injunction would 100% help your daughter's case and I've even seen criminal charges be reduced or dismissed based on a favorable outcome before. \n\nYou definitely need to read up on this type of hearing and make sure you are capable of taking it on. The burden of proof would be on you to show he committed acts, not on him to prove his innocence.  Most judges give a little leeway for pro se parties but in general you are expected to understand the laws and procedures especially regarding evidence.\n\nEdit: I just want to clarify this advice should NOT be read as action to take in lieu of getting an attorney, but in addition to. Your child is facing criminal charges and you NEED to get an attorney. But sometimes that process takes time and this is something else that can be done while waiting.",
        "author": "sunidelite",
        "created_utc": 1749085069,
        "score": 746,
        "parent_id": "t3_1l3km4l",
        "depth": 0
      },
      {
        "id": "mw1urrn",
        "body": "She's a minor - how can the police question her without a parent present? Wouldn't that be an issue that could get charges dismisswd?",
        "author": "micheleacole720",
        "created_utc": 1749083299,
        "score": 266,
        "parent_id": "t3_1l3km4l",
        "depth": 0
      },
      {
        "id": "mw1pfza",
        "body": "You need to get a lawyer and file charges against the boyfriend. He could have killed your younger daughter. Strangling is dangerous and a huge red flag he will murder your daughters.",
        "author": "TiaLiaH",
        "created_utc": 1749081422,
        "score": 217,
        "parent_id": "t3_1l3km4l",
        "depth": 0
      },
      {
        "id": "mw1mmps",
        "body": "Your option is to get your daughter a lawyer. \n\nThere’s nothing obviously wrong or problematic in this arrest or arraignment. And no you don’t have to press charges.",
        "author": "reddituser1211",
        "created_utc": 1749080457,
        "score": 193,
        "parent_id": "t3_1l3km4l",
        "depth": 0
      },
      {
        "id": "mw1o8ia",
        "body": "You could try fling a police report against your other daughter and her bf based on your video evidence. Get a lawyer for your arrested daughter first and discuss all that with him. Your older daughter is an adult and is responsible for this mess as much as her bf.",
        "author": "thepatriot74",
        "created_utc": 1749081003,
        "score": 165,
        "parent_id": "t3_1l3km4l",
        "depth": 0
      },
      {
        "id": "mw1vh2r",
        "body": "Get your daughter a lawyer. Don't allow that guy in your home ever again.",
        "author": "Classic_Coconut_7613",
        "created_utc": 1749083552,
        "score": 74,
        "parent_id": "t3_1l3km4l",
        "depth": 0
      },
      {
        "id": "mw23dm2",
        "body": "It is very likely that man will murder one or both of your daughters. Do everything you can to get him out of your lives. \n\nhttps://www.domesticshelters.org/articles/identifying-abuse/strangulation-is-the-highest-predictor-of-murder\n\n“In a study of homicide victims killed by an intimate partner, it was found that 43 percent had experienced a non-fatal strangulation by their partner prior to their murder. In attempted homicides by an intimate partner, 45 percent of victims had been strangled before the attempted murder. Researchers in the study, including acclaimed domestic violence expert Jacquelyn Campbell, who developed the Danger Assessment in 1987, determined that being strangled by a partner even one time increases a victim’s risk of homicide by that perpetrator over 600 percent.”",
        "author": "ZealousidealHunter98",
        "created_utc": 1749086321,
        "score": 52,
        "parent_id": "t3_1l3km4l",
        "depth": 0
      },
      {
        "id": "mw1was9",
        "body": "You need to get a lawyer for your daughter, but also file a police report and file charges against the boyfriend. You have the footage!",
        "author": "OnlyInAnAdultStore",
        "created_utc": 1749083847,
        "score": 46,
        "parent_id": "t3_1l3km4l",
        "depth": 0
      },
      {
        "id": "mw1vn78",
        "body": "You need to make copies of that video where she's being choked and bring it to the police to have them file charges.  As well get a lawyer to push this because if the boyfriends dad is a cop you'll need all the help y ou can get.",
        "author": "Weary_Dragonfly_8891",
        "created_utc": 1749083613,
        "score": 30,
        "parent_id": "t3_1l3km4l",
        "depth": 0
      },
      {
        "id": "mw24wiv",
        "body": "This is seriously messed up. Your daughter should be safe in her own home. File charges against the boyfriend.   In most states your daughter should not have been questioned without a parent present. Had she been charged and arraigned? As an adult or juvenile? Does your daughter have an attorney? Get a public defender if you can't afford one. This sounds other daughter and boyfriend are determined to mess up her life.",
        "author": "OwnLime3744",
        "created_utc": 1749086857,
        "score": 21,
        "parent_id": "t3_1l3km4l",
        "depth": 0
      },
      {
        "id": "mw2efuk",
        "body": "Just to add on to what everyone else is saying, you may want to consult with a civil rights attorney as well because they might have violated her rights during interrogation if she wasn’t allowed to have a parent present.",
        "author": "jcw1988",
        "created_utc": 1749090196,
        "score": 18,
        "parent_id": "t3_1l3km4l",
        "depth": 0
      },
      {
        "id": "mw2zgj1",
        "body": "something seems off, at the very least you’re omitting details. \n1. There’s no way a 15 year-old gets arrested and in less than 24 hours get sentenced to probation without any involvement from her parents.\n2. You said she spent the night in an empty office???\n3. You said this happened a couple of weeks ago and you have a family lawyer yet you are looking here for direction??\n4. At 15 her signature on legal documents is nothing without yours.\n5. You can claim the cops were dirty because of their relation to the boyfriend, but for all this to happen the judge and the prosecutor would have to go along with it as well, which is very unlikely.\n\ntldr: fictional",
        "author": "Bullshit_Repost",
        "created_utc": 1749098772,
        "score": 22,
        "parent_id": "t3_1l3km4l",
        "depth": 0
      },
      {
        "id": "mw2aj57",
        "body": "He would learn today! Get a lawyer asap!  \nAssault on a minor, false imprisonment, domestic violence, oh yeah he's looking at some jail time. \nDid you give him permission to be in your house when you're not home? Hit his tail with trespassing too, if you can.\nMaybe make a call to international affairs about the improper police investigation.\nPraying for justice 🙏🏽",
        "author": "Agreeable-Canary-410",
        "created_utc": 1749088823,
        "score": 14,
        "parent_id": "t3_1l3km4l",
        "depth": 0
      },
      {
        "id": "mw2re5t",
        "body": "Your daughter is a minor & therefore cannot sign legal documents for herself that includes signing to agree to that witness statement. Your child is a minor & you should've been notified by law enforcement as soon as they got involved. So many things were not done properly.\n\nGet the video on as many of your devices as possible so it can't just be deleted. Take a copy to an attorney to get your child legal help. It will be costly, but you need legal council. Make sure whoever you hire does not take on cases as a public defender. Public defenders are buddy buddy with the system & those working it and will not actually help your child as they're not going to want to go against their friends and those who can help further their career. \n\nIf you haven't already, let your oldest daughters boyfriend know he is no longer welcome or allowed in your home. If he lives with you, evict him. When filing for an eviction site, the assult on your daughter. If asked by the courts & bring a cooy of the video to show.\n\nExplain to your older daughter that she is more than welcome to join him in leaving. She did nothing to protect her sister & most likely will get upset at the boyfriend not being welcome in your home any longer.\n\nDo not discuss the case with your oldest daughter, do not discuss it with her boyfriend. Do not discuss it with anyone but the attorney or lawyer you hire. You do not need things getting back to the boyfriend or his family. Also, remember that the only conversations that are protected for your youngest daughter are those with her legal council. They can use anything said during calls or visits against her in the case. So just be careful.",
        "author": "EchidnaFit8786",
        "created_utc": 1749095225,
        "score": 11,
        "parent_id": "t3_1l3km4l",
        "depth": 0
      },
      {
        "id": "mw1s47j",
        "body": "You don’t usually see a lawyer/public defender when being arraigned* (not sentenced) unless you request one (and possibly not even then). And the DA can press charges, citizens don’t do that. They may drop the charges if you’re not going to cooperate, but if your daughter already confessed then the charges may stick. \n\nShe needs a lawyer, immediately.",
        "author": "souperman08",
        "created_utc": 1749082360,
        "score": 14,
        "parent_id": "t3_1l3km4l",
        "depth": 0
      },
      {
        "id": "mw2l0xp",
        "body": "Is this in the U.S.?\n\nSome of this doesn't make sense. She was arrested and you didn't get to talk to her? She had to have been given phone calls upon her arrest as part of the booking process. What happened with that?\n\nYou also say she didn't get to speak to a lawyer? Everyone, ESPECIALLY MINORS, get to talk to a public defender before their arraignment. Were you there for the arraignment? You say she was charged and given a probation sentence, in like 24 hours? Not likely. A public defender would have been appointed for her and denied the charges, and not waived time for a pretrial. They also would have spoken to you, her parents, at some point during all this.\n\nYou say she signed the boyfriend's \"witness statement\" that says she was the aggressor? That's not a thing. That's not something a public defender would let her do.\n\nNone of this makes sense.",
        "author": "solo_shot1st",
        "created_utc": 1749092657,
        "score": 9,
        "parent_id": "t3_1l3km4l",
        "depth": 0
      },
      {
        "id": "mw3ix1n",
        "body": "An adult choked out a minor, then got his police officer dad to contact other officers, and then basically the dad vouched for the 22yr old…\n\nYou need a lawyer NOW op,  this is above reddit pay grade",
        "author": "NeartAgusOnoir",
        "created_utc": 1749109233,
        "score": 9,
        "parent_id": "t3_1l3km4l",
        "depth": 0
      },
      {
        "id": "mw2em0y",
        "body": "please let your daughters know that men who choke/strangle women often progress to killing them.",
        "author": "skeezix58",
        "created_utc": 1749090258,
        "score": 7,
        "parent_id": "t3_1l3km4l",
        "depth": 0
      },
      {
        "id": "mw33uev",
        "body": "A little too late for OP but please for the love of everything teach your minor children to immediately ask for an attorney and their parents whenever they encounter law enforcement. I have so many questions. Why didn't she call you when the police arrived at the home? Who let them in? What is your older daughter saying?",
        "author": "britneynp1",
        "created_utc": 1749100925,
        "score": 9,
        "parent_id": "t3_1l3km4l",
        "depth": 0
      }
    ],
    "1l3juep": [
      {
        "id": "mw1gl62",
        "body": "You have an excellent case against them. In Nebraska while we have grandparent visitation, they don’t have a case because you have a constitutional right to raise your child however you want. All that being said, you should get an attorney. What county are you in?",
        "author": "Connect-Computer7933",
        "created_utc": 1749078439,
        "score": 763,
        "parent_id": "t3_1l3juep",
        "depth": 0
      },
      {
        "id": "mw1lkg8",
        "body": "I don't want to come off like this isn't serious because you should treat it like it is. Definitely get an attorney and, for sure, respond to any and all filings. \n\nBut don't lose sleep over this. The chances of them actually getting a court to force you to give visitation is slim to none. \n\nAs long as you show up to court and don't ignore it, that is. A default judgment from you not showing up is pretty much the only way they win.",
        "author": "WTAF__Trump",
        "created_utc": 1749080096,
        "score": 326,
        "parent_id": "t3_1l3juep",
        "depth": 0
      },
      {
        "id": "mw1uxmw",
        "body": "(Not your lawyer). Things to know going into your consultation with one: Did they get an attorney to sign the complaint or did they file it by themselves (“pro se”)? Have you been served? Or is this in the ‘making threats’ stage still? \nGet an attorney because if a complaint has been filed and you’ve been served, the clock is ticking for a response (called an “Answer”). Good luck.",
        "author": "000ps-Crow_No",
        "created_utc": 1749083358,
        "score": 113,
        "parent_id": "t3_1l3juep",
        "depth": 0
      },
      {
        "id": "mw1imnv",
        "body": "What’s not so good for them is your son eyewitness to him assaulting you.",
        "author": "Impreza610",
        "created_utc": 1749079112,
        "score": 97,
        "parent_id": "t3_1l3juep",
        "depth": 0
      },
      {
        "id": "mw1xfnm",
        "body": "Document everything. Put together a physical binder with copies of emails, texts, and anything involving them. Did they refer to the incident via text? Please print it out. Get the timeline on paper and if there were witnesses, get their accounts. \n\nPrepare for this to escalate. If you have daycare, teachers, anyone else involved in your child’s care, get them to write and sign off that you're a good parent, your child is hitting milestones and is happy. Get your pediatrician to sign off that your kid is up to date on vaccines, healthy and happy. If the threat of forcing visitation fails, they may escalate to accusing you of neglect/abuse. If you meet any agent with documentation from people who are mandated reporters that you are doing everything right, it will head off that line of legal attack. \n\nDon't block them because you want a paper trail. But don't engage them. Tell them to go through your lawyers if they try to force contact. \n\nIn the future, call the police and document any time someone lays hands on you, especially if it involves your child. \n\nIn Nebraska they don’t have a lot of standing to force a grandparents rights case, but dot your eyes and cross your T’s for other paths they may try.",
        "author": "ShootFrameHang",
        "created_utc": 1749084248,
        "score": 64,
        "parent_id": "t3_1l3juep",
        "depth": 0
      },
      {
        "id": "mw2nqxx",
        "body": "If it makes you feel better, it's pretty unheard of for grandparents to actually win visitation when their child is still alive and being a good parent. Grandparents rights were meant for when THEIR child dies and the surviving parent won't let them see their grandchild. They are not for when the parent goes NC, especially for legitimate reasons, and the grandparents don't like the consequences of their actions. \n\nLike everyone else said, if you're served, don't ignore it, but until then, it's the cheapest thing in the world to threaten suit, so don't lose sleep. Definitely make sure your son's daycare/school, doctor's office, wherever your son might be looked after knows that your parents are NOT authorized to do anything for or with him.",
        "author": "Educational_Rice_109",
        "created_utc": 1749093732,
        "score": 28,
        "parent_id": "t3_1l3juep",
        "depth": 0
      },
      {
        "id": "mw2lep4",
        "body": "I would go down to the local police station and see if you can file a report against your parents retroactively for assaulting you in front of your child and trying to keep him from you. Tell them you don't necessarily want to pursue charges but you want everything on record- here's copies of the pictures of the bruises with timestamps and can I please have a copy of the report number?",
        "author": "MaskedCrocheter",
        "created_utc": 1749092804,
        "score": 16,
        "parent_id": "t3_1l3juep",
        "depth": 0
      },
      {
        "id": "mw37rnk",
        "body": "Make sure your sons school and/or daycare or after-school care knows not to let your son leave with them. They already tried to withhold him from you and may try again(or kidnap him) especially if they used to be designated pick up at either of those places. Definitely try to file the police report after talking to the family lawyer. I'm really sorry this is happening to you and I hope you are doing well besides this.",
        "author": "Fanfictionaddict13",
        "created_utc": 1749102954,
        "score": 11,
        "parent_id": "t3_1l3juep",
        "depth": 0
      },
      {
        "id": "mw36tip",
        "body": "Your son witnessed a domestic assault. This is federally child abuse.",
        "author": "Superyear-",
        "created_utc": 1749102462,
        "score": 6,
        "parent_id": "t3_1l3juep",
        "depth": 0
      },
      {
        "id": "mw37dl5",
        "body": "Go to the police department and file a restraining order against them. Show them the pictures and hopefully there was a neighbor or a family member involved that could be a potential witness in your favor. \n\nDocument and print any texts, schedules, dates, etc. Make sure that you have the dates right, otherwise they will have an alibi if they were in a different location on the date you documented it.",
        "author": "Superyear-",
        "created_utc": 1749102750,
        "score": 5,
        "parent_id": "t3_1l3juep",
        "depth": 0
      },
      {
        "id": "mw3twkh",
        "body": "Make an appointment with a family law attorney",
        "author": "Devi_Moonbeam",
        "created_utc": 1749115883,
        "score": 2,
        "parent_id": "t3_1l3juep",
        "depth": 0
      }
    ],
    "1l3duor": [
      {
        "id": "mw03ibg",
        "body": "Have you been arrested? Have you been contacted by the police? If not, I wouldn’t worry about it. If the cops want to talk to you, don’t. Tell them you don’t speak to police without you lawyer present and then zip it.",
        "author": "Sunshine_coaster",
        "created_utc": 1749063781,
        "score": 1250,
        "parent_id": "t3_1l3duor",
        "depth": 0
      },
      {
        "id": "mw042oj",
        "body": "We can’t know what happens here.  If you’re contacted by police, as stupid as it sounds, you need to politely decline to answer questions and get a lawyer.  \n\nThis charge often turns out to be surprisingly substantial.  Like sometimes sex offender registry substantial.  That obviously sounds stupid for a pregnant lady in an urgent need to pee.  But I’d want sound legal counsel in trying to get to that outcome.",
        "author": "reddituser1211",
        "created_utc": 1749063944,
        "score": 728,
        "parent_id": "t3_1l3duor",
        "depth": 0
      },
      {
        "id": "mw04e8p",
        "body": "He’s free to notify the police, who may or may not investigate.  I suspect that public urination in a liquor store parking lot is going to be low on the list of priorities. \n\nI’ve often seen pregnant women at liquor stores.  I don’t think anyone cares, as women tend to do the bulk of household shopping.  If this is your first child, know that you’re going to get judged no matter what you do (breastfeed in public, bottle feed in public, tantrums, electronics, sweets, food pouches, etc), so this is a good time to develop a “DGAF” attitude.",
        "author": "shamrock327",
        "created_utc": 1749064037,
        "score": 403,
        "parent_id": "t3_1l3duor",
        "depth": 0
      },
      {
        "id": "mw054a6",
        "body": "If you are in NYC...the police won't be contacting you...they just won't.\n\nBUT...the off chance you are contacted, refuse to answer questions unless you have a lawyer present.\n\nCongratulations on the baby, I hope your term is successful.",
        "author": "DaveDL01",
        "created_utc": 1749064247,
        "score": 340,
        "parent_id": "t3_1l3duor",
        "depth": 0
      },
      {
        "id": "mw0eohc",
        "body": "You’re in NY where the cops don’t do shit, you’ll be fine. If they do reach out to you? Get a lawyer and don’t talk to the police. But you’ll more than likely be okay.",
        "author": "gold-exp",
        "created_utc": 1749066983,
        "score": 67,
        "parent_id": "t3_1l3duor",
        "depth": 0
      },
      {
        "id": "mw0cxlr",
        "body": "Why did they scan your id if you didn’t buy alcohol?",
        "author": "Casual_Bitch_Face",
        "created_utc": 1749066484,
        "score": 57,
        "parent_id": "t3_1l3duor",
        "depth": 0
      },
      {
        "id": "mw07qv9",
        "body": "Didn't new york change the law on public urination? Granted this was a million years ago at this point, but on a drunken night i peed outside (wont get into the details because the whole story is crazy lol), and some cops caught me. They issued me what i thought was a fine, but nope. It was a summons to appear in court. After much research i realized there were 2 laws you can get hit with when it comes to public urination. The first is a $50 fine and explicitly mentions public urination. The other is a misdemeanor and does NOT specifically mention public urination, but is a common one police use for public urination. It says something like no disposing of disgusting liquids on the street or something like that. Anyways because too many cops were using the 2nd violation as opposed to the first it was increasing the crime statistics of new york and they changed it to where for public urination it is only the $50 fine and NOT the misdemeanor. You'll be ok, even if the cops come knocking on your door.",
        "author": "Meekrobb",
        "created_utc": 1749064994,
        "score": 50,
        "parent_id": "t3_1l3duor",
        "depth": 0
      },
      {
        "id": "mw0d46p",
        "body": "Plenty of good legal advice here.  But a practical suggestion...a Loona or other portable urinal designed for women that you can keep in your car.",
        "author": "Taracat",
        "created_utc": 1749066536,
        "score": 36,
        "parent_id": "t3_1l3duor",
        "depth": 0
      },
      {
        "id": "mw0dtez",
        "body": "You’re probably fine, but be aware that this can get you on the sex offender registry.",
        "author": "quizzicalturnip",
        "created_utc": 1749066736,
        "score": 26,
        "parent_id": "t3_1l3duor",
        "depth": 0
      },
      {
        "id": "mw0i309",
        "body": "NEVER TALK TO THE POLICE.  They are not your friends.  They do not serve the public.  They will never help you.",
        "author": "Separate_Custard_754",
        "created_utc": 1749067977,
        "score": 19,
        "parent_id": "t3_1l3duor",
        "depth": 0
      },
      {
        "id": "mw0gcsz",
        "body": "OP, IANAL, but I believe NY does not allow police to issue any kind of citation for a misdemeanor crime unless they saw it themselves or have a warrant. Something to look into at least!",
        "author": "GeorgePBurdellXXIII",
        "created_utc": 1749067476,
        "score": 13,
        "parent_id": "t3_1l3duor",
        "depth": 0
      },
      {
        "id": "mw0c9y4",
        "body": "Cops aren’t coming after you. It’s not worth their time.",
        "author": "n00bz",
        "created_utc": 1749066294,
        "score": 7,
        "parent_id": "t3_1l3duor",
        "depth": 0
      },
      {
        "id": "mw0e6va",
        "body": "Don’t talk to the police voluntarily. If they contact you say you won’t answer any questions without a lawyer and hang up",
        "author": "Tendy_taster",
        "created_utc": 1749066843,
        "score": 8,
        "parent_id": "t3_1l3duor",
        "depth": 0
      },
      {
        "id": "mw0a38a",
        "body": "Nothing is gonna happen.",
        "author": "No_Profit_415",
        "created_utc": 1749065668,
        "score": 5,
        "parent_id": "t3_1l3duor",
        "depth": 0
      },
      {
        "id": "mw0h2jm",
        "body": "You shouldn't worry too much about it. I know you said new york state, but if it happens to be in NYC it's considered a violation (ticket) and cops would have to visually observe it for any type of enforcement.\n\nNot sure what it would be in NYS depending on the area you're in but I'd figure it would be similar. So don't stress over it",
        "author": "Dirtykilla",
        "created_utc": 1749067686,
        "score": 5,
        "parent_id": "t3_1l3duor",
        "depth": 0
      },
      {
        "id": "mw0c6vd",
        "body": "They won’t do anything please. I mean they act like they gonna do smth but they won’t.",
        "author": "NY10",
        "created_utc": 1749066270,
        "score": 2,
        "parent_id": "t3_1l3duor",
        "depth": 0
      },
      {
        "id": "mw07h2y",
        "body": "I doubt anything will come of it. More or less a scare tactic because him being a liquor store worker… he’s probably seen a lot crazier shit than you peeing because you had to.",
        "author": "OneSlowEvoX",
        "created_utc": 1749064917,
        "score": 2,
        "parent_id": "t3_1l3duor",
        "depth": 0
      }
    ],
    "1l3gzfb": [
      {
        "id": "mw0tlky",
        "body": "It’s not defamation of character if it’s true. Let the police do their job and investigate. As for the “ruining lives” bit, that’s called a threat. You can take that to the police. He defamed his own character there, and in an easily accessible way to gather evidence. Screenshot before he wisens up and deletes it.",
        "author": "GoBeWithYourFamily",
        "created_utc": 1749071234,
        "score": 503,
        "parent_id": "t3_1l3gzfb",
        "depth": 0
      },
      {
        "id": "mw10f5l",
        "body": "NAL but you said“My car keys (which I later found, but they had been disassembled)” One of them may have made a copy of your house/apartment keys. Even if they only took a picture of them they can make a copy. They have your address from your ID or something else in your purse. It would be a good idea to change your locks.",
        "author": "Gasted_Flabber137",
        "created_utc": 1749073298,
        "score": 336,
        "parent_id": "t3_1l3gzfb",
        "depth": 0
      },
      {
        "id": "mw0txon",
        "body": "Report them.  Stick to facts, and let the police do their jobs.  Don’t accuse or single out what you don’t know, and let it play out.  \n\nAlso, report the threat to the police.",
        "author": "CalmInteraction884",
        "created_utc": 1749071334,
        "score": 149,
        "parent_id": "t3_1l3gzfb",
        "depth": 0
      },
      {
        "id": "mw0x5oc",
        "body": "Your next steps are to take these new messages straight to the police who handled the original complaint.  \n\nIt would also be a good idea to ensure your friend has changed the code to her garage.",
        "author": "jps_",
        "created_utc": 1749072300,
        "score": 36,
        "parent_id": "t3_1l3gzfb",
        "depth": 0
      },
      {
        "id": "mw0wm62",
        "body": "NAL, not defamation if it's true. He's digging himself a deeper hole by intimidating you also, so definitely screenshot that.",
        "author": "CharlesGnarwin73",
        "created_utc": 1749072137,
        "score": 15,
        "parent_id": "t3_1l3gzfb",
        "depth": 0
      },
      {
        "id": "mw11ppr",
        "body": "Go to police with all of this.  Your friend is not too bright either letting people like this in the house.  🤦‍♂️",
        "author": "FritosportRacingTEAM",
        "created_utc": 1749073696,
        "score": 12,
        "parent_id": "t3_1l3gzfb",
        "depth": 0
      },
      {
        "id": "mw20cpi",
        "body": "Press charges. If he is stealing out your purse, he has no money for a civil charge.",
        "author": "Classic_Coconut_7613",
        "created_utc": 1749085263,
        "score": 10,
        "parent_id": "t3_1l3gzfb",
        "depth": 0
      },
      {
        "id": "mw128sv",
        "body": "dude what kind of friends are these? were they roving thugs? what the hell.",
        "author": "Sheepherder-Optimal",
        "created_utc": 1749073859,
        "score": 9,
        "parent_id": "t3_1l3gzfb",
        "depth": 0
      },
      {
        "id": "mw1en0m",
        "body": "Adding to the good advice here, I'd add contacting their employer at the highest level and reporting the charge, as there is likely a log on record of who made the attempted charge with your card.",
        "author": "Queasy-Passion5534",
        "created_utc": 1749077806,
        "score": 8,
        "parent_id": "t3_1l3gzfb",
        "depth": 0
      },
      {
        "id": "mw1wvrg",
        "body": "File for a restraining order against as many of them as you can.\nPress all the charges you can.\nChange all your locks, including in your car.\nKeep all info in a safe place.\nPut Identity Theft locks on your bank accounts (can be asked for in person at your bank) & lock your cards (many can be done in their apps). You simply unlock before a purchase & lock right after it’s approved & the receipt is printed.\n\nIf you wouldn’t have pressed charges, many card companies & banks won’t refund any fraudulent charges to begin with, so a police report needed to happen so you wouldn’t be liable for that charge.\n\nGet protection & stay vigilant about your surroundings everywhere. ALWAYS lock your home up, even if you’re there. Hopefully, these cretins will get what’s due them soon, but you have to now get into protection mode for yourself.\n\nAnd I hope your friend learned her lesson about giving away access to her home when she’s not there, as well as you leaving your personal things somewhere - who goes anywhere without their ID? Let this be a lesson to you both & stop trusting people like this.",
        "author": "AnnoyedHoneyBadger",
        "created_utc": 1749084056,
        "score": 9,
        "parent_id": "t3_1l3gzfb",
        "depth": 0
      },
      {
        "id": "mw1abyg",
        "body": "Amend the police report with the threats.  Now if anything happens to you or your shit, there are suspect #1",
        "author": "VictoriaEuphoria99",
        "created_utc": 1749076404,
        "score": 8,
        "parent_id": "t3_1l3gzfb",
        "depth": 0
      },
      {
        "id": "mw0zn00",
        "body": "Let the police know and ask if you can press charges.",
        "author": "hundredpercenthuman",
        "created_utc": 1749073059,
        "score": 3,
        "parent_id": "t3_1l3gzfb",
        "depth": 0
      },
      {
        "id": "mw1oaye",
        "body": "You can not sue for defamation if there is a reasonable suspition and you are not putting out that infomation to the public. You always have the right to pursue charges against someone.",
        "author": "Historical-Spirit-48",
        "created_utc": 1749081026,
        "score": 3,
        "parent_id": "t3_1l3gzfb",
        "depth": 0
      },
      {
        "id": "mw1tcp9",
        "body": "Him threatening you is a crime. If you are scared for your personal safety, he committed assault.  Glad you saved everything.",
        "author": "realdietmrpibb",
        "created_utc": 1749082796,
        "score": 3,
        "parent_id": "t3_1l3gzfb",
        "depth": 0
      },
      {
        "id": "mw2blox",
        "body": "All of the advice here is great. Please utilize everything you can to secure yourself and stay protected. \n\nHere’s an idea I haven’t seen yet. Are you able to keep your car in a neighbors garage, or garage of a friend? It’s harder to steal if they can’t locate the car at your address. Catch rides with friends (not the one from your story) or coworkers to get around for a few days. I don’t know if it’s possible, but also contact your DMV to see if you can get a new license plate for your car. Remove any identifying decals or add some new ones so they don’t think it’s the same car. \n\nLastly, do not tell your friend from this story anything, in case they relay any information back to the thieves. Wishing you best of luck, OP.",
        "author": "allieechelon",
        "created_utc": 1749089196,
        "score": 3,
        "parent_id": "t3_1l3gzfb",
        "depth": 0
      },
      {
        "id": "mw36tdd",
        "body": "You need to go back to the police and tell them about the threats. That is another crime. Witness intimidation.",
        "author": "oldmasterluke",
        "created_utc": 1749102459,
        "score": 3,
        "parent_id": "t3_1l3gzfb",
        "depth": 0
      },
      {
        "id": "mw1thms",
        "body": "Fortunately for you these are not very bright. Report the threat asap. Let the police determine which one is guilty or if they all are. Also it’s not defamation for reporting a crime that happened. I hope you get some justice.",
        "author": "CelebrationBulky9970",
        "created_utc": 1749082844,
        "score": 2,
        "parent_id": "t3_1l3gzfb",
        "depth": 0
      },
      {
        "id": "mw1wo63",
        "body": "I’d still file charges.  But I’m old and dgaf. YMMV",
        "author": "restlessmonkey",
        "created_utc": 1749083980,
        "score": 2,
        "parent_id": "t3_1l3gzfb",
        "depth": 0
      },
      {
        "id": "mw3jhdb",
        "body": "Add terroristic threatening to the charges.  Give the messages to the cops and have the dude arrested.  He's basically admitted guilt.\n\nChange your locks, now, today, not tomorrow.\n\nIf they \"disassembled\" your keys they probably have your house key, and they have your address from your license.",
        "author": "wintremute",
        "created_utc": 1749109573,
        "score": 2,
        "parent_id": "t3_1l3gzfb",
        "depth": 0
      }
    ],
    "1l3ej4l": [
      {
        "id": "mw0dtoe",
        "body": "Is this a new car dealership?   If it is, contact the corporate parent and tell them what's going on.  Also, take your car some place else to get serviced.\n\nAs to paying the bill, if they didn't do what you took the car in for, then why would you pay them?   Ignoring the rest of the story, you only owe them if they performed the services you asked them to do. \n\nThe stolen car thing and dropping the car off at a different place are outrageous, but unless you suffered some sort of harm, you're not entitled to payment.",
        "author": "Bob_Sconce",
        "created_utc": 1749066738,
        "score": 320,
        "parent_id": "t3_1l3ej4l",
        "depth": 0
      },
      {
        "id": "mw09r99",
        "body": "Call an attorney",
        "author": "Honest_Cook_8795",
        "created_utc": 1749065571,
        "score": 81,
        "parent_id": "t3_1l3ej4l",
        "depth": 0
      },
      {
        "id": "mw26tmt",
        "body": "Living in Omaha working on cars I gotta know which dealership brand because if it's my direct competition I'm definitely bringing this up when customers ask why they should come to me over the dealership lmao",
        "author": "Weary-Astronaut1335",
        "created_utc": 1749087533,
        "score": 55,
        "parent_id": "t3_1l3ej4l",
        "depth": 0
      },
      {
        "id": "mw2sq1m",
        "body": "Contact a personal injury attorney. Most do free consultations and work on contingency (they only take a percentage of whatever they get you). If you’re having trouble finding a personal injury attorney in your area, check advertisements on busses, bus stops, and billboards. Usually some dude with a goofy looking face.",
        "author": "Street-Baseball8296",
        "created_utc": 1749095772,
        "score": 7,
        "parent_id": "t3_1l3ej4l",
        "depth": 0
      },
      {
        "id": "mw23fsl",
        "body": "Call an attorney and screw these guys and get compensation. This gotta to be a joke.",
        "author": "NY10",
        "created_utc": 1749086341,
        "score": 6,
        "parent_id": "t3_1l3ej4l",
        "depth": 0
      },
      {
        "id": "mw30elw",
        "body": "Take your vehicle to another shop. They will diagnose it with the same issue it had before, you'll pay them for their services, and now you have an invoice that proves the last guys didn't do their job. If they contact you, you tell them to get fucked please see attached.\n\nI don't think the local news would be interested unless you have a juicy video of the cops outside your house. If you're still feeling sour, you could leave a google review. As you get older you'll realize that these things happen more often than not, and you're rarely made whole.",
        "author": "fleshworks",
        "created_utc": 1749099228,
        "score": 4,
        "parent_id": "t3_1l3ej4l",
        "depth": 0
      }
    ],
    "1l33kqn": [
      {
        "id": "mvxq82s",
        "body": "Your parents should hire an attorney, and likely an accountant, immediately.  Depending on the situation, some of that debt might be dischargeable.  But, if your parents gave him permission to handle their affairs and he screwed up, your options now are limited.",
        "author": "ApprehensiveEarth659",
        "created_utc": 1749038252,
        "score": 2795,
        "parent_id": "t3_1l33kqn",
        "depth": 0
      },
      {
        "id": "mvy0em5",
        "body": "I applaud your wanting to help your parents in this awful situation, and hiring an attorney to determine the options is a good first step. But I have a caveat….your parents need to take over their financial reins, not you. It’s fine to guide them, and be present during meetings, but it appears they evaded their financial responsibilities when your brother took over, for whatever reason. You earned your space, make sure you keep it.",
        "author": "Gypsymoth606",
        "created_utc": 1749042037,
        "score": 885,
        "parent_id": "t3_1l33kqn",
        "depth": 0
      },
      {
        "id": "mvxs95m",
        "body": "500k debt might be worth filing bankruptcy over, they should talk to an attorney about it and see if it'll work for them.",
        "author": "SwoleProle_1917",
        "created_utc": 1749039058,
        "score": 551,
        "parent_id": "t3_1l33kqn",
        "depth": 0
      },
      {
        "id": "mvxuy90",
        "body": "Sorry you’re having to deal with all of this. Your parents will likely need to continue working longer.  You can pay your parents a reasonable monthly rent, but don’t sacrifice your finances by offering other money. \n\nYour parents can approach the credit card companies to see if they can reach a settlement.  A credit counselor may help with this process to aid in settling with credit card companies.",
        "author": "elliottbtx",
        "created_utc": 1749040091,
        "score": 145,
        "parent_id": "t3_1l33kqn",
        "depth": 0
      },
      {
        "id": "mvy3szy",
        "body": "You need help because you’ve got multiple issues, you most likely need to consult a bankruptcy attorney and to NOT do anything until you have advice.\n\nFirst, student loans are discharged on death. \n\nSecond, the credit cards are a fraud issue and since your brother is dead they can be dealt with without sending a close relative to jail. \n\nThird, after you’ve done things you often can’t make changes to reduce taxes.  On the house taxes will be less than 37.5% it should be 20% or $160.  However had you gotten advice you could have had that amount substantially reduced or deferred, for instance if your parents had moved back into that house for two years they could have avoided taxes on $500k of gains at a 20% tax rate that’s $100k in tax savings or $4k a month.\n\nI will add, knowing how to navigate this is far beyond most people’s ability.  Many people wouldn’t actually reach out asking for advice on how to deal with this.  You’re doing great on being thoughtful about dealing with this after a tragic family loss.",
        "author": "johnrgrace",
        "created_utc": 1749043197,
        "score": 116,
        "parent_id": "t3_1l33kqn",
        "depth": 0
      },
      {
        "id": "mvxuzgo",
        "body": "Why are your parents involving you in this? Why do you need to move back in with them to help them deal with this? \n\nFYI, it's not typical of capable parents to have a child move in to help them take care of finances. It doesn't sound healthy either. You're not even an expert in finance, I'm not clear on how this became your business.",
        "author": "Myfavoritethr0waway",
        "created_utc": 1749040104,
        "score": 94,
        "parent_id": "t3_1l33kqn",
        "depth": 0
      },
      {
        "id": "mvy5xo4",
        "body": "A police report needs to be filed. Since the charges are fraud that means that you should be able to get them dismissed. However you want to try to find a lawyer that specializes in this. They might not have nearly as much debt as they think. Since he has died you do not need to pay his student loans. You do not need to pay for any of his credit cards. And once the fraud filings are made for the credit cards he took out in your parents name that should dismiss that debt as well. \n\n\nTry not to panic. Just breathe. But most important do not let them pay a cent on any of it! If they pay any money on it then they can become liable for it even if they weren't before. Do not pay! Talk to an attorney first.",
        "author": "SeekersChoice",
        "created_utc": 1749043906,
        "score": 83,
        "parent_id": "t3_1l33kqn",
        "depth": 0
      },
      {
        "id": "mvy6kom",
        "body": "Definitely lawyer up. \n\n I have a feeling more revelations about your brother are to come. As an accountant, he likely had access to who knows how many clients' finances.",
        "author": "PayNo7472",
        "created_utc": 1749044117,
        "score": 66,
        "parent_id": "t3_1l33kqn",
        "depth": 0
      },
      {
        "id": "mvyhh12",
        "body": "Best thing I can say first talk to a lawyer....no one else.",
        "author": "__Salahudin__",
        "created_utc": 1749047419,
        "score": 37,
        "parent_id": "t3_1l33kqn",
        "depth": 0
      },
      {
        "id": "mvzcdj4",
        "body": "Parents need a lawyer probably much sooner than yesterday. It would be one thing if he was stealing money on their cards, but if he was doing all their bills.... your parents definitely need a lawyer. It's not a good sign that he was \"in charge\" of their bills and then killed himself with that kind of debt. Be prepared that what you see isn't all of it.\n\nAll that said, your siblings shenanigans, however intended they were, ARE NOT YOUR BURDEN. Help your parents, support them, but THEY left him their money to manage, not you. You make 50k, you need that 50k FOR YOU.\n\nI'm sorry for your loss. Sibling death for any reason is rough.",
        "author": "imperial_scum",
        "created_utc": 1749056192,
        "score": 41,
        "parent_id": "t3_1l33kqn",
        "depth": 0
      },
      {
        "id": "mvyff4c",
        "body": "Let me just say, I'm really sorry. You must be feeling a LOT of things toward your brother who is now gone. A real mixture of loss and anger I would bet. That's such a sad situation. I wanna say, I'm really glad your parents have you. You are trying to help them out and that says so much",
        "author": "Fabulous-Evening9188",
        "created_utc": 1749046822,
        "score": 12,
        "parent_id": "t3_1l33kqn",
        "depth": 0
      },
      {
        "id": "mvyugo3",
        "body": "Important note: Check on the brother's student loan terms. Even with a cosigner, most loan agencies have a debt removal process in the event of sudden death (including suicide).\n\nAs for the taxes, I think there is a 500k capital gains exemption for selling a primary residence (married filing jointly). [link](https://www.irs.gov/taxtopics/tc701), not sure if that applies to your family, but it is something important to know about.",
        "author": "HumbleGoatCS",
        "created_utc": 1749051128,
        "score": 12,
        "parent_id": "t3_1l33kqn",
        "depth": 0
      },
      {
        "id": "mvya0ty",
        "body": "Why was a 32 year old ‘in charge’ of everything?",
        "author": "Critical-Degree-1354",
        "created_utc": 1749045201,
        "score": 16,
        "parent_id": "t3_1l33kqn",
        "depth": 0
      },
      {
        "id": "mvy2gtl",
        "body": "As others have said, it's time to lawyer up, or at the very least talk to a financial consultant. I'm sorry for your loss, you're obviously not at fault, but I cannot fathom why in the world your parents would entrust their financial future to your brother. Unfortunately this sounds like a real bonehead move from your parents. Only you should ever be responsible for your finances, and only under extenuating circumstances should you ever sign them off to another individual. You'd be a good person for dropping everything to help your parents, but if you were my kid, I'd tell you to live your life and let me clean up my mess.",
        "author": "Rickz6",
        "created_utc": 1749042746,
        "score": 10,
        "parent_id": "t3_1l33kqn",
        "depth": 0
      },
      {
        "id": "mvy6pm3",
        "body": "If they didn't make the purchases, they can actually fight the credit card companies. Get a lawyer.It'll be much easier and they can help you lower that amount.A lot",
        "author": "nolongerabell",
        "created_utc": 1749044162,
        "score": 7,
        "parent_id": "t3_1l33kqn",
        "depth": 0
      },
      {
        "id": "mvycaog",
        "body": "I'm really sorry you are going through this. \n\n\nFrom someone whos had their whole life upended with their families recklessness, i suggest very highly you dont move back home. There is nothing you will be able to do in their home that you cant do from your home. Mainly because you are in attorney territory and it would benefit your parents in almost every way to get legal counsel.",
        "author": "iRasha",
        "created_utc": 1749045893,
        "score": 7,
        "parent_id": "t3_1l33kqn",
        "depth": 0
      },
      {
        "id": "mvzb6aj",
        "body": "Talk to a lawyer. Your brother committed ID theft and fraud against your patents. There may be ways to mitigate the damage.",
        "author": "karebear66",
        "created_utc": 1749055861,
        "score": 5,
        "parent_id": "t3_1l33kqn",
        "depth": 0
      },
      {
        "id": "mw1oi72",
        "body": "Not a lawyer, but I am a member of the dead siblings club. My sister unexpectedly died at age 26. She had student loans, credit card debt, bank accts, a car loan, hospital bills, and a life insurance policy through work. Our hands were tied because she had no will, so we hired a probate lawyer. \n\nShe told us not to pay the outstanding bills. Because my sister was not a dependent, bill collectors could do nothing but threaten us - and threaten they did. They harassed me on my work phone number and even called her fiancé’s parents demanding payment. We were told to nicely say, “sorry, we can’t help you.” Consult a lawyer first. \n\nGoing through probate got us the death certificate. With it, we could close out her bank accounts and collect her life insurance. \n\nStart by hiring a probate lawyer. They can help guide you on how to proceed to protect your parents assets.",
        "author": "Weak-End8864",
        "created_utc": 1749081095,
        "score": 6,
        "parent_id": "t3_1l33kqn",
        "depth": 0
      },
      {
        "id": "mvy5fvi",
        "body": "Maybe it's just knowing that most parents want a better life for them then what they have, but I would take an extended vacation to help sort this out set them up with an advisor/lawyer, and an accountant. If they’re 65 and sounds like they're mental strong and physical if they're still working, then they're more then capable of handling this situation that arrose out of their life choices. You can be there emotionally but you shouldn’t put your career on hold especially when we are headed towards a recession within the next 10 years. You need to be building your career so when you have to help in elderly years when mental and physical decline happen you can.",
        "author": "Electronic-Berry-503",
        "created_utc": 1749043741,
        "score": 6,
        "parent_id": "t3_1l33kqn",
        "depth": 0
      },
      {
        "id": "mvydswf",
        "body": "I'll start by reiterating what everyone else here said: your parents need to get an attorney ASAP. I would probably say they should file for bankruptcy, but before they do that, put their house in a trust with you as the beneficiary. This would protect the house from creditors and potentially seizure from bankruptcy (although this is fairly uncommon now anyway, at least in CA).",
        "author": "Mr_Attorney_General",
        "created_utc": 1749046345,
        "score": 6,
        "parent_id": "t3_1l33kqn",
        "depth": 0
      }
    ],
    "1l3n3zf": [
      {
        "id": "mw33hyj",
        "body": "Unfortunately, this type of pace is quite normal. \n\nLA County's district attorney office has a Bureau of Victim Services which you can contact, they may be able to give you more information.",
        "author": "CostRains",
        "created_utc": 1749100751,
        "score": 30,
        "parent_id": "t3_1l3n3zf",
        "depth": 0
      },
      {
        "id": "mw36xo4",
        "body": "This is horrible all around I'm so sorry you're going through all this. Sadly I'm not surprised, LAPD and LASD are each like an organized criminal organization I would report this to the California OIG and the federal OIG too. It should not take this long for some answers.",
        "author": "bellako-dev",
        "created_utc": 1749102522,
        "score": 13,
        "parent_id": "t3_1l3n3zf",
        "depth": 0
      },
      {
        "id": "mw3acko",
        "body": "Yes, it is normal. Work on these kinds of cases often progresses sequentially. Who said that “proof in one swab area isn’t enough?” The DA?\n\nOne thing to be aware of is that specific charges exist for specific acts. The DNA may prove some charges but not all. When you write “genital area” that could be an external genital swab. That would prove sexual battery, but the legal definition of rape is different. \n\nI understand this is frustrating and confusing. In addition to LA County’s services for rape victims, the California Department of Justice has a victim services unit that may be able to help you.",
        "author": "FjordReject",
        "created_utc": 1749104334,
        "score": 9,
        "parent_id": "t3_1l3n3zf",
        "depth": 0
      }
    ],
    "1l3hxkj": [
      {
        "id": "mw2is87",
        "body": "Does the info on the ticket match yours exactly or is the DMV just getting confused by someone else with a similar name to yours? If it’s the former, you might be able to point out the difference at the DMV and get some sort of note added to your file. If it’s the latter, someone else probably gave the cops your info to avoid getting in trouble. I’d start by contacting my state senators and representatives for help.",
        "author": "k_dubious",
        "created_utc": 1749091803,
        "score": 28,
        "parent_id": "t3_1l3hxkj",
        "depth": 0
      }
    ],
    "1l3j1b2": [
      {
        "id": "mw1g1nh",
        "body": "Since you're in Washington state, I would consider going through small claims court. You can do this on your own and has a $10k limit. Tally all the expenses up, get as much documentation, and file the paperwork.\n\nClearly, the police officers are trying to prevent this from moving forward in criminal court. But you can still go through the civil court.\n\nYou can also attempt to reach out to the prosecutors office about the situation. The officers may be attempting to prevent this from making it to their office. If that's the case, they would likely want to know about it.",
        "author": "SnooDonkeys1093",
        "created_utc": 1749078260,
        "score": 83,
        "parent_id": "t3_1l3j1b2",
        "depth": 0
      },
      {
        "id": "mw1hdt6",
        "body": "I suggesting following up on the various things you just dropped. Be the squeaky wheel.\n\nText \"John\" weekly saying you still haven't heard back on his earlier promise. You may think it's not his responsibility, but let him say that. (And if he has his dad's power of attorney or has some other legal responsibility for his dad's affairs, perhaps it's his responsibility after all.)\n\nEmail Officer Alex about his refusal to press charges, and say you're still waiting for that confirming email he promised to send. Cc his boss if you can.\n\nPreserve the day's worth of camera footage, and if you think it's too large to send, ask in a tech forum about how to send large files (if googling the best method is insufficient). Then send it to Officer Alex as he requested. You're not the first person asked to send a day's worth of video to the police.\n\nAnd talk directly to the DA's office about your desire to press charges. Don't take legal advice (\"the case is was likely to be dismissed: he said Peter was mentally unfit to defend himself\") from the police; they're not qualified to give it.",
        "author": "TinyNiceWolf",
        "created_utc": 1749078701,
        "score": 40,
        "parent_id": "t3_1l3j1b2",
        "depth": 0
      },
      {
        "id": "mw2eso8",
        "body": "Suggest that you are feeling like there is a collaboration between Peter's son John and the police officer.  Explain that you are not going to pay this yourself, but do feel empathy for John.  Explain that John must pay for the claim if not his father doesn't, otherwise you are going to be including internal affairs with all of the correspondence.  If John lives with his father, John's policy may pay for the damage.\n\nEdit: NAL",
        "author": "CorgiManDan",
        "created_utc": 1749090327,
        "score": 16,
        "parent_id": "t3_1l3j1b2",
        "depth": 0
      },
      {
        "id": "mw2p07i",
        "body": "Go to the police station and ask for a supervisor and tell him that xx police officer is refusing to let you file a report and charges against that person. This is because he is the father of another police officer.  Tell him you want to file and no is not an answer.  Then contact a few local news outlets and tell them what is going on, that this guy is a menace to the neighborhood and since his son has a police officer they refuse to do anything.  Tell them the name of the officer you spoke to.",
        "author": "18k_gold",
        "created_utc": 1749094246,
        "score": 18,
        "parent_id": "t3_1l3j1b2",
        "depth": 0
      },
      {
        "id": "mw325sq",
        "body": "Press charges now.",
        "author": "Classic_Coconut_7613",
        "created_utc": 1749100086,
        "score": 4,
        "parent_id": "t3_1l3j1b2",
        "depth": 0
      },
      {
        "id": "mw3lzei",
        "body": "As others have said it seems like there may be some kind of blue brother hood going on trying to keep charges from being filed. Two things, first journal all of your interactions with the officer (dated, handwritten, and chronologically in a bound journal). Second charges are simply the official documentation that Peter has a problem. The real solution is to sue both Peter and John jointly in small claims court. Bring copies of cases that have been opened for Peter’s vandalism (even if no charges were filed) the judge and for the defendants. \n\nYou are trying to show that John knew his father needed to be put somewhere safe (see previous cases as evidence) and since he didn’t that he is responsible to pay for the repairs. The officer on the current case told you (see journal entry) that John has been meaning to put him in a home so this stops happening. If John is a police officer the last thing he is going to do is perjure himself over a small claims case (his career would be over). \n\nThe real solution is not charges. The judge will hopefully see that John is ignoring the issues and manipulating the system against you to keep both Peter and himself from being liable for these actions. He cannot have it both ways. Either Peter needs to be hospitalized and John is his guardian (thus liable) or Peter is of sound mind and is liable himself for these actions damages. Either way one of them is paying you for the damage to your car. So let John and the judge sort it out before you leave.",
        "author": "GodCoderImposter",
        "created_utc": 1749111068,
        "score": 3,
        "parent_id": "t3_1l3j1b2",
        "depth": 0
      }
    ],
    "1l3fzay": [
      {
        "id": "mw0mha3",
        "body": "> I had to leave my contact info and scan a badge to take the elevator to the roof. \n\nIt would be you and a dozen other people, including whoever set the traps. It will be impossible to prove that it was you. Thank you for helping to put an end to this cruelty.",
        "author": "okayfriday",
        "created_utc": 1749069214,
        "score": 43,
        "parent_id": "t3_1l3fzay",
        "depth": 0
      },
      {
        "id": "mw2ymvk",
        "body": "Make an anonymous report but detailed enough for them to take seriously. How could they prove to your employer it was you who reported if you don’t leave your name? No “face” no case",
        "author": "1O1O1O1O1O1O1O",
        "created_utc": 1749098390,
        "score": 3,
        "parent_id": "t3_1l3fzay",
        "depth": 0
      }
    ],
    "1l3ayf8": [
      {
        "id": "mvzfltm",
        "body": "Let the blood draw shake out. If he was sober, that should reflect his honesty.\n\nThat said, if he's wandering in his lane regularly, he probably shouldn't be driving.",
        "author": "WoodenInternet",
        "created_utc": 1749057091,
        "score": 390,
        "parent_id": "t3_1l3ayf8",
        "depth": 0
      },
      {
        "id": "mvzipr9",
        "body": "Never agree to do the field sobriety. You will not pass. It is designed to make you fail. He needs to shut up and get a lawyer.",
        "author": "Revolutionary-pawn",
        "created_utc": 1749057944,
        "score": 62,
        "parent_id": "t3_1l3ayf8",
        "depth": 0
      },
      {
        "id": "mw027ka",
        "body": "Your friend needs an attorney",
        "author": "StanUrbanBikeRider",
        "created_utc": 1749063412,
        "score": 47,
        "parent_id": "t3_1l3ayf8",
        "depth": 0
      },
      {
        "id": "mw09e41",
        "body": "Lawyer.\n\nBut he is going to want to get a private blood draw ASAP. Like, right this second. Today. Get in the car and go right now.\n\nWhy?\n\nBecause the blood draw they took from him could take ***YEARS*** to come back. You read that right. ***YEARS***. (Our jurisdiction is just over 1.5 years out on results. And yes, that is insane.)\n\nA private blood draw will cost $500-1k. And will be back in about a month.\n\nHis attorney will submit that private draw to the court - who will, in all likelihood, grant full use of his driving privileges pending his court date.\n\nIt will effectively allow his life to return to normal until the state gets their blood draw back - and decide whether they want to pursue charges or not. Some jurisdictions will pursue charges even with negative blood draws, so a negative test doesn't mean he is in the clear.",
        "author": "Expensive__Support",
        "created_utc": 1749065467,
        "score": 23,
        "parent_id": "t3_1l3ayf8",
        "depth": 0
      },
      {
        "id": "mw04rd7",
        "body": "In my experience although they may have a large workload, public defenders work diligently on every case they get. It doesn’t sound like your friends case will need any expert witnesses which would have to be paid he may be ok.",
        "author": "calguy1955",
        "created_utc": 1749064143,
        "score": 17,
        "parent_id": "t3_1l3ayf8",
        "depth": 0
      },
      {
        "id": "mw11n1p",
        "body": "Was he actually charged or was he just arrested and released?  Arrested for DUI and charged with DUI are different things.\n\nFrom what I have seen, a prosecutor will usually wait to get the blood test before deciding whether to charge him with DUI.  If he has a test that comes back negative, he might never be charged at all, so doing nothing and saying nothing about it is the right thing to do.\n\nIf he has been charged with DUI already, he needs to be gathering up documented evidence of these medical conditions and talking to a public defender or private attorney if he has the resources to pay one.  If he is telling the truth, that blood test is going to go a long way to unwinding this mess.\n\nAlso, a private drug test from days later is next to useless and would be a waste of time and money.",
        "author": "braxtel",
        "created_utc": 1749073673,
        "score": 3,
        "parent_id": "t3_1l3ayf8",
        "depth": 0
      },
      {
        "id": "mw0zh40",
        "body": "Get a lawyer",
        "author": "alex_inglisch",
        "created_utc": 1749073009,
        "score": 2,
        "parent_id": "t3_1l3ayf8",
        "depth": 0
      }
    ],
    "1l2t5v0": [
      {
        "id": "mvvm2rx",
        "body": "Talk to whatever police agency in Maine handled the first break-in a few years ago. The police report that gets done is literally going to say nothing except \"This party told me X, Y, and Z, and I'm writing this report at the bank's request.\" The bank doesn't need it in any way other than to satisfy their own policies. They're either gonna give your mom her money back or they're not, but that's less of a legal issue than a customer service issue.",
        "author": "pase1951",
        "created_utc": 1749001404,
        "score": 459,
        "parent_id": "t3_1l2t5v0",
        "depth": 0
      },
      {
        "id": "mvvv5kc",
        "body": "In addition to the advice already received, you should consider checking both Connecticut and Maine’s attorney general websites for information on reporting fraud and banking fraud/financial crimes both for writing the checks and possibly the bank got cashing a 30 year old check. As others have pointed out, local police departments only really do a couple things… These are more state level crimes. I would see if either state’s AG websites have information on easy reporting",
        "author": "L0rd_Muffin",
        "created_utc": 1749004691,
        "score": 146,
        "parent_id": "t3_1l2t5v0",
        "depth": 0
      },
      {
        "id": "mvwe17l",
        "body": "The first and most basic thing, is close that account and get a new checking account with new numbers.",
        "author": "Emotional_Star_7502",
        "created_utc": 1749012665,
        "score": 70,
        "parent_id": "t3_1l2t5v0",
        "depth": 0
      },
      {
        "id": "mvwgo82",
        "body": "Close account and open a new one if you havent already done so",
        "author": "Dramatic-Account2602",
        "created_utc": 1749013932,
        "score": 25,
        "parent_id": "t3_1l2t5v0",
        "depth": 0
      },
      {
        "id": "mvx01gx",
        "body": "Interstate crime, including check fraud, falls under the responsibility of the FBI.\n\n\nYou could try contacting them but it is the bank's duty to report it and investigate.",
        "author": "LukeMootoo",
        "created_utc": 1749024604,
        "score": 17,
        "parent_id": "t3_1l2t5v0",
        "depth": 0
      },
      {
        "id": "mvwnro0",
        "body": "Ask the bank where the checks were negotiated (city). Contact that police department.",
        "author": "Masterofthelurk",
        "created_utc": 1749017559,
        "score": 17,
        "parent_id": "t3_1l2t5v0",
        "depth": 0
      },
      {
        "id": "mvxebj5",
        "body": "Are these checks that had already been presented and paid? I’m confused about how they were able to access checks that were dated but never cashed. When checks were presented for payment in the 90’s they had franking printed on them that made it very obvious that they were already processed. Even a new teller would be able to tell that they were not brand new checks.",
        "author": "txtw",
        "created_utc": 1749032910,
        "score": 13,
        "parent_id": "t3_1l2t5v0",
        "depth": 0
      },
      {
        "id": "mvzjuct",
        "body": "Seriously. As a banker, LEAVE THAT BANK. The fact that they allowed checks 30 years stale to be cashed is a huge failure on their part.",
        "author": "imtooldforthishison",
        "created_utc": 1749058251,
        "score": 11,
        "parent_id": "t3_1l2t5v0",
        "depth": 0
      },
      {
        "id": "mvwhojc",
        "body": "She'll eventually get the money back, it's just a hassle in the meantime.",
        "author": "SubarcticFarmer",
        "created_utc": 1749014424,
        "score": 10,
        "parent_id": "t3_1l2t5v0",
        "depth": 0
      },
      {
        "id": "mvxhe4r",
        "body": "Banker here. Your mother needs to physically go to a bank branch and sit down with a banker. [Depending on how long ago the checks were cashed,](https://www.helpwithmybank.gov/help-topics/fraud-scams/forgery/check-forgery-time-limit.html) she may be out of luck. Generally, you have up to 30 days from the statement date to notify your bank about a fraudulent check, including unauthorized signatures or alterations. However, some banks or states may have different timeframes. At a minimum, to protect herself, your mother should close her checking account and open a new one.",
        "author": "ahkwa",
        "created_utc": 1749034416,
        "score": 8,
        "parent_id": "t3_1l2t5v0",
        "depth": 0
      },
      {
        "id": "mvxiya4",
        "body": "Op when you say from the 90’s were the checks blank and stolen in the 90’s or they had a written date on them from the 90’s?",
        "author": "vicman86",
        "created_utc": 1749035137,
        "score": 9,
        "parent_id": "t3_1l2t5v0",
        "depth": 0
      },
      {
        "id": "mvzggm8",
        "body": "The answer here is to file a complaint with the Comptroller of the Currency. \n\nBanks don’t give a shite about internal investigations. \n\nMake them behave. \n\nhttps://www.helpwithmybank.gov",
        "author": "Ginger_Libra",
        "created_utc": 1749057326,
        "score": 9,
        "parent_id": "t3_1l2t5v0",
        "depth": 0
      },
      {
        "id": "mvy0uh7",
        "body": "Had this happen to me. File reports with FDIC and every other agency you can. The bank gave me the run around until the day after I got an email saying the FDIC was investigating. Then poof my money was back the next day.",
        "author": "wagashi",
        "created_utc": 1749042190,
        "score": 6,
        "parent_id": "t3_1l2t5v0",
        "depth": 0
      },
      {
        "id": "mvz86kx",
        "body": "Please name the financial institution that    will cash 25-35 yr old checks without blinking an eye so anyone that reads this  story that banks with them will know to go change banks if they will do something like that.",
        "author": "psl1959",
        "created_utc": 1749055029,
        "score": 7,
        "parent_id": "t3_1l2t5v0",
        "depth": 0
      },
      {
        "id": "mvy1ctj",
        "body": "Your mother has not been defrauded, your mother's BANK was defrauded.  Someone presented a check that was bogus, and they cashed it - that's THEIR PROBLEM.  Your mother was robbed, yes, but the checks should not have been accepted by the bank at all, given they were dated \"1995\", and were not in the current check-number sequence being used.\n\nThe bank will try to blame mom, so lawyer up and have the legal beagle write a \"demand letter\", as they bank's own policies should have prevented these checks from being accepted and cashed.",
        "author": "packetfire",
        "created_utc": 1749042368,
        "score": 6,
        "parent_id": "t3_1l2t5v0",
        "depth": 0
      },
      {
        "id": "mvy08s9",
        "body": "You can pay to put a stop payment on checks that are stolen....this should be done immediately.",
        "author": "just-anotha",
        "created_utc": 1749041980,
        "score": 3,
        "parent_id": "t3_1l2t5v0",
        "depth": 0
      },
      {
        "id": "mvyzak3",
        "body": "I thought cheques staledate after 6 months and are no longer cashable.",
        "author": "smallislandgirl",
        "created_utc": 1749052493,
        "score": 3,
        "parent_id": "t3_1l2t5v0",
        "depth": 0
      },
      {
        "id": "mw023mn",
        "body": "I thought checks were only good for 6 months. When did that change?",
        "author": "Jaded-Butterfly-3326",
        "created_utc": 1749063381,
        "score": 3,
        "parent_id": "t3_1l2t5v0",
        "depth": 0
      },
      {
        "id": "mvwrzjv",
        "body": "I'd close the account.",
        "author": "Belle-llama",
        "created_utc": 1749019854,
        "score": 3,
        "parent_id": "t3_1l2t5v0",
        "depth": 0
      },
      {
        "id": "mvxbc09",
        "body": "Go to the bank talk to the manager. If she doesn’t fix the problem then just say the next conversation will be with your lawyer.",
        "author": "Exrof891",
        "created_utc": 1749031318,
        "score": 2,
        "parent_id": "t3_1l2t5v0",
        "depth": 0
      }
    ],
    "1l3saa5": [
      {
        "id": "mw3yg7v",
        "body": "The FDCPA requires a debt be verified in writing upon consumer request, have your parents send them a letter requesting documentation of the original debt and creditor.",
        "author": "SnooConfections3841",
        "created_utc": 1749118430,
        "score": 2,
        "parent_id": "t3_1l3saa5",
        "depth": 0
      }
    ],
    "1l3fokj": [
      {
        "id": "mw0iu9h",
        "body": "The basic outline is generally to get a birth certificate, use that to get a copy of your social security number (or to register for one, if you don't have one), and then use those to get other ID, such as a driver's license or a passport.\n\nYou or your father can order a replacement birth certificate from the state [bureau of vital records](https://www.azdhs.gov/policy-intergovernmental-affairs/vital-records/), or from the county where you were born. You will need to get your signature notarized if you're submitting an order yourself, which ordinarily requires ID (chicken, meet egg), but many notaries have alternatives for verifying your identity. If your dad's got his documents in order and can order one for you, that's easier.\n\nYou will likely need to make an appointment with your nearest SSA office to get your SSN documents replaced without photo ID. Call them and ask.\n\nIf you get nowhere with this, call your state representative's office. Helping constituents navigate the state bureaucracy is a fairly normal service for elected reps to offer, and you might get some assistance there.",
        "author": "derspiny",
        "created_utc": 1749068192,
        "score": 59,
        "parent_id": "t3_1l3fokj",
        "depth": 0
      },
      {
        "id": "mw0zbc5",
        "body": "If you live with your dad, he probably claims you as a dependent. That means he knows your ssn. \n\nDad can get your birth certificate easily as well. Just drop into the Department of Vital records for the county where you were born.",
        "author": "Chemical_Enthusiasm4",
        "created_utc": 1749072959,
        "score": 10,
        "parent_id": "t3_1l3fokj",
        "depth": 0
      },
      {
        "id": "mw0jeqm",
        "body": "Since your father is the only one with IDs he will have to request your BC from the state records office.",
        "author": "Gloomy-Dependent9484",
        "created_utc": 1749068353,
        "score": 3,
        "parent_id": "t3_1l3fokj",
        "depth": 0
      }
    ],
    "1l3qk83": [
      {
        "id": "mw30ocn",
        "body": "First, off any footage would be shared with law enforcement and not with you. So you can't request that footage be released to law enforcement, as it will be up to them to approach whoever owns the cameras (depending on where the camera is located it may belong to Delta it may belong to the airport authority).\n\n  \nYou do not know if it was a employee of Delta that committed the theft. It could have been a TSA agent working where they scan checked luggage or an employee at one of the airports you flew through.\n\n  \nNot sure what a TSA or DOT complaint is going to accomplish since you are not the one investigating the theft, so I would not waste my time with that.\n\n  \nAnd finally, companies will not talk about active investigations, even if and especially if you are one of the parties involved. Investigations like this do take some time.",
        "author": "West-Association812",
        "created_utc": 1749099359,
        "score": 3,
        "parent_id": "t3_1l3qk83",
        "depth": 0
      }
    ],
    "1l3db43": [
      {
        "id": "mvzzc97",
        "body": "If it has reached the point of garnishment, then it has already gone to court and a judgement was entered against you, and then a separate garnishment order was issued by a judge.  \n\nIf you were not served proper notice of the original court date, you might be able to hire a lawyer to try to get the judgement set aside based in improper notice, not sure how that would impact garnishments already collected.",
        "author": "BuckeyeMason",
        "created_utc": 1749062601,
        "score": 142,
        "parent_id": "t3_1l3db43",
        "depth": 0
      },
      {
        "id": "mw02egs",
        "body": ">If the amount is insufficient to the outstanding balance the lender cannot pursue the borrower for the remaining debt.\n\nWhere are you getting the idea that you no longer owe on the deficiency balance? \n\nIt sounds like you did a voluntary repossession. The vehicle was sold, but you are still very much responsible for any remaining balance on the account after the sale. The lender also passed on any repossession fees to you as well- which you are also responsible for. \n\nJust because you no longer have the car doesn't change the fact you borrowed money that you still owe and are still responsible for. ",
        "author": "Lank3033",
        "created_utc": 1749063466,
        "score": 57,
        "parent_id": "t3_1l3db43",
        "depth": 0
      },
      {
        "id": "mw0ddi6",
        "body": "That’s not what that means. At all. \n\nYou owe whatever the balance is. The end. Note, learn what terms mean next time you purchase a car. All that means is “as is”",
        "author": "Living-Hyena184",
        "created_utc": 1749066610,
        "score": 12,
        "parent_id": "t3_1l3db43",
        "depth": 0
      },
      {
        "id": "mw0qnqq",
        "body": "This is actually common and legal. If they're already being garnished like someone else said its already gone to court.",
        "author": "Bryanormike",
        "created_utc": 1749070388,
        "score": 8,
        "parent_id": "t3_1l3db43",
        "depth": 0
      },
      {
        "id": "mw1dh60",
        "body": "People are piling on downvoting you, but your basic understanding of a recourse and no recourse debt with collateral involved is actually accurate. People seem to be jumping on the meaning of no recourse *sale*. \n\nA no recourse debt means that only the collateral can be seized to try and satisfy the debt, even if the collateral seized doesn't cover the full amount of the debt. Other assets can't be to make up any deficit.\n\nSo you have that understanding correct, (whether it actually applies to your situation of not). \n\n**BUT**, and it's a big ol' but, what you've stated is actually written is in your contract is this\n\n>My original agreement states that this negotiation and assignment are “without recourse”. \n\nWithout seeing the rest of the document I'm going to assume this is 3rd party lender financing you, and what this is most likely referring to is the fact that the lender has no recourse against the third party the dealer. \n\nIs this a 3rd party or dealer finance?",
        "author": "ABigOlBurr",
        "created_utc": 1749077433,
        "score": 3,
        "parent_id": "t3_1l3db43",
        "depth": 0
      },
      {
        "id": "mvzz4l3",
        "body": "Did you buy the vehicle used?",
        "author": "Psychological_Ear796",
        "created_utc": 1749062541,
        "score": 4,
        "parent_id": "t3_1l3db43",
        "depth": 0
      }
    ],
    "1l39ipn": [
      {
        "id": "mvzeo21",
        "body": "She needs to contact an attorney now.",
        "author": "EnvironmentalTea9362",
        "created_utc": 1749056832,
        "score": 81,
        "parent_id": "t3_1l39ipn",
        "depth": 0
      }
    ],
    "1l3qvni": [
      {
        "id": "mw32vvw",
        "body": "Call the cops on her for animal theft and cruality",
        "author": "Dojo_dogs",
        "created_utc": 1749100444,
        "score": 4,
        "parent_id": "t3_1l3qvni",
        "depth": 0
      }
    ],
    "1l2v6uy": [
      {
        "id": "mvwcnub",
        "body": "How do you know these things happened if they are not documented in his chart?",
        "author": "holliday_doc_1995",
        "created_utc": 1749012024,
        "score": 322,
        "parent_id": "t3_1l2v6uy",
        "depth": 0
      },
      {
        "id": "mvwq0pc",
        "body": "CMS regulates medical facilities that receive federal money. You can file a complaint with the state survey agency about the quality of care issues. \n\n\nhttps://www.cms.gov/medicare/health-safety-standards/quality-safety-oversight-general-information/contact-information#:~:text=State%20Survey%20Agencies%20work%20closely,using%20the%20contact%20information%20below.",
        "author": "jarbidgejoy",
        "created_utc": 1749018781,
        "score": 214,
        "parent_id": "t3_1l2v6uy",
        "depth": 0
      },
      {
        "id": "mvydqwz",
        "body": "I’m not a lawyer, and can not speak to the law. I am a doctor.\n\nMake sure to take a look at what you signed. When you checked him into the facility you probably signed something consenting to all necessary care. While physicians do try very hard to engage in shared decision making, if your son posed a danger to himself or others clozapine is a common and reasonable choice for chemical restraint. It is often less traumatic to the patient than physical restraints. In the case that he was deemed a threat to himself or others, they don’t strictly need your consent at all, even if they do have the extra protection of you signing a blanket consent to treatment at the start. Protecting patients and staff comes above patient autonomy. \n\nUnless the “code green” events were grossly fabricated, you are going to have a hard time convincing a clinical auditor that the use of chemical restraints was inappropriate. \n\nWhat you do have a stronger argument on, at least from my perspective, is the fact that they documented poorly. Payers will absolutely go after them for that! You probably don’t even have to prove it, just throw the chum in the water and if they didn’t document what they needed to for billing, they might not be hit with fraud, but it probably won’t get paid out.\n\nClinically, the strongest case you have for inappropriate practice is the idea that they kept giving clozapine when he developed severe leukopenia and a documented infection. Are you sure it was an infection? Where was the infection? I just ask because presence of bacteria is not necessarily infection, and it would be shocking to me if they had documented a true infection in a leukopenic patient, continued with the lymphosuppresive drug, and also didn’t treat the infection they documented.",
        "author": "A1-Delta",
        "created_utc": 1749046328,
        "score": 162,
        "parent_id": "t3_1l2v6uy",
        "depth": 0
      },
      {
        "id": "mvwuj6k",
        "body": "It’s not medically possible for your WBC to be zero, are you sure you’re reading his records correctly?",
        "author": "Simple_Ad_5678",
        "created_utc": 1749021286,
        "score": 61,
        "parent_id": "t3_1l2v6uy",
        "depth": 0
      },
      {
        "id": "mvx1nsc",
        "body": "Contact Disability Rights Texas. They can help you file a case and are the ones doing monitoring of places like this one.",
        "author": "WritingDog",
        "created_utc": 1749025609,
        "score": 31,
        "parent_id": "t3_1l2v6uy",
        "depth": 0
      },
      {
        "id": "mvxfwb7",
        "body": "You mentioned Medicaid fraud, that’s what I would report first. I feel like it would be investigated the most thoroughly. \n\nYou can report here: OIG hotline at 800-436-6184",
        "author": "yobruhh",
        "created_utc": 1749033711,
        "score": 14,
        "parent_id": "t3_1l2v6uy",
        "depth": 0
      },
      {
        "id": "mw0wkj2",
        "body": "I'm sorry to sound snarky, and I understand the need for you to feel involved, but dropping off a non-verbal child with severe behavioral issues, in an out of state facility without any family present was not the best option. Then, to be oppositional and argumentative with sound advice or explanation (Dr's, nurses, medical records, attorneys, and medical insurance industry) is causing me to think you're looking for a payday only.",
        "author": "pam-shalom",
        "created_utc": 1749072123,
        "score": 13,
        "parent_id": "t3_1l2v6uy",
        "depth": 0
      },
      {
        "id": "mvxpw59",
        "body": "Hi. You sound like a passionate advocate and loving parent. I hope things improve for you and your child.",
        "author": "you-never-know-",
        "created_utc": 1749038118,
        "score": 10,
        "parent_id": "t3_1l2v6uy",
        "depth": 0
      },
      {
        "id": "mvxteuf",
        "body": "Yikes it’ll be very hard to prove without the records and you also likely signed something that basically said if he’s in distress or a risk they can emergency medicate or restrain. Check what you signed when you entered him into the program.",
        "author": "Necessary-Reality288",
        "created_utc": 1749039507,
        "score": 10,
        "parent_id": "t3_1l2v6uy",
        "depth": 0
      },
      {
        "id": "mvxb6iw",
        "body": "If there is a psychologist or counselor on the paperwork, it might be worthwhile to submit a report to the American Psychological Association, and/ or the state board.",
        "author": "DaBearzz",
        "created_utc": 1749031236,
        "score": 7,
        "parent_id": "t3_1l2v6uy",
        "depth": 0
      },
      {
        "id": "mvyoy2g",
        "body": "Girl, welcome to the r/troubledteens industry. These things are shockingly common in residential therapy facilities.",
        "author": "ItsSamiTime",
        "created_utc": 1749049558,
        "score": 6,
        "parent_id": "t3_1l2v6uy",
        "depth": 0
      },
      {
        "id": "mvyw1vx",
        "body": "These sound like Level 1- (medication) and Level 2 -(restraint ,catherization) JCAHO violations. Please file a complaint here: [https://www.jointcommission.org/resources/patient-safety-topics/report-a-patient-safety-concern-or-complaint/](https://www.jointcommission.org/resources/patient-safety-topics/report-a-patient-safety-concern-or-complaint/)\n\nEvery healthcare organization must undergo JCAHO review. If violations are found or reported, and an investigation finds systemic errors, Level 2 violations can result in significant financial penalties. Failure to resolve JCAHO violations can further result in a loss of accreditation and then Medicare/Medicaid or ANY insurance will no longer deal with them and they close permanently. \n\nOnce when I was pregnant and getting blood drawn a Kaiser, I mentioned to the phlebotomist that the dried blood splatter on the wall where I was sitting was a Level one infection control violation. She immediately left and the head nurse came over to draw my blood. Before she was done. There was a team of custodians cleaning the entire room. As I left the facility a hospital administrator caught up with me in the hallway and walked with me out to my car trying to explain that the situation was resolved and to please not call or write JCAHO.",
        "author": "OhSassafrass",
        "created_utc": 1749051578,
        "score": 3,
        "parent_id": "t3_1l2v6uy",
        "depth": 0
      }
    ],
    "1l3brnk": [
      {
        "id": "mvzm1h2",
        "body": "This is serious grooming can be illegal even without sexual contact. You should contact local law enforcement or a child protection agency directly; they have tools to investigate and intervene. If parents aren’t cooperating, professionals can still report concerns to authorities. Keep documenting everything and involve the hospital’s legal or child advocacy team if possible. Protecting the child is the priority.",
        "author": "islawittyy",
        "created_utc": 1749058856,
        "score": 22,
        "parent_id": "t3_1l3brnk",
        "depth": 0
      },
      {
        "id": "mw0e4tw",
        "body": "The age of consent in Pennsylvania is 16 and the [closest thing](https://law.justia.com/codes/pennsylvania/title-18/chapter-63/section-6301/) to a \"grooming\" charge I can find in Pennsylvania requires that the accused to have [actually committed a crime in the course of doing so](https://scholar.google.com/scholar_case?case=10006390768661201122&hl=en&as_sdt=6&as_vis=1&oi=scholarr). So there doesn't appear to be anything you can do in this situation.",
        "author": "Futurama_Nerd",
        "created_utc": 1749066826,
        "score": 13,
        "parent_id": "t3_1l3brnk",
        "depth": 0
      },
      {
        "id": "mvznf5y",
        "body": "Follow proper chain of command in accordance to your employer. After taking those steps, contact social services and report the child as at risk. You can ask child welfare, social services to follow the case. I am afraid there’s not much to be done if parents aren’t concerned.",
        "author": "Immediate-Ad-9849",
        "created_utc": 1749059237,
        "score": 3,
        "parent_id": "t3_1l3brnk",
        "depth": 0
      },
      {
        "id": "mvzwgl2",
        "body": "I see you reported to ChildLine.  Have you also tried reporting through the [Child Welfare Portal](https://www.compass.dhs.pa.gov/cwis)?  I don't know whether the two systems end up at the same decision-makers or a different list.",
        "author": "jpers36",
        "created_utc": 1749061782,
        "score": 4,
        "parent_id": "t3_1l3brnk",
        "depth": 0
      }
    ],
    "1l3be40": [
      {
        "id": "mw04ayd",
        "body": "I would get a real estate attorney to review your documents and advise you from there  this is a pretty complicated situation",
        "author": "Parkeredlatham",
        "created_utc": 1749064010,
        "score": 17,
        "parent_id": "t3_1l3be40",
        "depth": 0
      },
      {
        "id": "mw06a1i",
        "body": "NAL and would recommend you meet with a real estate and or a tax attorney as this is a complicated transaction as previously mentioned. \nThat being said, with tax issues, the liability is usually limited to the interest and penalties that have been added not the original taxation amount. So you may be able to sue to recover and penalties or interest that the IRS is charging you but I don’t see anyway that you would be able to recoup the original 10% assessment.",
        "author": "MarcusEsquandolas",
        "created_utc": 1749064577,
        "score": 11,
        "parent_id": "t3_1l3be40",
        "depth": 0
      }
    ],
    "1l2qdkv": [
      {
        "id": "mvuxc1m",
        "body": "You said “one of my employees” so I’m assuming you are in management and have access/knowledge to confidential salary information. That wage information wasn’t yours to share. That’s why you were fired. Totally legal and proper. Don’t violate people’s privacy.",
        "author": "PleadThe21st",
        "created_utc": 1748992802,
        "score": 741,
        "parent_id": "t3_1l2qdkv",
        "depth": 0
      },
      {
        "id": "mvuxd7t",
        "body": "If you are supervisor you have less protections.",
        "author": "anthematcurfew",
        "created_utc": 1748992812,
        "score": 313,
        "parent_id": "t3_1l2qdkv",
        "depth": 0
      },
      {
        "id": "mvuzghp",
        "body": "Employment law follows where the employee is located/where the work is performed, so if you are in Alabama, Alabama law applies. But this is actually a Federal issue anyway.\n\nThe NLRA protects employee's rights to discuss wages, but as a supervisor, you actually can be prohibited from discussing another employee's salary, even in a casual way like you did. Firing you might have been an overreaction, but it was probably legal.\n\nYou should apply for unemployment while you look for a new job. You'll want to do that via the Alabama unemployment commission. Answer the questions honestly and appeal if initially denied. Being terminated for this reason likely isn't enough to disqualify you from receiving benefits.\n\nSorry this happened to you. All you can do is take it as a learning experience and move on.",
        "author": "sdss9462",
        "created_utc": 1748993502,
        "score": 98,
        "parent_id": "t3_1l2qdkv",
        "depth": 0
      },
      {
        "id": "mvypvrx",
        "body": "If it’s poor judgement to tell a direct report, supervisor no less, that we are giving HIS direct report a raise, than I would have been fired multiple times. \n\nMy setup was that supervisor suggested a raise for a direct, I as a manager would advocate with leadership to get it approved. \n\nWhy on earth should I NOT be sharing this news with the supervisor?",
        "author": "sybilkitty",
        "created_utc": 1749049824,
        "score": 30,
        "parent_id": "t3_1l2qdkv",
        "depth": 0
      },
      {
        "id": "mvwn8vx",
        "body": "You are some form of \"supervisor,\" therefore, the NLRA exists to protect people from you. You have no protections under the NLRA. That's not what it's for",
        "author": "Recusant_Ronald",
        "created_utc": 1749017281,
        "score": 15,
        "parent_id": "t3_1l2qdkv",
        "depth": 0
      },
      {
        "id": "mvxs9qr",
        "body": "If you told the supervisor of another employee, that said employee’s raise was approved and forthcoming, I see nothing wrong with that…unless you violated some company policy on such matters.\n\nPersonally, I would find myself a VERY good and VERY aggressive employment attorney and talk to him/her about the situation. One firm letter fired across the employer’s bow may get you some significant severance money.\n\nEither way I wish you well, and sorry this happened. It can be demoralizing to lose your job, but in a year or two you will look back and realize it happened for good reason and you’ll be in a better place. Life goes on.",
        "author": "strokeoluck27",
        "created_utc": 1749039064,
        "score": 16,
        "parent_id": "t3_1l2qdkv",
        "depth": 0
      },
      {
        "id": "mvvyfh4",
        "body": "That sucks man. You only did this in good earnest with good intentions. Don't take it personally or to your heart",
        "author": "Lostmypants69",
        "created_utc": 1749005945,
        "score": 9,
        "parent_id": "t3_1l2qdkv",
        "depth": 0
      },
      {
        "id": "mvzsydo",
        "body": "I'm really sorry you're going through this—being let go, especially under unclear circumstances, is incredibly difficult. Based on what you've shared in your original post and follow-up responses, here’s what I’ve gathered:\n\n* You (Supervisor A) were informed—possibly by Manager L—that Employee C had been approved for a raise.\n* You oversee Supervisor B, who in turn supervises Employee C. It appears that you passed along the raise information to Supervisor B.\n* You were then informed that you’re being terminated for disclosing this information.\n* According to your company, while you manage work assignments, you're not considered a formal “People Manager,” which may impact what you’re authorized to communicate.\n\nFrom what’s been shared, it seems that the core issue is that you disclosed information that wasn’t yet yours to share, or hadn’t gone through all the necessary approvals. It’s possible that your manager shared the update with you as an FYI or as a pending decision, rather than something finalized. This kind of communication can be easily misinterpreted, especially if processes aren't clearly explained.\n\nIn situations involving raises or sensitive personnel changes, it’s always helpful to clarify:\n\n* Has this been fully approved?\n* Who else is aware?\n* When will this take effect?\n* Who is responsible for informing the employee?\n* Am I authorized to share this with others?\n\nAsking these questions helps protect you and ensures that everyone remains aligned with company protocols. Unfortunately, it seems like a breakdown in this communication may have led to your termination.\n\nWhile this outcome feels unfair, especially if your intentions were good, it’s likely that your employer viewed the disclosure as a breach of protocol. It’s also possible that the situation came to light if Employee C asked HR for clarification about the raise, which may have triggered a review of how the information was shared. Since Supervisor B and Employee C acted based on what you told them, they likely weren’t held responsible in the same way.\n\nThis is an unfortunate and upsetting outcome, and I hope you're able to find clarity, closure, and better opportunities ahead. If you feel strongly that you were wrongfully terminated, you might consider consulting with an employment attorney to fully understand your rights and whether further action is warranted.",
        "author": "FSFMarina",
        "created_utc": 1749060781,
        "score": 7,
        "parent_id": "t3_1l2qdkv",
        "depth": 0
      },
      {
        "id": "mvxywdu",
        "body": "Info: Why is someone getting a raise good news to anyone other than the person who got that raise?",
        "author": "Allthetea159",
        "created_utc": 1749041517,
        "score": 5,
        "parent_id": "t3_1l2qdkv",
        "depth": 0
      },
      {
        "id": "mvzzslb",
        "body": "File a charge with the NLRB. You likely don't have protection because you are a supervisor, HOWEVER, employers often misclassify supervisors. There is also a chance that the duties you actually performed on the job do not meet the legal definition of a supervisor as defined the in National Labor Relations Act. You have nothing to lose here since you are terminated. When you file a charge, it will be assigned a case number and an agent to investigate it. The agent will contact you and take an affidavit. Once they do that, they can make a determination as to whether your charge has merit or not. Again, nothing to lose, costs you nothing but some time. No harm no foul.",
        "author": "AngryYoungandPoor86",
        "created_utc": 1749062729,
        "score": 4,
        "parent_id": "t3_1l2qdkv",
        "depth": 0
      },
      {
        "id": "mw0zbt5",
        "body": "If you didn’t share wages then it doesn’t violate any laws. You can contact a labor lawyer for a consultation but I doubt any would take a flimsy case like this on contingency.",
        "author": "LongjumpingNinja258",
        "created_utc": 1749072964,
        "score": 5,
        "parent_id": "t3_1l2qdkv",
        "depth": 0
      },
      {
        "id": "mvyfx4i",
        "body": "This makes me really angry for you. For one thing, salary transparency fosters fairness, trust, and efficiency in the workplace. It’s the right thing to do.",
        "author": "gullible_skeptic_74",
        "created_utc": 1749046969,
        "score": 2,
        "parent_id": "t3_1l2qdkv",
        "depth": 0
      },
      {
        "id": "mvzlmf5",
        "body": "The NLRB protects the right to collectively bargain and join and operate a union, or not participate in those activities. It has nothing to do with discrimination or individual worker rights like the one OP is talking about. \n\nDiscussing a coworker’s raise, whether or not OP is a supervisor, is something which he can be fired for in any state except Montana, which is the only state that isn’t employment at will. In an at will employment situation, you can be fired for any reason or no reason at all, except if your being fired for belonging to a protected class (age, race, religion, disability, national origin, filing a workman’s comp claim). Unless you’re a member of a union or have a contract stating otherwise (an employee handbook is not the same as a contract), your employer can fire you for sharing what should be confidential information without any further explanation.",
        "author": "funkissedjm",
        "created_utc": 1749058740,
        "score": 2,
        "parent_id": "t3_1l2qdkv",
        "depth": 0
      },
      {
        "id": "mvzovod",
        "body": "As a supervisor, or management you have much less protection for this. Check your contract. Things like this can be a part of it, and maybe you didn't know. Not knowing doesn't change anything, but at least then you'd understand the why.",
        "author": "ToxicGingerRose",
        "created_utc": 1749059634,
        "score": 2,
        "parent_id": "t3_1l2qdkv",
        "depth": 0
      }
    ],
    "1l2spxu": [
      {
        "id": "mvvg0y1",
        "body": "I’d probably refuse to pay these and see if he can manage a claim in probate. Or a mechanics lien or something. \n\nIf he did I’d point out his inability to prove this and offer something like $1,600 to settle.",
        "author": "reddituser1211",
        "created_utc": 1748999287,
        "score": 497,
        "parent_id": "t3_1l2spxu",
        "depth": 0
      },
      {
        "id": "mvw9nv6",
        "body": "Just ignore. If he doesn’t have signed work orders, he’s out of luck.\nWhat a vile grifter.\nSorry for your loss.",
        "author": "Greenhouse774",
        "created_utc": 1749010646,
        "score": 115,
        "parent_id": "t3_1l2spxu",
        "depth": 0
      },
      {
        "id": "mvvo4v0",
        "body": "Would he not have signed agreements to do the work. Invoices mean nothing.",
        "author": "Imaginary-Blueberry4",
        "created_utc": 1749002135,
        "score": 93,
        "parent_id": "t3_1l2spxu",
        "depth": 0
      },
      {
        "id": "mvw3sin",
        "body": "Look at her checkbook. Senior citizens usually pay via checks and describe what for.",
        "author": "10mmamberalert",
        "created_utc": 1749008126,
        "score": 44,
        "parent_id": "t3_1l2spxu",
        "depth": 0
      },
      {
        "id": "mvwcwbj",
        "body": "NAL- The burden of proof is on him. Let him show invoices, contracts, etc. Find what you can to defend your side. My guess is he’s full of it.",
        "author": "Appropriate_Hand_486",
        "created_utc": 1749012133,
        "score": 47,
        "parent_id": "t3_1l2spxu",
        "depth": 0
      },
      {
        "id": "mvvvy7j",
        "body": "Get her bank statements with copies of checks to see what payments were made by your mom. Talk to the neighbors. Find out what he charges for this stuff.",
        "author": "thelastheroine",
        "created_utc": 1749004989,
        "score": 40,
        "parent_id": "t3_1l2spxu",
        "depth": 0
      },
      {
        "id": "mvvx0e8",
        "body": "Have him make a claim against the estate. He could be outside the claim window and the claim be denied (the claim period is one year of the notice of publication for PA). If he is able to file the claim, you can deny it and he would have to then request a formal hearing and present his evidence to a judge. You would be able to present what you have, as well. From there, if his evidence is weak, his claim could be dismissed. If he can show his claim is valid, the estate may be ordered to pay him an amount. You also have the option to settle with him in exchange for him not filing anymore claims against the estate or trying to put a lien on any assets. \n\nYou could consider a referral to speak with a probate attorney from the PA Legal Aid as it seems that yours is not helpful in the matter. \n\nhttps://www.palawhelp.org/organization/referral-service-pennsylvania-bar-association#:~:text=Call%20800%2D692%2D7375%20or,6807%20to%20receive%20a%20referral.\n\n\nIt's $30 for 30 minutes. It's okay to get a second opinion.",
        "author": "bbtom78",
        "created_utc": 1749005394,
        "score": 31,
        "parent_id": "t3_1l2spxu",
        "depth": 0
      },
      {
        "id": "mvvmsl7",
        "body": "Legally if they had a contract he had fulfilled and then she didnt pay because she was incapacitated or a dead beat(not trying to be rude)   then yes the estate likely owes over due invoices she agreed to pay\n\nThe reality is it sounds like this guy helped out and money wasn't really discussed up front and now he's looking for a pay day.  If the guy was a legit help and you appreciated the work ask him to provide a clear set of cost he hasn't been paid for and you'll review.  If it is all just made up and exuberant and he is taking advantage of her estate and you cant reconcile it to records you have on hand then tell him sorry I can't confirm this you will need to file a small claims aganist the estate and let a judge hash it out.   The issue to that is that case may take months to resolve and you will have to wait to finalize the estate until that's done.\n\nTlDR if its reasonable and you appreciated the work pay and move on otherwise tell him to sue the estate.",
        "author": "cooldude832_",
        "created_utc": 1749001658,
        "score": 32,
        "parent_id": "t3_1l2spxu",
        "depth": 0
      },
      {
        "id": "mvwgnno",
        "body": "Seems like he would have to have a signed approval by your mom. Otherwise any Tom  Or Harry could come along and jump on the bandwagon by showing up with an invoice. Or even the handyman himself.. he could Invoice anything he wanted if no proof was required which is what he might be doing. Often oral contracts are legal but your mother is not around to dispute them. On the other hand anyone can put a lien on your property at least in Florida. The house across the street had some stucco work done and I got a lien put on my house for the scaffolding that was rented because they happened to write the wrong address on the invoice it took a while to get it removed. It had mine in my wife's name on it also.",
        "author": "Impressive_Rain2877",
        "created_utc": 1749013925,
        "score": 14,
        "parent_id": "t3_1l2spxu",
        "depth": 0
      },
      {
        "id": "mvvtfcg",
        "body": "I suggest you research Mechanic Lien laws for PA. In Ohio a contractor has 90 days to file the lien from the last date of work. Contractor is a loose term and can mean the mower, handy man, or actual contractor. Don’t discuss options with the neighbor. Let them figure out what options they have to collect. If you are the executor of the estate I could take all documentation, invoice, emails, etc. Compile a summary. Invoice description and charge: Quote per email or documented payment. I would also review account statements and see how much your mom paid the neighbor already. Hopefully she only paid by check. Then I would take all of the documentation and give it to the attorney. Let the attorney know this person has contacted you with a claim for payment. You feel it is invalid or inflated (whatever your feelings are). The attorney and probate court can decide what is the correct course of action whether that be disregarding it or determining what is valid and what is not. \n\nIf I was the executor my concern would be to pay what is valid and make sure I am handling all notices of collection correctly. It is the attorney to determine what is correct.\n\nIf this goes before the judge I would guess the neighbor would need to provide receipts for material and rentals as well as his time spent. I would expect a court to require him to show some proof rather than handing over and invoice at this time. The timing is questionable. Especially if this is for services that go years back. Why continue to pro dive services if you were not paid for previous work completed?",
        "author": "apjolex",
        "created_utc": 1749004052,
        "score": 9,
        "parent_id": "t3_1l2spxu",
        "depth": 0
      },
      {
        "id": "mvx0hch",
        "body": "I mean the statute of limitations is 4 years pertaining to any alleged breach of contract, so anything before 2021 he would not be able to collect. He also would be past the deadline for filing any mechanic lien. I’d just refuse to pay and don’t acknowledge the debt at all or agree to repay a portion.",
        "author": "throwawayalldan",
        "created_utc": 1749024876,
        "score": 8,
        "parent_id": "t3_1l2spxu",
        "depth": 0
      },
      {
        "id": "mvwj8rv",
        "body": "Say you will only pay on writen quotes signed by your mother.",
        "author": "bobsmon",
        "created_utc": 1749015207,
        "score": 7,
        "parent_id": "t3_1l2spxu",
        "depth": 0
      },
      {
        "id": "mvww8h1",
        "body": "I mean I can invoice you for $10k rn. That doesnt mean anything. Flip that 16k to 160k. It means the same thing without a written contract with your mom stipulating payment for services rendered.",
        "author": "Dk8325",
        "created_utc": 1749022306,
        "score": 7,
        "parent_id": "t3_1l2spxu",
        "depth": 0
      },
      {
        "id": "mvzd89j",
        "body": "Sounds like a scam..He is vastly overcharged your mother... Don't pay him u less he can prove the debt isn't padded or fake.  Maybe your mom paid him in full already.  Dont fall for this a d ghost him..You could talk to a lawyer about if this is legal.",
        "author": "Money-Detective-6631",
        "created_utc": 1749056427,
        "score": 6,
        "parent_id": "t3_1l2spxu",
        "depth": 0
      },
      {
        "id": "mvy0k8v",
        "body": "Look up the statute of limitations for the various debts under Pennsylvania law. I would deny anything past the limits on collecting the various debts.\n\nSeriously, what's he going to do, sue the estate? No, because the SOL has already tolled. I would also refuse to pay anything he did that requires a license, bond, and insurance, or any combination of those unless he had the combination of those requirements under his belt at the time he performed the work. I would probably pay for any receipts he can show, unless you suspect he's already been paid for them.\n\nHe sounds like he's a meddling neighbor who did things pretending to be honest and looking out for her, then someone planted the idea of a payday in his head, and he dove on the idea.",
        "author": "AndroidColonel",
        "created_utc": 1749042091,
        "score": 3,
        "parent_id": "t3_1l2spxu",
        "depth": 0
      },
      {
        "id": "mvzaioz",
        "body": "As the executor of the estate it is your fiduciary responsibility to make sure all claims against the estate are valid. \n\nSurely he would have given estimates that your mom would have signed to approve these projects. I would ask for copies.",
        "author": "FluffyApartment596",
        "created_utc": 1749055681,
        "score": 5,
        "parent_id": "t3_1l2spxu",
        "depth": 0
      },
      {
        "id": "mvy2jed",
        "body": "Taking advantage of elderly people can be considered a crime depending on the act and jurisdiction.  Consider gathering evidence and providing to local law enforcement.",
        "author": "WHighsmith",
        "created_utc": 1749042770,
        "score": 3,
        "parent_id": "t3_1l2spxu",
        "depth": 0
      },
      {
        "id": "mvziizw",
        "body": "Have him show signed contracts for work done.",
        "author": "Kink4202",
        "created_utc": 1749057894,
        "score": 2,
        "parent_id": "t3_1l2spxu",
        "depth": 0
      },
      {
        "id": "mvzriyr",
        "body": "Just sell the house and move on, he’s inflated the charges that she may have already paid- unless you feel his did take care of things for your mom when she needed them maybe give him $2k for recent items but if he didn’t collect in  5 years that is a gift.",
        "author": "CoffeeKeepsMe",
        "created_utc": 1749060374,
        "score": 2,
        "parent_id": "t3_1l2spxu",
        "depth": 0
      },
      {
        "id": "mvzzj7s",
        "body": "Unlicensed contractors (handymen) can only do and sue for work under $500.00 ( at least in California). If this is true for your state, tell him to pound sand.",
        "author": "ccrexer",
        "created_utc": 1749062655,
        "score": 2,
        "parent_id": "t3_1l2spxu",
        "depth": 0
      }
    ],
    "1l2mpwi": [
      {
        "id": "mvuzn3u",
        "body": "My cousin had her baby on the same medication and DCFS was also contacted by the hospital. But because of her prescription and proof that she was working on her addiction it was a pretty open and shut investigation. I think they did one home visit and a few random check ins and that was it.\n\nShe's been clean since her daughter was born (about 7 years) and just had her son. You're doing amazing! Good luck! 🩷",
        "author": "BaoBunny44",
        "created_utc": 1748993563,
        "score": 1020,
        "parent_id": "t3_1l2mpwi",
        "depth": 0
      },
      {
        "id": "mvwbqep",
        "body": "NAL. Use to cover the birthing unit as a social worker. BRING YOUR SCRIPT WITH YOU TO THE HOSPITAL. Unfortunately in many states the testing & reporting are required. It makes everyone’s lives easier if you bring the script with you. I would also have handy the contact info of who prescribes it as well",
        "author": "coffee-girl1",
        "created_utc": 1749011592,
        "score": 325,
        "parent_id": "t3_1l2mpwi",
        "depth": 0
      },
      {
        "id": "mvvebqe",
        "body": "r/CPS is a great subreddit that gets a ton of questions like this.  You will likely get a response from someone in your state.",
        "author": "d00rway",
        "created_utc": 1748998690,
        "score": 267,
        "parent_id": "t3_1l2mpwi",
        "depth": 0
      },
      {
        "id": "mvutppx",
        "body": "NAL, but I would follow up with your OBGYN to clarify why this is reportable. This seems over the top even for Tennessee, and it may just be better to get a new OBGYN. From a few minutes of online research, it doesn't scream mandated reporting.",
        "author": "InnerChildGoneWild",
        "created_utc": 1748991603,
        "score": 111,
        "parent_id": "t3_1l2mpwi",
        "depth": 0
      },
      {
        "id": "mvxoo4w",
        "body": "When I was a case manager for a MAT office in Tennessee I had several women go through the exact same thing. It’s a pain, they can be kind of mean, but have your documents ready and be confident in letting them know. I would recommend having the doctor who’s prescribing the subutex to reach out to your obgyn to confirm everything. Since you already have custody of your other child most likely they will just have some paperwork and that will be that. Atleast they’re letting you know now, I had one client that they waited to tell until she had just given birth. Good luck and congrats on your sobriety journey!",
        "author": "BottleAlternative433",
        "created_utc": 1749037622,
        "score": 38,
        "parent_id": "t3_1l2mpwi",
        "depth": 0
      },
      {
        "id": "mvxey9f",
        "body": "Interesting. I live in VA and per CPS guidelines this reason alone isn't enough to warrant an investigation. Have known at least 3 women who birthed on this med with zero CPS interaction.\nYou should be able to download and review your state's CPS guidelines as well, to weigh the point system that's used in determining whether a case is opened. That way you've got an idea what to expect should that be the case. \nGood work staying clean, I hope you keep up the good work and I hope your birth is beautiful and smooth. \nTry not to stress it 🙏💕",
        "author": "lilCharizardScorch",
        "created_utc": 1749033235,
        "score": 9,
        "parent_id": "t3_1l2mpwi",
        "depth": 0
      },
      {
        "id": "mvzhhom",
        "body": "My sister wasn’t allowed to leave the hospital with her son while they were doing their investigation but she wouldn’t have been able to take him home anyways because the hospital had to taper him off the Buprenorphine before he could be discharged, so it was fine. They did a drug screen at the hospital on her as well as checked the meconium at birth. Once she and my nephew were released, they did one follow up home visit to check on them both and they did a final drug test to be sure she was still on her meds and nothing else. It was much harder for her to see her baby so upset going through w/d the first couple weeks of his life than dealing with DCS. She said that will stick in her mind for the rest of her life and also gave her that nudge she needed to start tapering her dose, something she had always feared. She must’ve been on the same 16mg/day dosage for at least the last 10yrs and she has been holding steady at 2mg/day at the moment.",
        "author": "Not_ur_avg_introvert",
        "created_utc": 1749057607,
        "score": 3,
        "parent_id": "t3_1l2mpwi",
        "depth": 0
      }
    ],
    "1l33ach": [
      {
        "id": "mvxrxnz",
        "body": "Are you and your roommate on the same lease?\n\nIf so, maybe don’t be telling the landlord when you violate your lease.\n\nAs far as the landlord would be concerned, you and your roommate are one single entity. \n\nAlso, if they are gone now, the breach has been cured.  \n\nThe drama between you and your roommate is not your landlords problem.",
        "author": "thisisstupid94",
        "created_utc": 1749038933,
        "score": 84,
        "parent_id": "t3_1l33ach",
        "depth": 0
      },
      {
        "id": "mvxq0db",
        "body": "The landlord is not responsible for solving your roommate struggles.  You and your roommate, being on the same lease, are one entity for purposes of this contract.  The landlord isn't going to intervene in your internal problems.\n\nThe landlord can, if they choose, enforce the lease(against the both of you) You cannot force that nor can you force the consequences to be only on your roommate and not on you.",
        "author": "ApprehensiveEarth659",
        "created_utc": 1749038166,
        "score": 46,
        "parent_id": "t3_1l33ach",
        "depth": 0
      },
      {
        "id": "mvxrapx",
        "body": "If their child is a minor that's not a violation. The parents are different \n\nYou can't extricate yourself from this lease violation, though- the landlord would be evicting everyone if that's the route they chose to take",
        "author": "ResurgentClusterfuck",
        "created_utc": 1749038680,
        "score": 30,
        "parent_id": "t3_1l33ach",
        "depth": 0
      },
      {
        "id": "mvys0kz",
        "body": "The couple sound like dicks, but more importantly, it sounds like a power play to get you to move out. If you can find a place that is comparable and you like it, then propose they take over the entire lease and you will move out. This way you likely would not incur any fees, if management accepts your proposal. Be sure to absolutely take everything that is your own. If you stay, then next time it happens with the parents, either tell your roommates you will pay less rent or just report it to management.  If management does not enforce their lease then you have recourse. Be mindful that these steps could/will create tension for you in your home.",
        "author": "cazzobomba",
        "created_utc": 1749050434,
        "score": 9,
        "parent_id": "t3_1l33ach",
        "depth": 0
      }
    ],
    "1l3ffay": [
      {
        "id": "mw1g1vu",
        "body": "Since you state you have contacted patient relations with no resolution, I’d recommend you contact the Patient Ombudsman for advice and assistance!",
        "author": "hammandbuble",
        "created_utc": 1749078262,
        "score": 4,
        "parent_id": "t3_1l3ffay",
        "depth": 0
      },
      {
        "id": "mw0fvee",
        "body": "Try r/legaladvicecanada",
        "author": "jpers36",
        "created_utc": 1749067333,
        "score": 2,
        "parent_id": "t3_1l3ffay",
        "depth": 0
      },
      {
        "id": "mw0un2z",
        "body": "Pressure sores that severe will only heal when the patient is moved to an alternating pressure air mattress.\n\nThe next time your father is hospitalized with a pressure sore, demand a consult with an attending physician in Dermatology.",
        "author": "JTBlakeinNYC",
        "created_utc": 1749071545,
        "score": 2,
        "parent_id": "t3_1l3ffay",
        "depth": 0
      }
    ],
    "1l3fayi": [
      {
        "id": "mw0wywh",
        "body": "NAL, but as many people say on this sub, anyone can threaten to sue, it’s costly and time consuming to actually go through with it. He’s probably just trying to intimidate you into taking down the review. \n\nDid you take pictures of the damages? If it were me, I would make sure to start documenting stuff; in the unlikely event that they try to file suit for slander/libel, the truth is considered an absolute defense. Its not slander to say they destroyed your classroom if they actually did destroy your classroom and you can prove it. ",
        "author": "YouFuckingRetard",
        "created_utc": 1749072244,
        "score": 3,
        "parent_id": "t3_1l3fayi",
        "depth": 0
      }
    ],
    "1l3fui1": [
      {
        "id": "mw0on1q",
        "body": "What’s the hostile work environment?",
        "author": "monkeyman80",
        "created_utc": 1749069820,
        "score": 3,
        "parent_id": "t3_1l3fui1",
        "depth": 0
      },
      {
        "id": "mw101we",
        "body": "Oh even better CGTips randomly go missing. You'll get a case number and never hear anything again. Contact CGIS and they never saw it. \"Don't know what happened.\"",
        "author": "Remote_Possible_8644",
        "created_utc": 1749073186,
        "score": 2,
        "parent_id": "t3_1l3fui1",
        "depth": 0
      }
    ],
    "1l2f08z": [
      {
        "id": "mvsdqk6",
        "body": "You're over thinking small claims. The judge will ask you questions to figure this out. Be direct, be simple, be clear, be honest.\n\nA response to something like this can be really simple. \"Defendant asserts that no valid contract exists. Plaintiffs have yet to show what agreement, if any, meets the required elements of a contract.\"\n\nAttorney fees, court costs, and even collections are super hard to get in court. The judge may just say you have to pay the $121.",
        "author": "VoteGiantMeteor2028",
        "created_utc": 1748965393,
        "score": 1242,
        "parent_id": "t3_1l2f08z",
        "depth": 0
      },
      {
        "id": "mvsg1ux",
        "body": "What did the EOB from your insurance company say you owed? And FYI, coding is not based solely on time. Medical decision making is the most important factor.\n\nYou saw the doctor, received the service, and refused to pay the bill. The judge/mediator is going to side with  the doctor.",
        "author": "Jenn31709",
        "created_utc": 1748966034,
        "score": 116,
        "parent_id": "t3_1l2f08z",
        "depth": 0
      },
      {
        "id": "mvtmngc",
        "body": "So, in summary. You went to a doctor that you hadn’t been to in over three years and were billed the correct amount as verified by your insurance company. You are going to lose in court.",
        "author": "levon999",
        "created_utc": 1748978504,
        "score": 82,
        "parent_id": "t3_1l2f08z",
        "depth": 0
      },
      {
        "id": "mvt492x",
        "body": "Doctor here. \n\nTldr- coding is complex, in my opinion, your doctor’s billing is appropriate based on the info you gave. \n\n\nMedical billing codes are not as straightforward as you’re implying. The code used for “new” just means that particular billing group hasn’t seen you as a patient in the past 3 years. If you saw them 3+ years ago, you are new; also, if they recently were bought out by a nearby hospital or new doctor, or otherwise changed their billing group, you are new. A large facility can have multiple billing groups, so you also could be new even if you saw a different provider in the same practice (like your primary care or cardiologist) last time, etc. \n\nAs for the level, it can be based on time, but this includes time spent reviewing your chart without you present, such as looking at pictures from last mole review, talking to colleagues about the case, etc. Instead of time, they may also have billed based on complexity; there are a bunch of factors that go into that, but a 99203 code (which I’m assuming, based on the 30-minute comment) is a below average bill for specialist appointments anyway. The only lower code is 99202, and is usually reserved for patients with no problems, common cold, etc. Even coding a 99204 based on this being an evaluation for possible melanoma (a life-threatening condition, and therefore a higher code) would have been defensible. \n\nI’ll leave it to others to comment on the legal questions, but as an aside, these codes/rules are not state specific. I also have a hard time seeing how you would prove they didn’t spend 20 minutes on your chart outside your 10 minute visit to meet the 30min total.",
        "author": "cardio-doc-ep",
        "created_utc": 1748972725,
        "score": 76,
        "parent_id": "t3_1l2f08z",
        "depth": 0
      },
      {
        "id": "mvstof5",
        "body": "All of this for $121?  I would have paid long before it got to collections. Fucking up my credit for something so stupid is not worth time and effort in court.",
        "author": "DrMisery",
        "created_utc": 1748969852,
        "score": 74,
        "parent_id": "t3_1l2f08z",
        "depth": 0
      },
      {
        "id": "mvsdg9r",
        "body": "Did you pay them anything?",
        "author": "too_many_shoes14",
        "created_utc": 1748965315,
        "score": 51,
        "parent_id": "t3_1l2f08z",
        "depth": 0
      },
      {
        "id": "mvtoqlw",
        "body": "When billing on time, doctors include time spent pre visit and post visit on your care (must be time on the date of service). This includes reviewing your chart, radiology/lab studies, and writing documentation. It’s not just the time they are in your room speaking to you. I think many patients underestimate how much time is actually spent outside of the room on your care.\n\nAlso, if you have not been seen by this doctor within 3 years, coding rules require you to be treated as a new patient. This is not something made up by the doctor, it’s regulated by the federal government.",
        "author": "Apprehensive_Let9521",
        "created_utc": 1748979139,
        "score": 22,
        "parent_id": "t3_1l2f08z",
        "depth": 0
      },
      {
        "id": "mvu05e7",
        "body": "You should have paid it before it went to collections and still attempted to dispute / resolve. \n\nYou should have then paid it when it was with collections and still attempted to dispute / resolve. \n\nYou will now more than likely be found to pay the bill plus all fees involved. Expensive lesson.",
        "author": "Crazy_Tooth1858",
        "created_utc": 1748982449,
        "score": 10,
        "parent_id": "t3_1l2f08z",
        "depth": 0
      },
      {
        "id": "mvt7mx0",
        "body": "You're a new patient after x amount of years. I think 2 or 3. Alot of offices do it.",
        "author": "nuke1200",
        "created_utc": 1748973627,
        "score": 8,
        "parent_id": "t3_1l2f08z",
        "depth": 0
      },
      {
        "id": "mvw7dkj",
        "body": "Small claims court allows you to do discovery. \n\nYou can demand that they prove that the doctor actually spent the amount of time they say did looking at your chart. \n\nMy suggestion is to contact the doctors office and let them know that you are going to enforce your right to discovery including your right to see their redacted appointment book and ascertain how many patients they saw that day, \n\nAnd their redacted billing records \n\nso that you can match up if the amount of time billed for the day is more than the amount of time possible for billing\n\nThere is no way this office is not double billing people,\n\nThose reviews you mentioned, were this is a common practice they have of over billing are things that you can introduce as evidence in small claims court.\n\nRemember you also have the right to countersue, you can sue in small claims court for your list income in defending yourself from a spurious suit\n\nLastly you can also run a check to see how many small claims court suits are filed by this company every year to see whether or not you pursue the defense of vexatious litigation\n\nBasically your defense can be that this company utilizes the court system in a way that they are not meant to utilize it, and as such the suit should be thrown out because they file too many lawsuits each year",
        "author": "Flipperanon",
        "created_utc": 1749009638,
        "score": 6,
        "parent_id": "t3_1l2f08z",
        "depth": 0
      },
      {
        "id": "mvv93so",
        "body": "The blind signing is not a compelling argument for you. Do not bring it up in court.",
        "author": "annoyed__renter",
        "created_utc": 1748996830,
        "score": 5,
        "parent_id": "t3_1l2f08z",
        "depth": 0
      },
      {
        "id": "mvvicdr",
        "body": "If you signed it, then you basically said you understood it. That's not going to be a defense for you.",
        "author": "DeadMetalRazr",
        "created_utc": 1749000098,
        "score": 3,
        "parent_id": "t3_1l2f08z",
        "depth": 0
      },
      {
        "id": "mvwoyf2",
        "body": "If you weren’t a new patient then the billing is fraudulent. I can’t tell you how to get out of paying but you can cost them more than they cost you easily. It doesn’t matter what you signed, they still ripped off the insurance company. They probably do this often. If they accept Medicare then they have done it to them also. The price for billing incorrectly to Medicare is treble damages. Ignorance isn’t a defense (I don’t say that as some kind of state,ent, it literally is not a defense. If they did it they will have to pay regardless). If they’ve done it they will pay. Contact Medicare and inform them of their practices. Medicare will gladly milk them for every dollar they can get.",
        "author": "sfly301",
        "created_utc": 1749018201,
        "score": 2,
        "parent_id": "t3_1l2f08z",
        "depth": 0
      },
      {
        "id": "mvzgcf1",
        "body": "Leave a review online detailing what happened and report it to the medical board. It will disappear quickly when faced with those costs.",
        "author": "AustinCJ",
        "created_utc": 1749057294,
        "score": 3,
        "parent_id": "t3_1l2f08z",
        "depth": 0
      },
      {
        "id": "mvtodmc",
        "body": "My dermatologist sent a skin tag to be checked for cancer so my insurance company would pay for it 100%. I think they can help you if you’re cool. So can your insurance company.  Paying nothing out of pocket however, is going to cost you in front of the judge imo. Good luck",
        "author": "Tiki46",
        "created_utc": 1748979029,
        "score": 2,
        "parent_id": "t3_1l2f08z",
        "depth": 0
      },
      {
        "id": "mvv4bmf",
        "body": "See if your state has pro bono assistance clinics for small claims litigants.  Talk to them or the court clerk about how to subpoena the doctor for trial.\n\nI disagree with the other commentator who said that costs and fees are hard to get in court.  Before I retired from law I defended collections cases in three different states, and the best I was able to do was get attorneys fees or some interest knocked off.  Court costs are **always** awarded.",
        "author": "Frondelet",
        "created_utc": 1748995139,
        "score": 2,
        "parent_id": "t3_1l2f08z",
        "depth": 0
      },
      {
        "id": "mvvizjz",
        "body": "At this point, you've gotten plenty of advice about how you were in the wrong here, which sucks, but is what it is.\n\nNow, you need to know how to proceed going forward.  My advice would be to go in as if you have not learned anything from this thread, by making a statement that the bill was incorrectly coded, that your copay should have been $35 or whatever, and you have repeatedly offered to pay that $35. Show the evidence you have that you are a pre-existing customer.\n\nDO NOT admit to knowing, or even suspecting, that you may be in the wrong. DO NOT mention anything about it being 3 years or more since your last visit. These are all issues for the opposing side to raise against you, and there's always a chance they don't.\n\nDepending on how thorough the opposing counsel and judge are, you may luck out and get a verdict in your favor ordering you to pay the $35 (unlikely but possible), you may get the judge to order you to pay the $121 and leave it at that (very likely), or you may get caught out for the full amount they're requesting, which you can still pay out over time.",
        "author": "texas_accountant_guy",
        "created_utc": 1749000324,
        "score": 2,
        "parent_id": "t3_1l2f08z",
        "depth": 0
      },
      {
        "id": "mvvrkf5",
        "body": "wait isn't small claims court where u can't have lawyers",
        "author": "ttypeguy",
        "created_utc": 1749003369,
        "score": 2,
        "parent_id": "t3_1l2f08z",
        "depth": 0
      },
      {
        "id": "mvvtwui",
        "body": "You said it's collections. Make sure you ask for proof that they own the debt, as well as proof that the services were performed. The goal isn't always to show how they are wrong, but rather ask for proof to their claim that they might have lost, and especially with collections, they might not have actually gotten that proof\n\nThat said, I had a dentist claim they sent me to collections (I got a letter from a lawyer...who was clearly their husband), they actually had never sent me a bill or called, just dentist appointment then collections. I just went to the dentist and convinced the receptionist to accept payment for the number on the EOB.\n\nDoing something like paying the dentist would invalidate the claim, dentist can't sell a debt and then continue to collect it",
        "author": "edman007",
        "created_utc": 1749004232,
        "score": 2,
        "parent_id": "t3_1l2f08z",
        "depth": 0
      },
      {
        "id": "mvwcm3t",
        "body": "Clinics can bill as a new patient if you haven’t been seen in 3+ years. The time documented (and billed) in the encounter includes all of the time the provider spent seeing you, thinking about your visit, ordering any tests or documenting photos, and writing the note.",
        "author": "sweetawakening",
        "created_utc": 1749012001,
        "score": 2,
        "parent_id": "t3_1l2f08z",
        "depth": 0
      }
    ],
    "1l2koax": [
      {
        "id": "mvtnlox",
        "body": "CT police can't just randomly stop you and ask for ID. \n\nThat said, it sounds like they would explain that they were \"investigating a possible disturbance\", and, encountering you as the homeowner of said disturbance, have reason to ask you to identify yourself -- otherwise you may be hindering their investigation. \n\nYou handled this perfectly, BTW, by remaining compliant but not allowing him unwarranted access into the house.",
        "author": "jester29",
        "created_utc": 1748978794,
        "score": 440,
        "parent_id": "t3_1l2koax",
        "depth": 0
      },
      {
        "id": "mvv2cmx",
        "body": "The claim of \"screams\" was an attempt to create \"probable cause\" out of nothing. They likely saw multiple cars clustered around your home, and decided that they would \"extend\" their investigation involving the car to your home.  Coincidentally, the Supreme Court just took up just this issue in \"William T. Case vs Montana\", where the cops entered a home without a warrant based upon an ex-girlfreind's claim that he had threatened to commit suicide.  They shot Mr. Case, so it may have been a VERY good move to not let the cops in.  \nSo, \"probable cause\" or \"reasonable belief\" or whatever lame excuse they want, they can knock on the door, and inquire about what is going on.  The request for ID?  It was a compliance test.  It was intended to find out if you were going to \"obstruct their investigation\" by refusing to show that you were who you said you were, which would then give them (perhaps) a basis to \"detain\" (handcuff) you while they attempted to verify your identity by other means like \"What's your social?\" and \"What's your birth date?\"\n\nSo many encounters with police seem to be nothing but an excuse for them to ratchet up the situation to one where they fabricate \"probable cause\" by asking questions, asking to search, and so on.  The stock answer has to be \"if you have to ask, the answer is no\", as they are not \"investigating\", they are snooping around for an excuse to make an arrest, on the assumption that everyone they meet is a suspect, rather than a citizen.",
        "author": "packetfire",
        "created_utc": 1748994466,
        "score": 199,
        "parent_id": "t3_1l2koax",
        "depth": 0
      },
      {
        "id": "mvv99zb",
        "body": "No, you were not required to ID yourself. \n\nHowever, you did the right thing by providing it.  If you had refused, he could have escalated the matter and it may not have ended well.",
        "author": "CostRains",
        "created_utc": 1748996893,
        "score": 78,
        "parent_id": "t3_1l2koax",
        "depth": 0
      },
      {
        "id": "mvv1yn9",
        "body": "This is why you don't open the door for the cops. EVER. If they are coming in they are coming in, don't make it easy for them. I say this as someone married to a cop. I don't even open the door for her. Get a warrant, babe!",
        "author": "SailplaneArsonist",
        "created_utc": 1748994337,
        "score": 56,
        "parent_id": "t3_1l2koax",
        "depth": 0
      },
      {
        "id": "mvvvp8c",
        "body": "General rule of thumb is don’t open the door for LEOs.",
        "author": "sumothong01",
        "created_utc": 1749004894,
        "score": 45,
        "parent_id": "t3_1l2koax",
        "depth": 0
      },
      {
        "id": "mvvx6dh",
        "body": "Best way to defend yourself in a situation like this is to simply state \"No, you cannot come into my home, but if you have a legal right to do so, I have no intentions of getting in your way, but I do not consent to any searches.\"\n\nThey will inevitably press you over and over again for \"permission\" on the grounds of \"being polite\", but just keep repeating what you said.\n\nIf they enter your home and can legally do so, they can't try slapping you with obstruction or some stupid shit.\n\nIf they enter your home and CANNOT legally do so, you've made it abundantly clear you do not consent, so they can't come off and say \"well he didn't tell us no\"\n\nOr they'll realize they're not gonna get anywhere with it, and they'll leave.\n\nNo matter what, your safety is kept as a top priority while also maintaining a polite and respectful tone, while also showing them that you know your rights.",
        "author": "Fanryu1",
        "created_utc": 1749005459,
        "score": 21,
        "parent_id": "t3_1l2koax",
        "depth": 0
      },
      {
        "id": "mvvvmiw",
        "body": "You are not required to answer your door if a police officer is knocking.  Better yet, never answer the door if a police officer is knocking! Tell them to leave the curtilage of your home.",
        "author": "davidcastillorios",
        "created_utc": 1749004867,
        "score": 15,
        "parent_id": "t3_1l2koax",
        "depth": 0
      },
      {
        "id": "mvwqhph",
        "body": "Next time close the door and don't come back. Or don't open the door in the first place. Do not engage for converse with police unless necessary.",
        "author": "borgofdirectors",
        "created_utc": 1749019042,
        "score": 7,
        "parent_id": "t3_1l2koax",
        "depth": 0
      },
      {
        "id": "mvw1nlo",
        "body": "You didn’t have to but in this case it saved you a possible headache and the cops ego making him take things further. Sounds like he didn’t run your ID through the system so that’s a plus.",
        "author": "bigmac9",
        "created_utc": 1749007237,
        "score": 5,
        "parent_id": "t3_1l2koax",
        "depth": 0
      },
      {
        "id": "mvwqn3z",
        "body": "I'm surprised he let you close the door; so often you see them stick their foot in a bit so that you can't.",
        "author": "LuckyBook1538",
        "created_utc": 1749019123,
        "score": 3,
        "parent_id": "t3_1l2koax",
        "depth": 0
      },
      {
        "id": "mvxin5c",
        "body": "You only have to present ID when stopped for a traffic violation or there is reasonable suspicion that a crime has been committed.  If none of these occurred then you are under no obligation to present ID.  If the police threaten arrest for not showing ID then they are violating your 4th amendment right and can be sued.",
        "author": "jk320113",
        "created_utc": 1749034996,
        "score": 3,
        "parent_id": "t3_1l2koax",
        "depth": 0
      }
    ],
    "1l2bsri": [
      {
        "id": "mvrlt3m",
        "body": "This is a small claims case? I would just get the evidence. The judge may simply ask, \"do you need more time to review this?\" and let you postpone if you do need more time. Even if the judge doesn't allow the evidence (I assume they will) then the defendant gets to appeal.",
        "author": "modernistamphibian",
        "created_utc": 1748957281,
        "score": 464,
        "parent_id": "t3_1l2bsri",
        "depth": 0
      },
      {
        "id": "mvsbekg",
        "body": "Lawyer here. If he tried to enter the evidence object. Explain how he tried to serve the evidence. Rules exist for a reason. Worst that happens is judge let's it in.",
        "author": "fartsfromhermouth",
        "created_utc": 1748964748,
        "score": 314,
        "parent_id": "t3_1l2bsri",
        "depth": 0
      },
      {
        "id": "mvs3329",
        "body": "In the LA Small Claims Court, evidence must be submitted via mail to the court and the opposing party, along with receipts, at least 10 days before the scheduled case.",
        "author": "Timely-Lake-2372",
        "created_utc": 1748962420,
        "score": 200,
        "parent_id": "t3_1l2bsri",
        "depth": 0
      },
      {
        "id": "mvrms3r",
        "body": "He told me he had “documents for me” also “I didn’t know what he wanted” ?",
        "author": "Jahman876",
        "created_utc": 1748957595,
        "score": 94,
        "parent_id": "t3_1l2bsri",
        "depth": 0
      },
      {
        "id": "mvrrot6",
        "body": "Was this through a Ring doorbell or something?",
        "author": "sc0n3z",
        "created_utc": 1748959108,
        "score": 27,
        "parent_id": "t3_1l2bsri",
        "depth": 0
      },
      {
        "id": "mvrw86q",
        "body": "Man I'm so glad I paid a lawyer for my case. ",
        "author": "Destructopoo",
        "created_utc": 1748960447,
        "score": 7,
        "parent_id": "t3_1l2bsri",
        "depth": 0
      },
      {
        "id": "mvsby6v",
        "body": "\nYou know what to do.  \nIf he has evidence… or whatever …He needs to present it to the court.  Direct contact between a defendant and the other side, regardless of criminal or civil, is improper.   \nThere is a proper way for it to be presented. That was not it.  If he does not have legal counsel to advise him in such matters, the Court will take care of his needs.",
        "author": "This_Instruction4077",
        "created_utc": 1748964900,
        "score": 7,
        "parent_id": "t3_1l2bsri",
        "depth": 0
      },
      {
        "id": "mvsfkcu",
        "body": "You can attend court without it; it will be available if necessary. Adhere to the court rules. I’m unsure why you would seek it if it hasn’t been processed within the 10-day guideline, as the court has directed.",
        "author": "Sminnea",
        "created_utc": 1748965901,
        "score": 4,
        "parent_id": "t3_1l2bsri",
        "depth": 0
      },
      {
        "id": "mvv9rxo",
        "body": "If this is small claims, then California doesn't use formal rules of evidence.  If you haven't had time to review the evidence, you can ask the judge for a continuance.",
        "author": "CostRains",
        "created_utc": 1748997073,
        "score": 2,
        "parent_id": "t3_1l2bsri",
        "depth": 0
      }
    ],
    "1l2ki3w": [
      {
        "id": "mvtm3cu",
        "body": "> Can i just get my tooth pulled then walk out so i wont be charged for the implant?\n\nYes... sort of.\n\n> Is it illegal?\n\nNo.\n\n> can they still charge me? \n\nYes. \n\nBetween the charges and your dental health, it would be **FAR** better to just tell them you don't want the implant or bone graft at this time, to send you an estimate on pricing and you'll call back to schedule that, but you just want the extraction done today.   Then you're not leaving the job half done and at least they can clean you up properly.",
        "author": "jester29",
        "created_utc": 1748978330,
        "score": 447,
        "parent_id": "t3_1l2ki3w",
        "depth": 0
      },
      {
        "id": "mvtlmf1",
        "body": "You can leave AMA at any point that you are competent enough to do so.  They can still bill you for the allotted time that had been set aside for the procedure if you do.   And there will likely be medical complications.\n\nJust find a different dentist that will do the extraction without requiring bone grafts and save everyone a lot of trouble.",
        "author": "SendLGaM",
        "created_utc": 1748978180,
        "score": 414,
        "parent_id": "t3_1l2ki3w",
        "depth": 0
      },
      {
        "id": "mvtskdv",
        "body": "Do not leave in the middle before the procedure is complete. Either don’t start it or do completely finish the entire sequence of procedures.  Nothing between these two. Why? Because the risk of infection is high if you don’t finish it.  You really, really don’t want an infection in your jaw bone or your blood. Just don’t.",
        "author": "RainInTheWoods",
        "created_utc": 1748980271,
        "score": 111,
        "parent_id": "t3_1l2ki3w",
        "depth": 0
      },
      {
        "id": "mvtljuu",
        "body": "Just find another dentist.\nRealistically speaking you will have a unsealed gaping hole in your mouth without antibiotics.\n\n\nIf you can afford going to Mexico go to Mexico for cheaper care or get a different dentist that will seal you up appropriately and give you the drugs. ",
        "author": "CakeisaDie",
        "created_utc": 1748978156,
        "score": 79,
        "parent_id": "t3_1l2ki3w",
        "depth": 0
      },
      {
        "id": "mvu283q",
        "body": "not a doctor, or a lawyer, but a guy who has had to go through many dental procedures...you're likely not going to be in great shape to walk out of a dentists office that has just pulled a tooth from your mouth and wants to do additional procedures. just speaking from my experience of extraction and bone graft. if they tell you they won't do one without the other, you should get a second opinion, instead of trying to dip out of the office mid procedure. \n\nadditionally, bone grafts are meant to help with casting dentures as the bone structure will more closely mimic what they are used to producing; also bone missing in the socket area means more space for foodstuffs to get hidden and cause infection in your gums. not getting this will put your oral health at risk if you do not have great oral hygiene to begin with. \n\n  \nto me, the racket to look out for is if they want to put you under for these procedures. i handled with local anesthesia just fine.\n\n  \nget what they are recommending would be my 2 cents",
        "author": "Coopers_Croze",
        "created_utc": 1748983044,
        "score": 33,
        "parent_id": "t3_1l2ki3w",
        "depth": 0
      },
      {
        "id": "mvtymza",
        "body": "Try and find another dentist, but when I had a tooth extracted (also in Nevada) they recommended a graft not just for an implant but because of the location of the tooth being pulled (back molar, no wisdom teeth) because they were concerned about my other teeth moving. Now, maybe I was swindled, but I had made it clear I didn't plan to get an implant as well and this was the additional context the dentist provided.",
        "author": "wildmishie",
        "created_utc": 1748982017,
        "score": 15,
        "parent_id": "t3_1l2ki3w",
        "depth": 0
      },
      {
        "id": "mvuc91r",
        "body": "Perhaps see if a nearby university has a dental school. You get quality care overseen by a licensed professional at a discount rate, a student gets practice, and everybody wins.",
        "author": "Ok-Psychology8086",
        "created_utc": 1748985993,
        "score": 11,
        "parent_id": "t3_1l2ki3w",
        "depth": 0
      },
      {
        "id": "mvu67ik",
        "body": "Dentist here. Find a new dentist. You are the patient and it’s your mouth. If this dentist is the only choice, they should respect your autonomy and take the tooth out with no bone graft.",
        "author": "Dgc2017",
        "created_utc": 1748984183,
        "score": 10,
        "parent_id": "t3_1l2ki3w",
        "depth": 0
      },
      {
        "id": "mvtv9cv",
        "body": "So you don’t have any more teeth? Any prior existing implants? If you have zero additional teeth left, then yes, u can just get that remainder tooth extracted without the need of an implant and grafts. I’m just going to throw this out there- dentures are removable and are a solution for no existing natural teeth. If you have a few teeth and are ok with a removable appliance and price is factor, you could get a removable partial to fill in for the missing teeth. If you want something fixed, have a few strong healthy teeth and price is a factor, you can get a fixed bridge. But the bridge can only be anchored by healthy natural teeth. If you price isn’t a factor, you can a fixed denture held in by implants. Not every extracted tooth needs bone grafting. And if you are having a full “denture” fixed by implants, a decent surgeon just places the implants where the bone is the healthiest without the need of grafting. Implants can only be anchored implant to implant. And you can only anchor a fixed bridge natural tooth to natural tooth. Lastly, a single tooth implant is the better solution to a single missing tooth. \n\nTldr- you can just schedule an extraction if that’s all you want done",
        "author": "Ok-Temperature-2783",
        "created_utc": 1748981045,
        "score": 8,
        "parent_id": "t3_1l2ki3w",
        "depth": 0
      },
      {
        "id": "mvv97nd",
        "body": "Go to a university dental school. They love to have students pull teeth under faculty supervision. When I was a dirt-poor refugee in America, dental schools like Georgetown and U-Md in the Washington DC area give free (or quasi-free) dental care to poor people and pulling teeth is what they love to do. Cavities? Pull. Gum bleeding? Pull. Pains? Pull.  The reason they do that is once these students get into private practice, they won't have and don't want to have too many opportunities to pull teeth as the money is in fixing and repairing.",
        "author": "Puzzleheaded-Ad2512",
        "created_utc": 1748996869,
        "score": 4,
        "parent_id": "t3_1l2ki3w",
        "depth": 0
      },
      {
        "id": "mvvmqyt",
        "body": "I’m an oral surgeon.  They are not ethical.  You do not need a bone graft after an extraction, especially if you do not want an implant.  When you sign consent for the procedure, make sure the bone graft (aka socket preservation) is not on the consent form.",
        "author": "RoughhouseRobo",
        "created_utc": 1749001642,
        "score": 4,
        "parent_id": "t3_1l2ki3w",
        "depth": 0
      },
      {
        "id": "mvujrwp",
        "body": "Plenty of good advice but please don’t leave mid appointment. You can go to a different dentist but likely they will still recommend a bone graft. Once the tooth is gone your body considers that area non vital (no pressure being put on the bone) and can resorb calcium to use for other body functions. Even when you get all your teeth pulled for dentures, unless you are already a million years old, they are going to put bone in to preserve your arches. Implants are recommended to keep the bone vital and keep your body from stealing the calcium and other minerals for other body functions. A lot of patients who can’t fork over 50 grand for a full mouth of implants (six to eight on both top and bottom) will start with two to four on top and at minimum, two on the bottom, as the bottom arch tends to get resorbed faster, is thinner, and more susceptible to fracture. Your financial concerns are valid. Even if you don’t opt for a bone graft, you would likely need a suture or two so the wound closes properly and you don’t want to burn your bridge in case you need to return for post op complications. If you can’t get this doctor to do the procedure under your terms, find a different doctor. Bone grafts and implants are the standard of care, but first and foremost you are the patient, it is your mouth and if you have the education to support the procedure and still choose to forgo the graft, that is your right and the dentist you are paying should respect that 100%.",
        "author": "durden226circa1988",
        "created_utc": 1748988325,
        "score": 3,
        "parent_id": "t3_1l2ki3w",
        "depth": 0
      },
      {
        "id": "mvujwzs",
        "body": "Just tell your dentist prior to appointment you just want tooth extracted and not agreeable to the graft and future implant.",
        "author": "Direct-Level-8767",
        "created_utc": 1748988370,
        "score": 3,
        "parent_id": "t3_1l2ki3w",
        "depth": 0
      },
      {
        "id": "mvup30f",
        "body": "Find another dentist, I had to argue with my dentist years ago to just do an extraction as it was all my insurance would cover and I was broke. I had suffered three jaw infections up to that point because the tooth was cracked bad exposing the nerve. She had the best of intentions, I was young and she wanted me to have a whole mouth of teeth, I explained the situation and she relented. It was a molar near the back, still have the hole. Life goes on.",
        "author": "ActingAndGrinding",
        "created_utc": 1748990066,
        "score": 4,
        "parent_id": "t3_1l2ki3w",
        "depth": 0
      },
      {
        "id": "mvut908",
        "body": "Just find another dentist. Someone will pull it without the graft. My dentist kept recommending it like 5 times even when I was about to get tooth pulled. ",
        "author": "Dreamer102694",
        "created_utc": 1748991453,
        "score": 3,
        "parent_id": "t3_1l2ki3w",
        "depth": 0
      },
      {
        "id": "mvu7owa",
        "body": "Go to a different dentist.",
        "author": "snortingalltheway",
        "created_utc": 1748984612,
        "score": 2,
        "parent_id": "t3_1l2ki3w",
        "depth": 0
      },
      {
        "id": "mvui9ji",
        "body": "Are you like sitting in the dentist chair posting on Reddit?  If you don’t want the graft find a new dentist.",
        "author": "PowerfulDuty4884",
        "created_utc": 1748987844,
        "score": 2,
        "parent_id": "t3_1l2ki3w",
        "depth": 0
      },
      {
        "id": "mvv6cu8",
        "body": "I have worked in dentistry for 17 years. Please do not just get up and walk out once the tooth is pulled. You’re going to miss important post op information, and they will dismiss you as a patient. They will still bill you the full appointment charge. \n\nIf you don’t want a bone graft, tell them. Let them know you’ll sign whatever form necessary saying you’ve been given the choice and your opting for treatment against medical advice. \n\nIf you’re not worried about losing the dentist then why not just find a dentist to the extraction only. Seems like things are more complicated than they need to be.",
        "author": "SingleGirl612",
        "created_utc": 1748995852,
        "score": 2,
        "parent_id": "t3_1l2ki3w",
        "depth": 0
      },
      {
        "id": "mvvohts",
        "body": "No, you can’t work out in the middle. Go to a different dentist.",
        "author": "jasbflower",
        "created_utc": 1749002263,
        "score": 2,
        "parent_id": "t3_1l2ki3w",
        "depth": 0
      }
    ],
    "1l38uj3": [
      {
        "id": "mvyx98p",
        "body": "Your security deposit is not for rent. If it's not returned to you, you can sue her in small claims court. She doesn't have to allow you to use your deposit for rent.",
        "author": "too_many_shoes14",
        "created_utc": 1749051918,
        "score": 27,
        "parent_id": "t3_1l38uj3",
        "depth": 0
      },
      {
        "id": "mvyxyow",
        "body": "Do you have a lease?",
        "author": "KayKeeGirl",
        "created_utc": 1749052118,
        "score": 3,
        "parent_id": "t3_1l38uj3",
        "depth": 0
      },
      {
        "id": "mw1ey3z",
        "body": "Video tape the place when you move out. Hopefully you have pics from when you moved in.",
        "author": "Many_Bed_6464",
        "created_utc": 1749077904,
        "score": 2,
        "parent_id": "t3_1l38uj3",
        "depth": 0
      }
    ],
    "1l343fr": [
      {
        "id": "mvxuewi",
        "body": "Your property manager needs to post no unauthorized parking signs and then start towing people. They’ll get the hint quickly.",
        "author": "MysteriousCodo",
        "created_utc": 1749039886,
        "score": 19,
        "parent_id": "t3_1l343fr",
        "depth": 0
      },
      {
        "id": "mvxuvkz",
        "body": "Does your lease, or some contract, give you exclusive right to those spaces or is it just understood/promised?",
        "author": "ApprehensiveEarth659",
        "created_utc": 1749040063,
        "score": 17,
        "parent_id": "t3_1l343fr",
        "depth": 0
      },
      {
        "id": "mw0jch8",
        "body": "Restricted parking signs? Your company might not want to cover the cost to do so, though. Landlord might not want to cover any of the cost either.\n\nMaybe... Negotiate so the landlord covers cost of the sign posts and your company covers the cost of the signage? This is all dependent on where the signs would be placed, etc.\n\nOnce signage is up, contact a local towing company for a contract. They don't charge your company nor landlord for anything. Then, start getting vehicles towed.\n\nAdditional ULPT: smooth talk to tow company and get kickbacks for every vehicle towed for a \"free\" company lunch!",
        "author": "rockandink",
        "created_utc": 1749068335,
        "score": 2,
        "parent_id": "t3_1l343fr",
        "depth": 0
      }
    ],
    "1l2vkk3": [
      {
        "id": "mvx560s",
        "body": "Definitely get a Lawyer who specializes in this type of case.",
        "author": "No-Cause4432",
        "created_utc": 1749027728,
        "score": 20,
        "parent_id": "t3_1l2vkk3",
        "depth": 0
      },
      {
        "id": "mvykr4a",
        "body": "How long had she been working there? How many employees?",
        "author": "monkeyman80",
        "created_utc": 1749048369,
        "score": 2,
        "parent_id": "t3_1l2vkk3",
        "depth": 0
      }
    ],
    "1l2uet2": [
      {
        "id": "mvvy9vv",
        "body": "Follow him and call 911 saying an obviously intoxicated person is driving north on X street at 1st Ave. Have a friend do the same.",
        "author": "lynnejen",
        "created_utc": 1749005883,
        "score": 39,
        "parent_id": "t3_1l2uet2",
        "depth": 0
      },
      {
        "id": "mvw83w6",
        "body": "Put a tracker in his car ant give the police his exact location when you know he’s driving drunk.",
        "author": "SunBee301",
        "created_utc": 1749009957,
        "score": 21,
        "parent_id": "t3_1l2uet2",
        "depth": 0
      },
      {
        "id": "mvvzw1z",
        "body": ">he will have to be caught “in the act”\n\nCall the police every single time you are aware of him driving drunk.",
        "author": "Disastrous_Garlic_36",
        "created_utc": 1749006523,
        "score": 12,
        "parent_id": "t3_1l2uet2",
        "depth": 0
      },
      {
        "id": "mvvx3qr",
        "body": "Home insurance won’t provide any coverage for an auto accident. He needs to have high limits on his auto policy, plus an umbrella policy. Make sure your name isn’t on the title of any vehicle he or your mother own. And never allow him to drive your vehicle under any circumstances.",
        "author": "Anonymoosehead123",
        "created_utc": 1749005431,
        "score": 10,
        "parent_id": "t3_1l2uet2",
        "depth": 0
      },
      {
        "id": "mvvumsp",
        "body": "I mean, the most obvious answer is \"she divorces him,\" but she might not get to keep the house then, either.\n\nMake sure they have the maximum liability insurance (auto insurance) possible.  That can be up to $1 million liability plus an umbrella policy.\n\nBeyond that, if there's a judgment, they declare bankruptcy.",
        "author": "UsuallySunny",
        "created_utc": 1749004499,
        "score": 7,
        "parent_id": "t3_1l2uet2",
        "depth": 0
      },
      {
        "id": "mvwdxkq",
        "body": "Disable the car. Call him an uber, hire him a driver",
        "author": "dLimit1763",
        "created_utc": 1749012617,
        "score": 7,
        "parent_id": "t3_1l2uet2",
        "depth": 0
      },
      {
        "id": "mvvyn46",
        "body": "Try calling his insurance company and your State Police Department, not the local or county. Good luck!",
        "author": "Soggie1977",
        "created_utc": 1749006028,
        "score": 4,
        "parent_id": "t3_1l2uet2",
        "depth": 0
      },
      {
        "id": "mvwul8h",
        "body": "You could go where he typically drinks, voice your concerns to whoever is in charge, and see if they'll start sending him away earlier.  Do this when business would be slow. If they respond poorly, remind them of their responsibility to not over serve.\n\nAlternatively, see about getting ignition interlock devices installed in all the cars he has access to.\n\nSchedule a checkup for him and ask them to talk to him about his mortality and dangers of drinking so much.",
        "author": "reopened-circuit",
        "created_utc": 1749021320,
        "score": 2,
        "parent_id": "t3_1l2uet2",
        "depth": 0
      }
    ],
    "1l2v0sa": [
      {
        "id": "mvw4t7r",
        "body": "AZ law requires landlords to fix a broken AC within a reasonable time (24-48 hrs). If they fail to do this you may have several options here, including: terminating the lease, finding alternative housing until they fix it, repair the unit yourself and withhold the cost from your rent, or withhold rent or have it reduced.",
        "author": "TeamStark31",
        "created_utc": 1749008548,
        "score": 19,
        "parent_id": "t3_1l2v0sa",
        "depth": 0
      },
      {
        "id": "mvw6pxk",
        "body": "Most states don't have minimum cooling regulations, only minimum heating.\n\nBut it looks like it's pretty standard in AZ to require a certain level of cooling.\n\nBut that does not mean they have to do it NOW... this [article](https://www.azfamily.com/2025/05/28/ac-problems-heres-what-rights-renters-have-during-brutal-arizona-summer-heat/#:~:text=After%20that%20written%20notice%20is,they%20are%20below%20100%20degrees.) says they have 5 or 10 days, depending on the outside temps.\n\n\n\nI ran into this in a hot part of california  with a landlord who turned off the AC at 8:00pm.",
        "author": "anna_or_elsa",
        "created_utc": 1749009356,
        "score": 6,
        "parent_id": "t3_1l2v0sa",
        "depth": 0
      }
    ],
    "1l2m2cd": [
      {
        "id": "mvtyy00",
        "body": "This question was asked even more dramatically some time back about the blanket of a child who passed away. \n\nThe answer is there’s nothing you can do.\n\nYou left the item behind. They didn’t accept it or agree to be responsible for it. And if they had you’d be suing for the value of a used pillow. Zero. \n\nThat sucks. But the law just doesn’t treat “priceless” with a price.",
        "author": "reddituser1211",
        "created_utc": 1748982105,
        "score": 86,
        "parent_id": "t3_1l2m2cd",
        "depth": 0
      },
      {
        "id": "mvu671j",
        "body": "Sorry this happened to you. Unfortunately, legal recourse goes on the item's MONETARY value. Short of hoping that they find it, you aren't going to get much else. \n\nWhen you signed the paperwork for the room, there was likely a clause talking about items left behind not being their responsibility.",
        "author": "Shatterpoint887",
        "created_utc": 1748984179,
        "score": 36,
        "parent_id": "t3_1l2m2cd",
        "depth": 0
      }
    ],
    "1l2h44u": [
      {
        "id": "mvszt5l",
        "body": "Check the intestate laws in Oregon for the year your mother passed. Is/was your mother also on the deed to the house?\n\nAssuming you are an adult, you and your adult brother may own interest in the home through your mother.\n\nIf the payments aren't too high, and you can get your father to sign a power of attorney, it may be beneficial to continue paying for the home if it is not lost to the case your father is tied up in now.\n\nYou still have more to unpack here as far as the younger sibling is concerned as well. \n\nI would highly recommend checking with a family attorney regarding the younger sibling and an estate attorney regarding possible interest in the home.",
        "author": "JonWill49",
        "created_utc": 1748971520,
        "score": 68,
        "parent_id": "t3_1l2h44u",
        "depth": 0
      },
      {
        "id": "mvswse2",
        "body": "The house is deeded to your father and still on a mortgage, which means it really belongs to the bank until the mortgage is paid off, at which point it becomes your father's house. At any point in time, your father can sell it (he'll have to pay off the remaining mortgage before doing anything else with the money).\n\nYou're assuming you were in line to inherit this house, but understand that your father could be foreclosed on, lose it to a lien, lose it for failure to pay taxes, get remarried and thus have it become the marital assets of his new wife or husband, sell it, add someone else to the deed, quit claim it to another person... \n\nHave you spoken to your father about how he wants to handle the disposition of the property given that he's going to be in jail?",
        "author": "The-Voice-Of-Dog",
        "created_utc": 1748970704,
        "score": 33,
        "parent_id": "t3_1l2h44u",
        "depth": 0
      },
      {
        "id": "mvtio7a",
        "body": "The public defender can probably refer your father to someone who can advise him. You can also check into legal aid for yourself and siblings. This sounds like a terrible situation. Make sure you're acting under the advice of professionals to the best of your ability.",
        "author": "dudesmama1",
        "created_utc": 1748977012,
        "score": 9,
        "parent_id": "t3_1l2h44u",
        "depth": 0
      },
      {
        "id": "mvv70d8",
        "body": "Honestly how expensive is the house if they bought it in 2003 and they never took out a second mortgage it might very well be cheaper than just renting. But this comes with all of the responsibility of owning a home",
        "author": "Jspencjr24",
        "created_utc": 1748996082,
        "score": 5,
        "parent_id": "t3_1l2h44u",
        "depth": 0
      }
    ],
    "1l23cjw": [
      {
        "id": "mvqkjsw",
        "body": "Well you probably were charged with the felony theft of the vehicle with the department your mother filed with and then felony recieving stolen property with the department that arrested you. You cleared one charge up but that doesn't automatically clear the second charge. Sounds like you need to stop relying on your mother for anything but hugs. She's going to get you sent to prison doing stuff like this.\n\nGetting a lawyer and hopefully they can get it dismissed based on your story.\n\nAs an aside: I know you were probably being sarcastic about dragging your mom into recant her statement. With her behavior it would be really jeopardizing for you to attempt interactions with her. She is the victim in multiple cases where you are the suspect. Any attempt by you to get her to drop charges could easily be prosecuted as witness/victim tampering. Stop interacting with her until both these incidents are behind you.",
        "author": "AccidentalPursuit",
        "created_utc": 1748940542,
        "score": 813,
        "parent_id": "t3_1l23cjw",
        "depth": 0
      },
      {
        "id": "mvrhihk",
        "body": "Saying your mom is sometimes 'hysterical' does not cover this. She is psycho and needs treatment. Do not engage with her unless this happens. You are not seeing how unhealthy she is for you, by a mile.",
        "author": "Educational_Bench290",
        "created_utc": 1748955853,
        "score": 281,
        "parent_id": "t3_1l23cjw",
        "depth": 0
      },
      {
        "id": "mvr37q3",
        "body": "You need to get an attorney. \n\nAnd then you need to get your mom out of your life permanently. She could have easily gotten you killed with this stunt.",
        "author": "WTAF__Trump",
        "created_utc": 1748950395,
        "score": 178,
        "parent_id": "t3_1l23cjw",
        "depth": 0
      },
      {
        "id": "mvqat2k",
        "body": "Ask your mom to hire you a criminal defense attorney, to call the prosecutor ( who they work with often, unless you are in a large city) and have them ask about the case. A day or two later the DA will have an answer. none really cares once they hear it’s a mom and son. unless you mom cops an attitude and won’t help. She is the person reporting  and if she clears it up, it should go away. you’ll want ot carry a copy of the dismissal order in your car in case it takes awhile for the database to reflect your dismissal.",
        "author": "Pristine_Resident437",
        "created_utc": 1748934683,
        "score": 165,
        "parent_id": "t3_1l23cjw",
        "depth": 0
      },
      {
        "id": "mvrv0lc",
        "body": "Mom did something similar to me. Hired a lawyer and am still dealing with the fallout 10 years later.\n\nHire a lawyer and cut your mom out of your life like a tumor.\n\nTrust me. You'll be MUCH better off.",
        "author": "NullBodega9000",
        "created_utc": 1748960092,
        "score": 88,
        "parent_id": "t3_1l23cjw",
        "depth": 0
      },
      {
        "id": "mvre8k8",
        "body": "Get an attorney. Your attorney will talk to your mom. This should be quick and easy to clear up. And just so you know, your mom is an asshole for doing this and making all this necessary.",
        "author": "CH1C171",
        "created_utc": 1748954708,
        "score": 82,
        "parent_id": "t3_1l23cjw",
        "depth": 0
      },
      {
        "id": "mvro8wj",
        "body": "I call BS on this post nobody in South Carolina calls a prosecutor a solicitor ! And second it’s gonna be a state wide APB on the stolen car not city wide !This is AI BS!",
        "author": "SuperDave171771",
        "created_utc": 1748958059,
        "score": 25,
        "parent_id": "t3_1l23cjw",
        "depth": 0
      },
      {
        "id": "mvsc7mb",
        "body": "Your mother should be facing charges of filing a false police report, which would be your defense against your criminal charges.\n\nWhat do you mean by “a different name”?\n\nGet a lawyer.  Even a cheap lawyer should be able to get these charges dropped.",
        "author": "morepics2024hw",
        "created_utc": 1748964973,
        "score": 25,
        "parent_id": "t3_1l23cjw",
        "depth": 0
      },
      {
        "id": "mvri0wk",
        "body": "What everyone has said: get an attorney, have them contact the prosecutor, tell your mom to get a good therapist for her catastrophic thinking or go no contact with mom as soon as it is safe to do so. Honestly, that's so scary that this is what she jumped to over a pair of shoes.",
        "author": "Gwynebee",
        "created_utc": 1748956029,
        "score": 19,
        "parent_id": "t3_1l23cjw",
        "depth": 0
      },
      {
        "id": "mvrv1s7",
        "body": "My mom did this when I was a teenager it was my car but I was under 18 so it had to be registered in her name. She tried to drop the charges but they still went ahead with charging me. I ended up having to do community service for a lesser charge which was I believe unauthorized use of a motor vehicle.",
        "author": "I_AM_ME-7",
        "created_utc": 1748960101,
        "score": 24,
        "parent_id": "t3_1l23cjw",
        "depth": 0
      },
      {
        "id": "mvs76mv",
        "body": "Your mother is a psycho. Get therapy and lots of it until you're able to realize that. That was not a normal thing for her to do. Also get a lawyer",
        "author": "rexallsince1903",
        "created_utc": 1748963575,
        "score": 21,
        "parent_id": "t3_1l23cjw",
        "depth": 0
      },
      {
        "id": "mvt7s0d",
        "body": "Your mom isn’t hysterical. She’s straight up nuts. I would never talk to her again after she tries to make this right. What a nut job.",
        "author": "starchyarchiedog",
        "created_utc": 1748973666,
        "score": 12,
        "parent_id": "t3_1l23cjw",
        "depth": 0
      },
      {
        "id": "mvsxtkp",
        "body": "You had permission to use the vehicle she gave you the keys…how was she able to file grand charges?????",
        "author": "Open_Cherry3696",
        "created_utc": 1748970981,
        "score": 7,
        "parent_id": "t3_1l23cjw",
        "depth": 0
      },
      {
        "id": "mvsj2p3",
        "body": "You need a lawyer like yesterday.",
        "author": "Parrotlady99",
        "created_utc": 1748966876,
        "score": 7,
        "parent_id": "t3_1l23cjw",
        "depth": 0
      },
      {
        "id": "mvumubr",
        "body": "Stop driving the car",
        "author": "BestTackle8655",
        "created_utc": 1748989324,
        "score": 5,
        "parent_id": "t3_1l23cjw",
        "depth": 0
      },
      {
        "id": "mvrj6aq",
        "body": "Get a lawyer and a new mother.",
        "author": "theeed3",
        "created_utc": 1748956418,
        "score": 2,
        "parent_id": "t3_1l23cjw",
        "depth": 0
      },
      {
        "id": "mvrmfnl",
        "body": "You need an attorney and to stay away from your mother",
        "author": "27803",
        "created_utc": 1748957483,
        "score": 2,
        "parent_id": "t3_1l23cjw",
        "depth": 0
      },
      {
        "id": "mvw0gxp",
        "body": "my guess is youre leaving out some heavy details, but bottom line is, if you have proof she lends you the car you can prob get out of it- but id stop using a vehicle that you dont own. might have to catch rides and uber to a job unti lyou can get one, but my guess is you wont get hit with the larceny. talk to your mom , and to a lawyer.",
        "author": "carterk13486",
        "created_utc": 1749006757,
        "score": 2,
        "parent_id": "t3_1l23cjw",
        "depth": 0
      },
      {
        "id": "mvzavyy",
        "body": "Record all future interactions with her and make backups of those and any you may have from before. That would be evidence of her being unstable, or even possibly admitting that she overreacted and knows that you didn’t steal the car or her shoes, a previous history of her allowing you to use the car with or without heads up or terms of use, if she knew whether or not you were taking the car for the trip that started this, etc. good luck.",
        "author": "HaveIhookedyou",
        "created_utc": 1749055782,
        "score": 2,
        "parent_id": "t3_1l23cjw",
        "depth": 0
      }
    ],
    "1l2hdvb": [
      {
        "id": "mvswl6c",
        "body": "If someone is spoofing calls to your phone using information from your own contacts, then you've been hacked.  This is not a normal part of debt collection.",
        "author": "upievotie5",
        "created_utc": 1748970651,
        "score": 317,
        "parent_id": "t3_1l2hdvb",
        "depth": 0
      },
      {
        "id": "mvswggj",
        "body": "How did they get access to that? \n\nGenerally it’s not illegal to call someone. It might be illegal if they hacked into your phone or something.",
        "author": "TeamStark31",
        "created_utc": 1748970614,
        "score": 76,
        "parent_id": "t3_1l2hdvb",
        "depth": 0
      },
      {
        "id": "mvt0f53",
        "body": "You can file a consumer complaint with the FCC on their website about the number spoofing. ",
        "author": "FewReturn2sunlitLand",
        "created_utc": 1748971688,
        "score": 16,
        "parent_id": "t3_1l2hdvb",
        "depth": 0
      },
      {
        "id": "mvtr4nj",
        "body": "My guess is they possibly bought your call data from a data broker. They see a lot of activity from you with one number so they spoof that figuring you’ll answer. ",
        "author": "InsaneGuyReggie",
        "created_utc": 1748979854,
        "score": 11,
        "parent_id": "t3_1l2hdvb",
        "depth": 0
      },
      {
        "id": "mvuwtgf",
        "body": "The \"Call From\" portion of autodialing system is just a text field what can be filled in with whatever number the caller wants. Some companies have the field fill with a random number using your area code and the first 3 number of your phone number. Those numbers are likely to be local to your area and there is a chance they will be someone you know.",
        "author": "random8765309",
        "created_utc": 1748992629,
        "score": 4,
        "parent_id": "t3_1l2hdvb",
        "depth": 0
      },
      {
        "id": "mvv2d08",
        "body": "I’ve had this happen before haha. They used my uncles phone number. I answered “hey Lurch! (Inside family joke) what’s up?”",
        "author": "Accomplished_Shoe784",
        "created_utc": 1748994469,
        "score": 4,
        "parent_id": "t3_1l2hdvb",
        "depth": 0
      },
      {
        "id": "mvvci2i",
        "body": "It is not legal to send caller ID info that is not owned by you.  For example, it is OK for businesses to send out their main number regardless of which number within their business it came from, but not for them to send one that doesn't belong to them.  There used to be a car dealership in my town that somehow messed up what they were sending and it always came up as a debt collection agency, which is kinda funny.",
        "author": "Ok-Advertising2859",
        "created_utc": 1748998045,
        "score": 3,
        "parent_id": "t3_1l2hdvb",
        "depth": 0
      },
      {
        "id": "mvw094t",
        "body": "I’ve been called by my own phone number before. Sometimes the spoof-callers are just lazy as they play the numbers game.",
        "author": "veravela_xo",
        "created_utc": 1749006670,
        "score": 5,
        "parent_id": "t3_1l2hdvb",
        "depth": 0
      }
    ],
    "1l1yluz": [
      {
        "id": "mvottqd",
        "body": "No. You can pay it, or you can file police reports naming him. Somebody has to pay those tickets.",
        "author": "too_many_shoes14",
        "created_utc": 1748911683,
        "score": 4492,
        "parent_id": "t3_1l1yluz",
        "depth": 0
      },
      {
        "id": "mvphbr3",
        "body": "If he's been pulling this shit since he was 15 and he's now 23, what makes you think letting him get away with this behavior without feeling the very real, very serious consequences of vehicular theft is going to help him change?\n\nYou're enabling this behavior by trying to remove these consequences. He's grown. Let him learn. That's the only way he even has the CHANCE to grow.",
        "author": "onixpected21",
        "created_utc": 1748920335,
        "score": 1328,
        "parent_id": "t3_1l1yluz",
        "depth": 0
      },
      {
        "id": "mvound7",
        "body": "It is his doing.  You are not sending him to jail.... you are simply helping him learn a valuable lesson that he should have already learned. If he ends up in jail, you will be able to come to his aid and help him understand the error of his ways.",
        "author": "Lucky-Intention-3040",
        "created_utc": 1748911973,
        "score": 529,
        "parent_id": "t3_1l1yluz",
        "depth": 0
      },
      {
        "id": "mvoxcl9",
        "body": "You are going to have a hell of a time fighting the tickets and charges without explaining who stole then returned your car.\n\nGo get a lawyer, explain the circumstances, see what someone with knowledge of local laws has to say.\n\nThat being said, you raised a child that is willing to commit grand theft auto, fraud etc.  Do you think bailing him out repeatedly will make the situation better?  Depending on his age, consider military school.",
        "author": "AutomaticMonk",
        "created_utc": 1748912943,
        "score": 396,
        "parent_id": "t3_1l1yluz",
        "depth": 0
      },
      {
        "id": "mvovra6",
        "body": "This would be a good discussion with a criminal lawyer. They'll be familiar both with how to deal with your tickets, and how much trouble your son will be in if you report him.",
        "author": "lxw567",
        "created_utc": 1748912367,
        "score": 285,
        "parent_id": "t3_1l1yluz",
        "depth": 0
      },
      {
        "id": "mvotyvu",
        "body": "This is either you take responsibility for the tickets and pay for your son's actions or name him legally and he can pay for his mistakes.",
        "author": "Lt-shorts",
        "created_utc": 1748911735,
        "score": 139,
        "parent_id": "t3_1l1yluz",
        "depth": 0
      },
      {
        "id": "mvph10k",
        "body": "Your 23 year old son belongs in jail.  He’s reckless and a danger to others on the road.  As the registered owner, you need to pay the fines associated with your vehicle. You can try to recoup those monies in a civil case against your son.  There’s no “disputing the tickets”, the violations happened.",
        "author": "ovirto",
        "created_utc": 1748920217,
        "score": 109,
        "parent_id": "t3_1l1yluz",
        "depth": 0
      },
      {
        "id": "mvpf8lx",
        "body": "So he stole your car, racked up multiple traffic and moving violations, and you don't want to get him in trouble? Seriously?!?! His actions have consequences and you protecting him teaches him nothing other than his parent will bail him out.",
        "author": "Important-Ad3344",
        "created_utc": 1748919515,
        "score": 104,
        "parent_id": "t3_1l1yluz",
        "depth": 0
      },
      {
        "id": "mvpfowg",
        "body": "NAL but I work in the court and the amount of time I see parents trying to avoid their child facing consequences.... Either pay it off or file a report and hold them responsible. Based on your comments this doesn't seem like the first time they have done this and you're letting them get away with it? ... Yikes",
        "author": "Baekseoulhui",
        "created_utc": 1748919691,
        "score": 77,
        "parent_id": "t3_1l1yluz",
        "depth": 0
      },
      {
        "id": "mvouqqr",
        "body": "“Police report that the car was used without permission” is a strange way to say “report it stolen”. You can do that, and with the police report dispute the tickets, but you run the risk - which is likely to materialize - that your son will be charged with stealing your car. And, since there is video or pictures of him driving it, along with your testimony, he will probably be convicted. \n\nYour options largely break down to paying the fines or reporting it stolen. If you choose to pay then you could reach an agreement with your son, or sue him. If he doesn’t have any money then neither of those may be an option.",
        "author": "Malbethion",
        "created_utc": 1748912007,
        "score": 79,
        "parent_id": "t3_1l1yluz",
        "depth": 0
      },
      {
        "id": "mvpkp7c",
        "body": "The best thing that ever happened to my best friend's son was her deciding to stop bailing him out.",
        "author": "toilet_roll_rebel",
        "created_utc": 1748921718,
        "score": 48,
        "parent_id": "t3_1l1yluz",
        "depth": 0
      },
      {
        "id": "mvp15zn",
        "body": "You need to let the system deal with him. He needs to mature.",
        "author": "RAZR-540",
        "created_utc": 1748914320,
        "score": 39,
        "parent_id": "t3_1l1yluz",
        "depth": 0
      },
      {
        "id": "mvpgszr",
        "body": "I would turn him in to the police and not think twice about it.  Obviously this isn't the first time this kid pulled shenanigans.   He should have been parented and disciplined long before this",
        "author": "Original-Room-4642",
        "created_utc": 1748920128,
        "score": 38,
        "parent_id": "t3_1l1yluz",
        "depth": 0
      },
      {
        "id": "mvp3ika",
        "body": "In NY, red light and toll camera tickets are the responsibility of the registered owner of the vehicle. Doesn’t matter who was driving. They can suspend your registration if you don’t pay them.",
        "author": "liz30",
        "created_utc": 1748915160,
        "score": 29,
        "parent_id": "t3_1l1yluz",
        "depth": 0
      },
      {
        "id": "mvpg9vx",
        "body": "In NY, they don’t care. The owner gets the ticket. Thus it went against your credit. The state is under the premise that it’s your car and unless it was reported stolen, you should know who you lend your car to.\n\nhttps://www.nyc.gov/site/finance/vehicles/red-light-camera-violations.page",
        "author": "PochaccoBluez2020",
        "created_utc": 1748919920,
        "score": 27,
        "parent_id": "t3_1l1yluz",
        "depth": 0
      },
      {
        "id": "mvpctbl",
        "body": "Let this go before the DA & the Judge. Get a criminal lawyer for yourself, not your kid, & consult with them.\n\nThe DA decides whether or not there will be charges against the kid, not you. Frankly as others have said he needs to face consequences. If this follows him for the rest of his life, that's a consequence. It's unfair to you to shoulder the burden of his actions.",
        "author": "here_is_gone_",
        "created_utc": 1748918582,
        "score": 26,
        "parent_id": "t3_1l1yluz",
        "depth": 0
      },
      {
        "id": "mvowa5r",
        "body": "[ Removed by Reddit ]",
        "author": "Overall_Notice_4533",
        "created_utc": 1748912555,
        "score": 22,
        "parent_id": "t3_1l1yluz",
        "depth": 0
      },
      {
        "id": "mvpjphp",
        "body": "I get you are a parent who is trying to protect their kid but you also need to think more about his abhorrent behaviors.\n\nIf you bail him out now he will do something worse next and it might not be something that can be solved by paying tickets.",
        "author": "Working-Revenue-9882",
        "created_utc": 1748921307,
        "score": 24,
        "parent_id": "t3_1l1yluz",
        "depth": 0
      },
      {
        "id": "mvplbu9",
        "body": "I’m calling BS. How have tickets already gone to collection and hit your credit score in a few months?",
        "author": "Fragrant-Evening8895",
        "created_utc": 1748921981,
        "score": 23,
        "parent_id": "t3_1l1yluz",
        "depth": 0
      },
      {
        "id": "mvp2zt6",
        "body": "I would call the Police and say my son stole my car because that’s what he did.  Someone is going to have to pay the tickets.  Pray he doesn’t hurt someone with the car.  Your son is out of control (drinking, drugs, both).  He needs professional help.  Call a criminal attorney for a quick consultation.  This is most likely just the beginning of his spiral down .  Don’t hide under the covers.  Been there, done that.",
        "author": "Spirited-Force9185",
        "created_utc": 1748914975,
        "score": 19,
        "parent_id": "t3_1l1yluz",
        "depth": 0
      }
    ],
    "1l2kozc": [
      {
        "id": "mvtx0lf",
        "body": "Would the pool be unsupervised if he left to use the restroom, or is there enough lifeguards to adequately monitor the pool?",
        "author": "oaksandpines1776",
        "created_utc": 1748981551,
        "score": 29,
        "parent_id": "t3_1l2kozc",
        "depth": 0
      },
      {
        "id": "mvttn23",
        "body": "Would he be allowed to temporarily mark the bathroom Closed, and use it once all the kids have left?\n\nIt seems like having no bathroom availability in practice would be a violation. See [https://www.osha.gov/restrooms-sanitation](https://www.osha.gov/restrooms-sanitation)",
        "author": "TinyNiceWolf",
        "created_utc": 1748980580,
        "score": 31,
        "parent_id": "t3_1l2kozc",
        "depth": 0
      },
      {
        "id": "mvuqwpt",
        "body": "Or are they scared of improper behavior in the bathroom between adults and children or maybe some pics being taken. They must provide a bathroom so something needs to get figured out.",
        "author": "CindysandJuliesMom",
        "created_utc": 1748990674,
        "score": 11,
        "parent_id": "t3_1l2kozc",
        "depth": 0
      },
      {
        "id": "mvulc8s",
        "body": "Does he work shifts  longer than 4 hours?",
        "author": "ProjectGameGlow",
        "created_utc": 1748988832,
        "score": 7,
        "parent_id": "t3_1l2kozc",
        "depth": 0
      }
    ],
    "1l3qbj9": [
      {
        "id": "mw34o7v",
        "body": "Nope. Not legal. Talk to an attorney.",
        "author": "Angelofpity",
        "created_utc": 1749101345,
        "score": 9,
        "parent_id": "t3_1l3qbj9",
        "depth": 0
      }
    ],
    "1l3sxag": [
      {
        "id": "mw3h068",
        "body": "It makes sense that your sister’s property would be distributed amongst her rightful heirs. \n\nYou should speak with a probate attorney.  But you’re likely selling your home or buying their share.",
        "author": "reddituser1211",
        "created_utc": 1749108089,
        "score": 1,
        "parent_id": "t3_1l3sxag",
        "depth": 0
      }
    ],
    "1l3ul9h": [
      {
        "id": "mw3w9l8",
        "body": "You can report the sub to Reddit admins and they might remove it. Otherwise, taking any other legal action is going to be extremely difficult if it is possible at all as there is no way to know who is posting what and where they are posting from.",
        "author": "TeamStark31",
        "created_utc": 1749117234,
        "score": 3,
        "parent_id": "t3_1l3ul9h",
        "depth": 0
      }
    ],
    "1l3wv2f": [
      {
        "id": "mw494yk",
        "body": "Well, it sounds to me like you have written consent; your first lease, and the existence of your pet deposit.  A pet deposit wouldn't make any sense if the landlord didn't know, and accept, you have a pet.",
        "author": "Sirwired",
        "created_utc": 1749123494,
        "score": 1,
        "parent_id": "t3_1l3wv2f",
        "depth": 0
      },
      {
        "id": "mw49x2n",
        "body": ">my 1st year lease stated pets were allowed and acknowledged I have a cat. My landlord says the 2nd year lease extension is ok written this way, but I'm concerned he can keep my pet deposit bc I would be violating the lease having a pet. \n\nThat's your written consent.   And the pet deposit is to cover any extra damage done by your pet not something they use as a penalty fund.",
        "author": "SendLGaM",
        "created_utc": 1749123822,
        "score": 1,
        "parent_id": "t3_1l3wv2f",
        "depth": 0
      }
    ],
    "1l3we4z": [
      {
        "id": "mw48yz7",
        "body": "She needs to hire a lawyer and probate her husband's estate.  How long it will take depends on all kinds of things.",
        "author": "Disastrous_Garlic_36",
        "created_utc": 1749123423,
        "score": 2,
        "parent_id": "t3_1l3we4z",
        "depth": 0
      }
    ],
    "1l3r85f": [
      {
        "id": "mw34p6p",
        "body": "The decision to move forward with criminal charges is not up to you. You can try to get another protection order, but there's no guarantee that you will get it.",
        "author": "Rich_Cause5589",
        "created_utc": 1749101357,
        "score": 2,
        "parent_id": "t3_1l3r85f",
        "depth": 0
      },
      {
        "id": "mw360ri",
        "body": "You are unable to challenge the dismissal. That decision, sounds it was made by the District Attorney's Office, can be final (depends if charges were dismissed with or without prejudice).\n\n  \nOnly time you would have made a victim impact statement is generally during sentencing of the the individual.",
        "author": "West-Association812",
        "created_utc": 1749102043,
        "score": 1,
        "parent_id": "t3_1l3r85f",
        "depth": 0
      },
      {
        "id": "mw36e9o",
        "body": "You can refile it unless the case was dismissed with prejudice. There’s a lot of details we can’t really know or advise you on other than that without being involved in the case.",
        "author": "TeamStark31",
        "created_utc": 1749102239,
        "score": 1,
        "parent_id": "t3_1l3r85f",
        "depth": 0
      }
    ],
    "1l3oni2": [
      {
        "id": "mw2lffi",
        "body": "Why did your roommate give the cat to a rescue…?",
        "author": "Specialist-Disk3465",
        "created_utc": 1749092812,
        "score": 1,
        "parent_id": "t3_1l3oni2",
        "depth": 0
      }
    ],
    "1l3u1np": [
      {
        "id": "mw3p5o7",
        "body": "Where are they in the process of getting divorced? Does your mother have a lawyer? Whose name is the house in?",
        "author": "GlouriousLamp",
        "created_utc": 1749113010,
        "score": 3,
        "parent_id": "t3_1l3u1np",
        "depth": 0
      }
    ],
    "1l3q1si": [
      {
        "id": "mw2vlr4",
        "body": "The answer is always YES. get a legal representative asap",
        "author": "misguidedAnge1",
        "created_utc": 1749097015,
        "score": 2,
        "parent_id": "t3_1l3q1si",
        "depth": 0
      },
      {
        "id": "mw2vsq6",
        "body": "Explain your situation to a will/trust attorney and they'll work with you. But please do not try DIY",
        "author": "misguidedAnge1",
        "created_utc": 1749097101,
        "score": 1,
        "parent_id": "t3_1l3q1si",
        "depth": 0
      },
      {
        "id": "mw2x0sq",
        "body": "Some even defer their payment until you get paid if they know u got a winning case.",
        "author": "misguidedAnge1",
        "created_utc": 1749097648,
        "score": 1,
        "parent_id": "t3_1l3q1si",
        "depth": 0
      },
      {
        "id": "mw3508x",
        "body": "I think in Wisconsin you can file for a simple estate if it is below a certain sum. Go to probate and ask the probate clerk for form to file simple estate. List all assets and liabilities on that form, include final expenses such as final medical bills, funeral home, burial plot and include filing fee. Then get a court date from probate court to settle the estate. Clerk of that court is extremely knowledgeable so go to her for questions.",
        "author": "Spotty1957",
        "created_utc": 1749101513,
        "score": 1,
        "parent_id": "t3_1l3q1si",
        "depth": 0
      }
    ],
    "1l3pnyf": [
      {
        "id": "mw2zb7y",
        "body": "So, if your question is about whether this lawyer has a conflict of interest, the answer is no. That would occur if the interests of one client are contrary to the interests of another; here, both of the clients this attorney has had have the same opposing party, so the attorney isn't putting one against the other. \n\nIf your question is whether the attorney's actions fall under the nebulous and vague clause of \"refraining from offensive personality,\" that MAY be a little closer, but still probably not. Put bluntly, the opposing lawyer can absolutely embarrass or upset a party if doing so is legally justifiable, and what you described -- while kind of an SOB move -- is how a lot of family lawyers approach their practice. So, again, not the nicest way to handle things, but likely still found to be unethical",
        "author": "Big3ver3",
        "created_utc": 1749098703,
        "score": 1,
        "parent_id": "t3_1l3pnyf",
        "depth": 0
      },
      {
        "id": "mw34598",
        "body": "Are the court proceedings public record in your area?  \n\nDid the first ex give permission for this information to be used?",
        "author": "CostRains",
        "created_utc": 1749101078,
        "score": 1,
        "parent_id": "t3_1l3pnyf",
        "depth": 0
      }
    ],
    "1l3n4tt": [
      {
        "id": "mw285lk",
        "body": "He cannot force you to surrender the baby. If he won't voluntarily acknowledge paternity, it's not a huge problem to petition the courts and have them establish paternity. Look for a family practice lawyer.",
        "author": "theryman",
        "created_utc": 1749087998,
        "score": 24,
        "parent_id": "t3_1l3n4tt",
        "depth": 0
      },
      {
        "id": "mw28lea",
        "body": "Generally, You can’t sign a VAP with conditions. Also, why would you sign one and then “adopt out” the baby? \n\nIt feels like it’s a trust issue; he doesn’t trust you and doesn’t want to pay child support. \n\nA VAP is meaningless if you’re giving up the baby.",
        "author": "gmmwewlma",
        "created_utc": 1749088151,
        "score": 12,
        "parent_id": "t3_1l3n4tt",
        "depth": 0
      },
      {
        "id": "mw2bc8r",
        "body": "Yeah you can’t do any of this. \n\nHusband will likely be the presumptive father. Get an attorney, establish paternity in court.",
        "author": "BigRick74",
        "created_utc": 1749089103,
        "score": 5,
        "parent_id": "t3_1l3n4tt",
        "depth": 0
      },
      {
        "id": "mw280u8",
        "body": "Inal. Idk about the this for that aspect but he doesn't legally have to sign it. It is a voluntary document.",
        "author": "Inside-Friendship832",
        "created_utc": 1749087952,
        "score": 2,
        "parent_id": "t3_1l3n4tt",
        "depth": 0
      },
      {
        "id": "mw2p1gz",
        "body": "\n>I’m pregnant. And the biological father said he would be willing to sign the VAP only if I agreed to giving the child up for adoption or allowing him to place the child in a safe haven box. \n\nThis doesn't make sense. What's the purpose of a VAP if adoption is the plan?\n\n>Is that even legal? \n\nIt's not enforceable. Nobody can make you or coerce you into adoption.\n\n\n\n>Additional context:\n>Married. Bio father is not my husband. \n\nThen your husband will be the legal father. A VAP won't change that. \n\n\n>Pennsylvania is a presumed paternity state. So my husband is “legally” the father. \n\nThat's right. \n\n>But bio father said he’d sign a VAP and do a paternity test in an attempt to have my husband removed at legal father. \n\nIt's more involved than that. He will need to petition in court. Even if the hospital allows him to sign the VAP,  it won't matter. \n\nBut again... why would he do any of that if adoption is the goal?",
        "author": "ketamineburner",
        "created_utc": 1749094260,
        "score": 2,
        "parent_id": "t3_1l3n4tt",
        "depth": 0
      },
      {
        "id": "mw3t2wp",
        "body": "A VAP doesn't override a legal presumption of paternity. You need to file for a divorce, resolve the paternity issue in the divorce, and go from there. If the biological father isn't willing to sign a VOLUNTARY paternity acknowledgement, you can petition the court for a paternity determination/DNA test.",
        "author": "SlogTheNog",
        "created_utc": 1749115387,
        "score": 2,
        "parent_id": "t3_1l3n4tt",
        "depth": 0
      }
    ],
    "1l3oz7f": [
      {
        "id": "mw2wftq",
        "body": "So FBI handles international investigations but anonymous reports are not generally taken as serious since it can be difficult to have them testify in court or signing a statement.",
        "author": "West-Association812",
        "created_utc": 1749097389,
        "score": 1,
        "parent_id": "t3_1l3oz7f",
        "depth": 0
      }
    ],
    "1l3o0px": [
      {
        "id": "mw2kuxi",
        "body": "If you’re making them aware of the tree’s condition and not threatening legal action, then there is no difference.\n\nIf they choose to ignore the letter, I suggest you get signature service amd have proof of delivery returned to you.  That way if it does fall on your house, they cannot claim lack of knowledge.",
        "author": "garulousmonkey",
        "created_utc": 1749092592,
        "score": 1,
        "parent_id": "t3_1l3o0px",
        "depth": 0
      },
      {
        "id": "mw34e4v",
        "body": "They might take a lawyer's letter more seriously. \n\nBut there's no legal difference.",
        "author": "CostRains",
        "created_utc": 1749101203,
        "score": 1,
        "parent_id": "t3_1l3o0px",
        "depth": 0
      },
      {
        "id": "mw3mc2b",
        "body": "You need to do much more than a friendly reminder letter. You should probably contact your insurance and ask them. \n\nYour insurance may even contact THEIR insurance and do the threatening for you. Typically they find the other company and say “hey we got some concerning pictures and if anything happens we’re going to make your company pay for it…”\n\nTheir insurance may contact their customer, the neighbors, and say “hey- you need to take care of this or we’re dropping you/raising your rates/not covering this.”\n\nBut you could also look into a lawyer and have them do all this for you- but you might have to pay money since there is no grounds YET for suing or damages. \n\nBut 100% go out there and document with pictures. Call insurance but also get proof of contact with insurance like an email chain, or ask for everything they say back in writing. And if you do draft a letter to your neighbor, keep that as evidence too. If anything were to happen you need proof that you tried everything in your power to prevent it.",
        "author": "MNgeff",
        "created_utc": 1749111280,
        "score": 1,
        "parent_id": "t3_1l3o0px",
        "depth": 0
      }
    ],
    "1l3rtgb": [
      {
        "id": "mw3al3k",
        "body": "It's not against the law to be a disgusting creep. You can report it to Burger King's corporate offices but that's gonna be about all.",
        "author": "pase1951",
        "created_utc": 1749104464,
        "score": 9,
        "parent_id": "t3_1l3rtgb",
        "depth": 0
      },
      {
        "id": "mw3i5w6",
        "body": "No crime was committed, but what he did is most certainly against Burger King policy. You can report him to corporate.",
        "author": "TheAskewOne",
        "created_utc": 1749108778,
        "score": 3,
        "parent_id": "t3_1l3rtgb",
        "depth": 0
      },
      {
        "id": "mw3fod5",
        "body": "You do not have any legal avenues to pursue — none that I’m aware of, at least.",
        "author": "Breauxnut",
        "created_utc": 1749107319,
        "score": 2,
        "parent_id": "t3_1l3rtgb",
        "depth": 0
      },
      {
        "id": "mw3hs5z",
        "body": "Ew that's horrible! I would report them to the district manager, see if you can call a different location nearby and ask for the district manager's contact information. Give them as much info as you can, hopefully you got the guy's name. Best of luck to you!",
        "author": "LathyrusLady",
        "created_utc": 1749108548,
        "score": 2,
        "parent_id": "t3_1l3rtgb",
        "depth": 0
      }
    ],
    "1l3rkfa": [
      {
        "id": "mw384fb",
        "body": "Not mentioned here: The term of your lease, whether you were month-to-month or annual, whether you paid a deposit, what the lease's exit clauses were, whether the contract included AC, and... so forth.\n\nThis has \"rented room from a friend with no contract and no exit penalty\" vibes to it. Generally speaking, if the landlord lives in the house with everyone else, the landlord can set the thermostat wherever (thermostat is considered a \"commons,\" and while the house has to be able to reach a habitable temperature, there's no legal requirement for a resident to maintain it there).\n\n\"Physical discomfort\" is a tough tort to prove. \"Lost income,\" even moreso. \n\nIn any case, most of this depends on your contract.",
        "author": "theoriginalharbinger",
        "created_utc": 1749103138,
        "score": 1,
        "parent_id": "t3_1l3rkfa",
        "depth": 0
      }
    ],
    "1l3gswd": [
      {
        "id": "mw0rni4",
        "body": "How much do you currently owe? I’m not really sure the LL can be forced to accept the money, they might just want to be rid of you. Likely, if you all stopped paying rent, they don’t think you’ll pay again. Getting rid of you is easier than going through all this. You’d need to check with a tenant rights/renters assistance for more information.",
        "author": "Big-Routine222",
        "created_utc": 1749070667,
        "score": 4,
        "parent_id": "t3_1l3gswd",
        "depth": 0
      }
    ],
    "1l3rb85": [
      {
        "id": "mw37k6x",
        "body": "Yes, a property owner can trespass you from their property.",
        "author": "pv46",
        "created_utc": 1749102845,
        "score": 1,
        "parent_id": "t3_1l3rb85",
        "depth": 0
      },
      {
        "id": "mw4559y",
        "body": "I wouldn’t lose a lot of sleep over this as long as your actions were above the board.  Like if you made a simple mistake or the customer was being unreasonable and decided to abuse you for it it’s likely he will calm down and nothing will come of it.  It isn’t good business for him to be telling his tenants who they can and can’t employ.  \n\nIf you threw a drink in his face or harassed him it’s likely he will talk to the boss and you’ll probably get fired.",
        "author": "CTSkaGarty",
        "created_utc": 1749121734,
        "score": 1,
        "parent_id": "t3_1l3rb85",
        "depth": 0
      }
    ],
    "1l3kfwe": [
      {
        "id": "mw1okpl",
        "body": "Are your grandparents willing to stop financially supporting your aunt? \n\n\nIf they stop giving her money is she able to pay rent on her own?\n\n\n> The leasing company has admitted they knew that my grandfather was not the occupant, which is against the lease.\n\n\nWell it's not a great look for your grandfather either if he signed a lease saying he was the occupant, when he wasn't going to be.",
        "author": "dlaugh",
        "created_utc": 1749081119,
        "score": 1,
        "parent_id": "t3_1l3kfwe",
        "depth": 0
      }
    ],
    "1l3n4ar": [
      {
        "id": "mw2q3gf",
        "body": "1. Who is on the lease? \n\n2. Yes, of course. \n\n3. Neither would be the appropriate forum for this dispute, though family court will be necessary to establish a parenting plan. \n\n4. Protects you from what?",
        "author": "Rich_Cause5589",
        "created_utc": 1749094690,
        "score": 1,
        "parent_id": "t3_1l3n4ar",
        "depth": 0
      }
    ],
    "1l3r448": [
      {
        "id": "mw34k87",
        "body": "As long as you're being paid the tipped minimum wage and your portion of tips, there's no legal issue here. Your company can choose to alter contracts they have with clients.",
        "author": "pv46",
        "created_utc": 1749101289,
        "score": 1,
        "parent_id": "t3_1l3r448",
        "depth": 0
      }
    ],
    "1l3qzbs": [
      {
        "id": "mw33hfy",
        "body": "ignore him",
        "author": "Seantwist9",
        "created_utc": 1749100743,
        "score": 20,
        "parent_id": "t3_1l3qzbs",
        "depth": 0
      },
      {
        "id": "mw3bqto",
        "body": "Yeah OP, you probably just got convinced into handing in your Raspberry Pi and, even though it probably works, they're not gonna pay for it at this point claiming that it doesn't boot and therefore probably doesn't work. You might have legal avenues to get the money out of him but they're probably more expensive than the cost of the rpi. I'd take this as an expensive lesson to never send goods on FB marketplace without getting the cash first. Doing cash only in person hand over is the only way around this.",
        "author": "rickyman20",
        "created_utc": 1749105106,
        "score": 8,
        "parent_id": "t3_1l3qzbs",
        "depth": 0
      },
      {
        "id": "mw3d6kq",
        "body": "I would just ask, \"what OS did you install?\" If he did install one and it still doesn't work its a very different case in my mind.\n\nAnyone working with a Pi should at least know how to use the official raspbian install tools.",
        "author": "heggico",
        "created_utc": 1749105911,
        "score": 3,
        "parent_id": "t3_1l3qzbs",
        "depth": 0
      }
    ],
    "1l3qexp": [
      {
        "id": "mw2zi9n",
        "body": "Your lawyer, who you are already paying, seems to think so. Why would you bother with strangers on the internet?",
        "author": "AccidentalPursuit",
        "created_utc": 1749098796,
        "score": 1,
        "parent_id": "t3_1l3qexp",
        "depth": 0
      }
    ],
    "1l3qd6p": [
      {
        "id": "mw34z4d",
        "body": "Don't contact the store. Don't contact your friend. Hire a criminal defense attorney and follow their advice.",
        "author": "pv46",
        "created_utc": 1749101498,
        "score": 4,
        "parent_id": "t3_1l3qd6p",
        "depth": 0
      }
    ],
    "1l3j6uh": [
      {
        "id": "mw1b0oi",
        "body": "I can't imagine they can force you to be President. Just stop attending meetings and doing anything else your job would normally entail.\n\n\"Any director may resign at any time by sending a written notice of the resignation to the principal office of the association addressed to the secretary. Unless otherwise specified therein, the resignation shall take effect upon receipt thereof by the secretary\"",
        "author": "too_many_shoes14",
        "created_utc": 1749076632,
        "score": 6,
        "parent_id": "t3_1l3j6uh",
        "depth": 0
      },
      {
        "id": "mw1fs4p",
        "body": "Raise the dues, so you can hire someone to mow the lawn if you can't get any new volunteers",
        "author": "sweetrobna",
        "created_utc": 1749078174,
        "score": 3,
        "parent_id": "t3_1l3j6uh",
        "depth": 0
      },
      {
        "id": "mw49fcy",
        "body": "Not to be rude, you seem like an upstanding person. But now, you need to stop and stand up for yourself. The increase in dues is something to think about.",
        "author": "PolaTaxU",
        "created_utc": 1749123615,
        "score": 1,
        "parent_id": "t3_1l3j6uh",
        "depth": 0
      }
    ],
    "1l3q7w3": [
      {
        "id": "mw2xyhh",
        "body": "How old is she?  Crimes carry higher sentences when the victim is considered vulnerable.",
        "author": "queenofcrafts",
        "created_utc": 1749098074,
        "score": 2,
        "parent_id": "t3_1l3q7w3",
        "depth": 0
      },
      {
        "id": "mw39vow",
        "body": "You should be able to look him up through your county jail and see what he's been charged with after he's booked. You can call the jail too.",
        "author": "AlyssaAwesome",
        "created_utc": 1749104077,
        "score": 2,
        "parent_id": "t3_1l3q7w3",
        "depth": 0
      }
    ],
    "1l3q2au": [
      {
        "id": "mw2xfzx",
        "body": "So you can request a welfare check by contacting the agency where your nephew lives (might want to do a search on whether it is a county or city type of jurisdiction). Do this if you believe that your nephew may be in need of assistance.\n\n  \nJust a fair warning in advance without an address to go to it will be difficult to conduct this welfare check. While it sounds like you have a phone number for your nephew, if he does not pick up the phone when the police call then there is not much they can do since there is no address to go to.",
        "author": "West-Association812",
        "created_utc": 1749097839,
        "score": 1,
        "parent_id": "t3_1l3q2au",
        "depth": 0
      }
    ],
    "1l3phlf": [
      {
        "id": "mw2r5xu",
        "body": "You need a lawyer. Desperately. \n\nWhy do you want to or think you can remove the tenant?",
        "author": "reddituser1211",
        "created_utc": 1749095130,
        "score": 2,
        "parent_id": "t3_1l3phlf",
        "depth": 0
      }
    ],
    "1l3kdbd": [
      {
        "id": "mw1pjfu",
        "body": "There should be a case number and the court this is taking place in. So you should be able to get it from that court even if there are missing pages.\n\nIt isn't even clear right now you are the one intending to be served.\n\nOf course, always possible some pro se fool just copied and pasted something without thought.",
        "author": "MightyMetricBatman",
        "created_utc": 1749081456,
        "score": 1,
        "parent_id": "t3_1l3kdbd",
        "depth": 0
      }
    ],
    "1l3og3u": [
      {
        "id": "mw2k900",
        "body": "Nowhere near enough information to answer this question.",
        "author": "garulousmonkey",
        "created_utc": 1749092359,
        "score": 1,
        "parent_id": "t3_1l3og3u",
        "depth": 0
      }
    ],
    "1l3o80l": [
      {
        "id": "mw2kc93",
        "body": "This belong in r\\legaladviceeurope",
        "author": "garulousmonkey",
        "created_utc": 1749092394,
        "score": 1,
        "parent_id": "t3_1l3o80l",
        "depth": 0
      }
    ],
    "1l3jk4k": [
      {
        "id": "mw1grtp",
        "body": "No. I would definitely not assume this technicality overrides their express disapproval. And starting the count on 29 as 1 is reasonable. \n\nWhy did they disapprove?",
        "author": "reddituser1211",
        "created_utc": 1749078499,
        "score": 3,
        "parent_id": "t3_1l3jk4k",
        "depth": 0
      }
    ],
    "1l3jduv": [
      {
        "id": "mw1d9gx",
        "body": "Open up and new bank account & keep moving forward with your life. Now I don’t think you will go to jail if you called them, but any funds you get into that account will be deducted until fully paid.",
        "author": "LuckiiCharms34",
        "created_utc": 1749077364,
        "score": 8,
        "parent_id": "t3_1l3jduv",
        "depth": 0
      },
      {
        "id": "mw1ffjb",
        "body": "**I am not a lawyer, I cannot give legal advice. But I do think I can explain what happened.**\n\nIt sounds like you now know of a whole bunch of people who you shouldn't listen to when they are pressuring you to do something.\n\nThis seems like a check cashing scam, where someone writes a check for an amount of money that won't clear. It gets deposited into an account, before the bank knows the check won't clear they make the money available to the account holder as a convenience. The scammer pulls the cash from the account using an ATM or in this case cashapp. A few days later the bank catches on that the money doesn't exist and it tries to claw back the transaction but the money isn't there. The account goes negative.\n\nIf that's what happened, you're the victim and your classmate stole that money from you. You owe the bank the difference of how much your account is negative, and probably some fees. You should expect your account to get closed, and the bank not to allow you to open a new one. If you were aware and complicit in defrauding the bank, you could also be held accountable for that.  It's not clear from your story if you knew or not. This is fraud, though in a fairly small dollar amount.\n\nTake a breath, this isn't the end of the world. You're likely catastrophizing this. Take some lessons from this. Listen to some good advice that I'm sure you'll get on this thread. Start tomorrow a more prepared person than you were when you started today.",
        "author": "RonaldHarding",
        "created_utc": 1749078061,
        "score": 2,
        "parent_id": "t3_1l3jduv",
        "depth": 0
      },
      {
        "id": "mw1enwn",
        "body": "Most likely, if the account was left at 0, it was closed due to yearly fees and inactivity. Don't stress over it.",
        "author": "_Ppanda_",
        "created_utc": 1749077813,
        "score": 1,
        "parent_id": "t3_1l3jduv",
        "depth": 0
      }
    ],
    "1l3j9f3": [
      {
        "id": "mw1n5o3",
        "body": "Keep the receipts, wait for their answer. Pet deposit should be part of the total security deposit, which is capped at 1mo. rent for corporate landlords according to the new law. If they don't remedy that, I would try contacting your local tenant help org first.",
        "author": "thepatriot74",
        "created_utc": 1749080635,
        "score": 2,
        "parent_id": "t3_1l3j9f3",
        "depth": 0
      }
    ],
    "1l3nsvw": [
      {
        "id": "mw2snuj",
        "body": "This probably isn't worth a lawyer. Most likely you signed an agreement saying they are only responsible for something like $0.60 per pound for damaged or lost property. Check your contract to confirm and start looking for documentation and receipts to prove what was in the truck.",
        "author": "Rich_Cause5589",
        "created_utc": 1749095746,
        "score": 1,
        "parent_id": "t3_1l3nsvw",
        "depth": 0
      }
    ],
    "1l3nsu8": [
      {
        "id": "mw2qpp0",
        "body": "What is your question?",
        "author": "Rich_Cause5589",
        "created_utc": 1749094947,
        "score": 1,
        "parent_id": "t3_1l3nsu8",
        "depth": 0
      }
    ],
    "1l3nsrw": [
      {
        "id": "mw2qwzs",
        "body": "> what are the chances she gets sole legal custody or flips the final say on educational decisions? \n\nGiven the circumstances, she probably has a very good shot.",
        "author": "Rich_Cause5589",
        "created_utc": 1749095029,
        "score": 1,
        "parent_id": "t3_1l3nsrw",
        "depth": 0
      }
    ],
    "1l3nlkw": [
      {
        "id": "mw2bjkv",
        "body": "Sure but you’re going to need someone other than you to testify that the install was insufficient and that any ordinary contractor should have known.",
        "author": "BigRick74",
        "created_utc": 1749089175,
        "score": 1,
        "parent_id": "t3_1l3nlkw",
        "depth": 0
      }
    ],
    "1l3irgc": [
      {
        "id": "mw19nwv",
        "body": "NAL - I would send an email or certified letter to Mavis detailing everything that happened, and request a resolution by Friday before you leave, or within three days of your return. If you hear nothing or they don't comply, fix it yourself and take them to small claims court.  \n\nIf you do go to court, put in the cost of the train, less any expenses you would have had anyway (tolls, gas, etc). You might have to demonstrate why you couldn't drive the car with the cracked windshield, so be prepared for that.\n\nI'd also add in a reasonable amount for the time you spent following up on this, maybe $100 an hour, since they showed bad faith in resolving their mistake. You might only get the cost of the repair or replacement, but you won't get more if you don't ask.",
        "author": "yagot2bekidding",
        "created_utc": 1749076184,
        "score": 1,
        "parent_id": "t3_1l3irgc",
        "depth": 0
      }
    ],
    "1l3ndl9": [
      {
        "id": "mw2hclw",
        "body": "Nothing.  It's titled to him, that's the end all be all.",
        "author": "MavSeven",
        "created_utc": 1749091266,
        "score": 1,
        "parent_id": "t3_1l3ndl9",
        "depth": 0
      }
    ],
    "1l3ijps": [
      {
        "id": "mw238bm",
        "body": "You don't press charges, the District Attorney does. If you feel crimes are being committed go to the police and empower them to investigate this.  Police...  Now",
        "author": "SpecialOpsCynic",
        "created_utc": 1749086269,
        "score": 2,
        "parent_id": "t3_1l3ijps",
        "depth": 0
      }
    ],
    "1l3n726": [
      {
        "id": "mw2jwvl",
        "body": "You need leverage to convince them to give you these things. Haven’t actually described anything they care about or might want from you",
        "author": "Arudin88",
        "created_utc": 1749092232,
        "score": 1,
        "parent_id": "t3_1l3n726",
        "depth": 0
      }
    ],
    "1l3n39p": [
      {
        "id": "mw27jeg",
        "body": "Are they married? If they are no harm, if not, we both know that’s fraud, not sure what validation you need, chances of being caught are low but not zero.",
        "author": "BigRick74",
        "created_utc": 1749087783,
        "score": 6,
        "parent_id": "t3_1l3n39p",
        "depth": 0
      },
      {
        "id": "mw285qv",
        "body": "It's not going to do any harm, but it's not going to do him any good, either.  You have no personal knowledge as to whether he's legally married or not.  You didn't witness a legal wedding.  All you can say is that he told you he's married, which is useless.\n\nHe needs his marriage certificate, not an affidavit from you.",
        "author": "UsuallySunny",
        "created_utc": 1749087999,
        "score": 4,
        "parent_id": "t3_1l3n39p",
        "depth": 0
      }
    ],
    "1l3n1yz": [
      {
        "id": "mw2904d",
        "body": "Non Competes were largely banned in 2024, making them unenforceable. \n\nThe courts currently have an injunction stopping the ban, but I can’t imagine it’s going to stop it permanently. \n\nIn Some states there are laws against non competes. \n\nI would say that they’re in such a state of legal flux that they’re borderline unenforceable",
        "author": "nope-nope-nope-nop",
        "created_utc": 1749088293,
        "score": 1,
        "parent_id": "t3_1l3n1yz",
        "depth": 0
      },
      {
        "id": "mw2ah4a",
        "body": ">What are the repercussions of leaving to work for a competitor if you sign this?\n\nIf you go work for a competitor or even perhaps not a competitor (people screw up when suing people) you get embroiled in a lawsuit and need an expensive attorney to fight it. That's the minimum if sued. Also, in most states you can be court ordered not to work losing your job in the process beyond the attorney's fees, their attorney's fees, and whatever penalties the contract or court imposes.\n\n>This would make it really hard for her to leave if she doesn’t like this job. Is it possible to get around signing this?\n\nThe only way still involves a lawsuit. And that requires the terms be a violation of Massachusetts law. Or negotiate for something else or just call their bluff (you hope) and refuse.\n\n>Noteworthy: competitors weren’t specifically mentioned, but everyone in her industry is a competitor of this company. In other words: this non-compete would basically bar her from working any other jobs she could possibly want.\n\nYes, that's how non-competes work and many states have sought to ban and restrict them. Because of that Massachusetts restricts them to a limit of 12 months, requires partial pay during that time, limited geographic limits (beyond Massachussetts will be looked down as extremely unfair), must be exempt from overtime under the FLSA, bans allowing the laws of other states be used to govern the contract, bans any lawsuit to enforce from not being in Massachusetts courts. \n\nOther states such as California, North Dakota, Minnesota, and Oklahoma have gone farther and near totally ban them outright in the vast majority of situations.\n\n[https://malegislature.gov/Laws/GeneralLaws/PartI/TitleXXI/Chapter149/Section24l](https://malegislature.gov/Laws/GeneralLaws/PartI/TitleXXI/Chapter149/Section24l)\n\nBut what it comes down to, if you sign this, you may be sued even if you don't work for a competitor in your opinion later on.\n\nAnother thing that people overlook is acquisitions. If the business is bought by a multi-market conglomerate many have used the fact they operate in many markets to sue people over supposed violations of non-competes for working for companies that were not competitors when they signed their non-compete. \n\nA very tight definition of competitor is to the employee's benefit. Leaving the phrase competitor vague, or worse undefined, can lead to terrible consequences.",
        "author": "MightyMetricBatman",
        "created_utc": 1749088803,
        "score": 1,
        "parent_id": "t3_1l3n1yz",
        "depth": 0
      },
      {
        "id": "mw2bfdj",
        "body": "This section of the Mass code discusses the rules for non-complete clauses:\nhttps://www.mass.gov/info-details/massachusetts-law-about-noncompetition-agreements\n\nVery abbreviated summary:\n- Can't be longer than 12 months\n- Non-competes can't be applied to most hourly workers and some professions (e.g. nurses)\n- The agreement must be provided to the employee by the earlier of a formal offer of employment or 10 business days before the commencement of the employee's employment.\n- Must offer \"garden leave\" or other reasonable consideration (50%+ compensation during the restricted period after terminating employment, or mutually agreed reasonable consideration)\n\nThere are several factors to this, and a MA employment lawyer reviewing the actual paperwork would be needed to give a definitive answer based on the job, contracts, etc. It can depend on her comp, industry, the timing regarding when she was asked to sign the non-compete, and what compensation they are offering during the non-compete period.",
        "author": "idkgideon",
        "created_utc": 1749089134,
        "score": 1,
        "parent_id": "t3_1l3n1yz",
        "depth": 0
      }
    ],
    "1l3mpet": [
      {
        "id": "mw25jsj",
        "body": "What exactly are you asking? The registered agent is nothing but a person or entity at an address who accepts service on your behalf.",
        "author": "MysticalAphorisms",
        "created_utc": 1749087085,
        "score": 1,
        "parent_id": "t3_1l3mpet",
        "depth": 0
      }
    ],
    "1l3mdy9": [
      {
        "id": "mw2sk6c",
        "body": "Well the issue is that you do not pay the citations or show up to the court date. So in a sense you have a Failure to Appear bench warrant (sounds like they call it different in Texas but same thing in the end). There is no need for the citations to be mailed to you since you had them with you.",
        "author": "West-Association812",
        "created_utc": 1749095703,
        "score": 1,
        "parent_id": "t3_1l3mdy9",
        "depth": 0
      }
    ],
    "1l3m8hy": [
      {
        "id": "mw202d8",
        "body": "what are the negatives of being on a PIP?\n\nDoes your contract guarantee employment for a set period?",
        "author": "EveryPassage",
        "created_utc": 1749085162,
        "score": 2,
        "parent_id": "t3_1l3m8hy",
        "depth": 0
      },
      {
        "id": "mw20tj0",
        "body": "your interpretation makes sense based on the wording. the contract mentions monthly *measurement*, not monthly *requirement*. if there's no clear language tying performance to monthly quotas with consequences, your manager can't just enforce an unwritten rule.\n\nyou should talk to HR or have an employment lawyer review it. contracts are about what's written, not what someone says the “spirit” is.",
        "author": "PeachyFlutterGlow",
        "created_utc": 1749085426,
        "score": 2,
        "parent_id": "t3_1l3m8hy",
        "depth": 0
      }
    ],
    "1l3m7pv": [
      {
        "id": "mw241hv",
        "body": "https://www.nyc.gov/site/nypd/about/faq/knives-faq.page\n\nYou cannot open carry a knife in New York City it seems, regardless of size.\nNew York state does not seem to have any law about this, only a general \"cannot openly carry a knife with the intention of doing something illegal.\"",
        "author": "Sellsword193",
        "created_utc": 1749086554,
        "score": 3,
        "parent_id": "t3_1l3m7pv",
        "depth": 0
      },
      {
        "id": "mw24o8t",
        "body": "It's not what part of the body it's on, it's the type of knife. The following weapons are illegal to possess (presumably you can get a permit, I know you can for guns):\n\n\"any firearm, electronic dart gun, electronic stun gun, switchblade knife, pilum ballistic knife, metal knuckle knife, cane sword, billy, blackjack, bludgeon, plastic knuckles, metal knuckles, chuka stick, sand bag, sandclub, wrist-brace type slingshot or slungshot, shuriken, or throwing star\"\n\nThe following types of knives are legal to carry UNLESS you are carrying it with the intent to use it unlawfully against another:\n\n\"any dagger, dangerous knife, dirk, machete, razor, stiletto, imitation pistol, undetectable knife or any other dangerous or deadly instrument\".\n\nWhile NYC has a limit on knife length, the actual state does not have any hard and fast rule where a knife goes from being legal to illegal based on length alone.\n\nGoogling the knife you mentioned it definitely looks like it'd fall under the second category of permissible weapons, but the phrasing \"with unlawful intent\" is extremely vague and leaves a lot of discretion up to the police, prosecutor, and judge as to whether the scenario in which you were found with the knife qualifies.\n\nNY penal code 265.01 for reference",
        "author": "DrCharlesBartleby",
        "created_utc": 1749086777,
        "score": 3,
        "parent_id": "t3_1l3m7pv",
        "depth": 0
      }
    ],
    "1l3h0yb": [
      {
        "id": "mw28rly",
        "body": "You should be able to do it without a lawyer once you turn 18. Unless you have a serious hardship, the Court won’t release the funds early. Did you have a lawyer help with the settlement? It’s likely that they can assist you.",
        "author": "bearjewlawyer",
        "created_utc": 1749088211,
        "score": 1,
        "parent_id": "t3_1l3h0yb",
        "depth": 0
      }
    ],
    "1l3lu5h": [
      {
        "id": "mw1xe4r",
        "body": "For 50 bucks, I'd quietly file a wage theft complaint to the local labor board and grab my popcorn.",
        "author": "thriftstorehacker",
        "created_utc": 1749084234,
        "score": 1,
        "parent_id": "t3_1l3lu5h",
        "depth": 0
      }
    ],
    "1l3lm5l": [
      {
        "id": "mw1vrww",
        "body": "NAL: \n\nNext time, don't talk to them.\n\nNothing good can come of being dragged in as a witness, being deposed, or anything like that. \n\nJust because you aren't named doesn't mean that you might not get dragged into stuff beyond your control.",
        "author": "NeitherEntry6125",
        "created_utc": 1749083660,
        "score": 2,
        "parent_id": "t3_1l3lm5l",
        "depth": 0
      },
      {
        "id": "mw1y6w6",
        "body": "Definitely don't talk to this guy again, he was asking questions that could easily let him name you as a codefendant depending on what your answers were, even if that wasn't his initial intention and even if you think you did nothing wrong. Ignore any calls or emails, block him if necessary, you don't have to talk to him again unless he subpoenas you, at which point you'll want to consider getting a lawyer going forward. All you can do is open yourself up to potential liability by talking to him again",
        "author": "DrCharlesBartleby",
        "created_utc": 1749084509,
        "score": 1,
        "parent_id": "t3_1l3lm5l",
        "depth": 0
      },
      {
        "id": "mw26fx6",
        "body": "This is quite common and you should not be worried about it. Happens frequently in my practice. Plaintiffs are not allowed to speak with current employees of a corporate defendant so they will hire private investigators or reach out to former employees themselves to try and find out insider information. \n\nThere is little to no chance that you’ll be named a defendant. Without knowing the specifics there is no real upside for the Plaintiff to name you. In most cases if you did anything wrong related to the lawsuit the theory of liability would be vicarious liability, which means your employer is liable for your actions while on the job. You do not need to be named a defendant for Plaintiff to show vicarious liability. On the rare occasion an employee acts outside of the bounds of their employment while on the job the individual can be personally liable. However, if this was the case it would not help Plaintiff. They want the big easy money from the corporate defendants insurance policy. Naming an individual personally liable in addition to the corporate defendant would mean fault would be apportioned between the defendants (ex. 50% to individual 50% to corporate defendant). This would mean that the plaintiff would only get 50% of their total award from the easy insurance money and would have to go after the individual for the other 50%, which usually isn’t realistic based on an individual employees net worth and the extended process Plaintiff would have to go through to be successful getting paid. \n\nYou may get a subpoena for deposition. There are state specific rules on whether you have to show up or not.  You can be forced to appear for deposition if you don’t initially comply or be at risk for contempt of court, but that too is an extended process and unless you’re a pivotal witness the Plaintiff likely won’t want to go through it to force you to appear. They want to do as little work, and get paid the most amount of money, in the shortest time.",
        "author": "Teejmc13",
        "created_utc": 1749087400,
        "score": 1,
        "parent_id": "t3_1l3lm5l",
        "depth": 0
      }
    ],
    "1l3ge8u": [
      {
        "id": "mw0z5zq",
        "body": "Is there a court order for e.g. custody or visitation?  If not, then either parent can make decisions with respect to childcare within the state.  Leaving the state is another matter.\n\nMom is right to be concerned.  If one parent removes the child from Florida without permission of the other, then it could be a rats-nest of trouble.  If Baby Dad is fine with baby leaving Florida, sister would be wise to get permission confirmed in writing.  It doesn't need to be notarized (although that would obviously help).",
        "author": "jps_",
        "created_utc": 1749072914,
        "score": 1,
        "parent_id": "t3_1l3ge8u",
        "depth": 0
      }
    ],
    "1l3ljk7": [
      {
        "id": "mw1u54n",
        "body": "You make things more difficult than necessary.  Go to court clerk and show current registration.  It will be dismissed immediately or at court date.   I am not your atty",
        "author": "Interesting1thing",
        "created_utc": 1749083074,
        "score": 1,
        "parent_id": "t3_1l3ljk7",
        "depth": 0
      }
    ],
    "1l3ljds": [
      {
        "id": "mw1ub1f",
        "body": "This is an insurance question and will be determined by insurance adjusters.",
        "author": "AccordingToBeing",
        "created_utc": 1749083132,
        "score": 1,
        "parent_id": "t3_1l3ljds",
        "depth": 0
      }
    ],
    "1l3l78k": [
      {
        "id": "mw1t273",
        "body": "Have you seen an actual registration in your name? Unless you signed a POA, there is no way he registered this car for you.  If the title isn't in your name,  take tag off, turn it in at the tax collector office and take it off insurance. Done",
        "author": "onepumpchump396",
        "created_utc": 1749082695,
        "score": 1,
        "parent_id": "t3_1l3l78k",
        "depth": 0
      }
    ],
    "1l3faai": [
      {
        "id": "mw2e75h",
        "body": "Maybe you need a new aytyy? Cost will be an issue for new atty to get up to speed",
        "author": "Picklesis44333",
        "created_utc": 1749090108,
        "score": 1,
        "parent_id": "t3_1l3faai",
        "depth": 0
      }
    ],
    "1l3kjff": [
      {
        "id": "mw1lm3y",
        "body": "You should refinance, “buying” him out in whatever way he will accept (that may should be zero).",
        "author": "reddituser1211",
        "created_utc": 1749080112,
        "score": 2,
        "parent_id": "t3_1l3kjff",
        "depth": 0
      },
      {
        "id": "mw1lnu9",
        "body": "You won't be able to remove anyone from the loan without refinancing it. Obviously you won't be able to refinance this vehicle either.",
        "author": "Rich_Cause5589",
        "created_utc": 1749080129,
        "score": 2,
        "parent_id": "t3_1l3kjff",
        "depth": 0
      },
      {
        "id": "mw1m5vn",
        "body": "You refinance it, I'm not sure what those other points matter, you're all equally responsible for the loan, and any of you could pay off the loan. You only need the legal owners to put the new loan on the vehicle",
        "author": "edman007",
        "created_utc": 1749080298,
        "score": 2,
        "parent_id": "t3_1l3kjff",
        "depth": 0
      }
    ],
    "1l3kijc": [
      {
        "id": "mw1nst3",
        "body": "No one here can tell you if it is worth it, it isn't a legal question.\n\nRegardless of right or wrong, without an itemized statement the security deposit deduction should be forfeit.\n\nThough unlikely to get the punitive damages. Which typically requires a clear act of bad faith beyond just not fulfilling the requirements of the California law. Unless the landlord says something to that effect in court, it just won't happen.",
        "author": "MightyMetricBatman",
        "created_utc": 1749080853,
        "score": 1,
        "parent_id": "t3_1l3kijc",
        "depth": 0
      }
    ],
    "1l3kicx": [
      {
        "id": "mw1m5c3",
        "body": "No automatically.\n\nWhy don’t you have an attorney yet?  How long has this been on the calendar?  How many attorneys have you interviewed in that time?",
        "author": "thisisstupid94",
        "created_utc": 1749080293,
        "score": 1,
        "parent_id": "t3_1l3kicx",
        "depth": 0
      },
      {
        "id": "mw1nfqc",
        "body": "You’re not going to get a lawyer “appointed” in nearly all circumstances. Are you at risk of losing parental rights permanently?\n\nHow long have you had to get a lawyer?  The other side is entitled to have their case heard.",
        "author": "reddituser1211",
        "created_utc": 1749080729,
        "score": 1,
        "parent_id": "t3_1l3kicx",
        "depth": 0
      }
    ],
    "1l3ki6o": [
      {
        "id": "mw1nrqy",
        "body": "I would not accept managerial responsibility over any work not in compliance with applicable law. Unless perhaps it was with the understanding that compliance was my first task.",
        "author": "reddituser1211",
        "created_utc": 1749080843,
        "score": 1,
        "parent_id": "t3_1l3ki6o",
        "depth": 0
      }
    ],
    "1l3kdum": [
      {
        "id": "mw1o5bk",
        "body": "If you have a lawyer you should listen to them. \n\nThe hot take is that you could have a warranty claim as to the manufacturer but you have no claim as to the seller. But apparently your lawyer knows something we don’t.",
        "author": "reddituser1211",
        "created_utc": 1749080973,
        "score": 2,
        "parent_id": "t3_1l3kdum",
        "depth": 0
      }
    ],
    "1l3kact": [
      {
        "id": "mw1k2f4",
        "body": "Nothing in the law requires that your insurance “forget” what they know.",
        "author": "reddituser1211",
        "created_utc": 1749079593,
        "score": 2,
        "parent_id": "t3_1l3kact",
        "depth": 0
      }
    ],
    "1l3k9vw": [
      {
        "id": "mw1k3mj",
        "body": "Yes, call the insurance you had at the time.",
        "author": "brittdre16",
        "created_utc": 1749079604,
        "score": 3,
        "parent_id": "t3_1l3k9vw",
        "depth": 0
      },
      {
        "id": "mw1k9oi",
        "body": "Yes. The insurance you had in force at the time of the accident needs to help unless they’ve already paid out policy limits.",
        "author": "reddituser1211",
        "created_utc": 1749079659,
        "score": 3,
        "parent_id": "t3_1l3k9vw",
        "depth": 0
      }
    ],
    "1l3k8tg": [
      {
        "id": "mw1ks88",
        "body": "Yes. Have an attorney present. This is a murder case you’re talking about not a speeding ticket.",
        "author": "brittdre16",
        "created_utc": 1749079831,
        "score": 3,
        "parent_id": "t3_1l3k8tg",
        "depth": 0
      },
      {
        "id": "mw1kerr",
        "body": "You should speak to a criminal defense attorney.",
        "author": "thisisstupid94",
        "created_utc": 1749079706,
        "score": 2,
        "parent_id": "t3_1l3k8tg",
        "depth": 0
      },
      {
        "id": "mw1ks71",
        "body": "Do NOT speak to the police without an attorney present. Period. More people talk themselves into trouble rather than out of trouble.",
        "author": "HazardousIncident",
        "created_utc": 1749079831,
        "score": 2,
        "parent_id": "t3_1l3k8tg",
        "depth": 0
      }
    ],
    "1l3jjvs": [
      {
        "id": "mw1mhz5",
        "body": "Hiding out from service is not a very good strategy and just because you think the statute of limitations has run out it is not that simple  they may be willing to settle your debt for a good deal less than what you owe. I would contact them and see",
        "author": "Parkeredlatham",
        "created_utc": 1749080412,
        "score": 2,
        "parent_id": "t3_1l3jjvs",
        "depth": 0
      }
    ],
    "1l3jg1v": [
      {
        "id": "mw2n8pn",
        "body": "MLS case wouldn't be much to go for, if partial of the house is on slab then it can be noted as a slab foundation home. I sold a home last year with a small basement and it also had crawlspace for another 1000 sq ft of the first floor. Property was listed only with \"basement\" and the buyers would've noticed the crawlspace during inspections if they did. \n\nIf you had a chance to see the crawlspace during inspection but did not go in it, then there isn't much of a case. You had a chance to see the rocks being used to hold up the joists.",
        "author": "cayman-98",
        "created_utc": 1749093526,
        "score": 1,
        "parent_id": "t3_1l3jg1v",
        "depth": 0
      }
    ],
    "1l3dwct": [
      {
        "id": "mw05epy",
        "body": "FEMA say what a flood zone is \n\nhttps://www.fema.gov/flood-maps",
        "author": "too_many_shoes14",
        "created_utc": 1749064328,
        "score": 5,
        "parent_id": "t3_1l3dwct",
        "depth": 0
      },
      {
        "id": "mw05pca",
        "body": "Go to the [FEMA website](https://msc.fema.gov/portal/home), put in your address, look at the map. It will tell you whether your address is in a flood zone and, if so, which one.",
        "author": "The-Voice-Of-Dog",
        "created_utc": 1749064413,
        "score": 4,
        "parent_id": "t3_1l3dwct",
        "depth": 0
      },
      {
        "id": "mw2lhg9",
        "body": "Do you have a mortgage? If so, the lender would have been required to check the flood maps and would have required flood insurance if your home was in a flood zone at that time. \n\nNote that flood maps are reviewed periodically (but only about every 10-20 years). And homes not in flood zones can flood, too. \n\nDid any disclosures with the purchase contract ask about insurance claims or damages to the home during the prior owner's ownership? \n\nDid your realtor ever mention anything about a possible flood zone?",
        "author": "Jacob1207a",
        "created_utc": 1749092834,
        "score": 1,
        "parent_id": "t3_1l3dwct",
        "depth": 0
      }
    ],
    "1l3ix1d": [
      {
        "id": "mw1c81r",
        "body": "You need to enforce the judgment.  Example: https://www.franklincountymunicourt.org/Courts/Small-Claims/Forms/Collect-a-Small-Claims-Judgment/Garnishments/Garnishment-FAQs",
        "author": "shamrock327",
        "created_utc": 1749077028,
        "score": 2,
        "parent_id": "t3_1l3ix1d",
        "depth": 0
      }
    ],
    "1l3ivtd": [
      {
        "id": "mw19cnm",
        "body": "Report them to the state licensing board immediately.",
        "author": "xquigs",
        "created_utc": 1749076082,
        "score": 14,
        "parent_id": "t3_1l3ivtd",
        "depth": 0
      },
      {
        "id": "mw1d361",
        "body": "Report to licensing board, follow up with a demand letter with a specified ‘Pay by’ date, delivered by FedEx signature required so you have proof of delivery.  If no response by defined date, initiate small claims case.",
        "author": "Emergency_Today8583",
        "created_utc": 1749077308,
        "score": 12,
        "parent_id": "t3_1l3ivtd",
        "depth": 0
      },
      {
        "id": "mw192dv",
        "body": "Send a demand for payment. Once they still don’t pay sue them.",
        "author": "Justme3684",
        "created_utc": 1749075990,
        "score": 7,
        "parent_id": "t3_1l3ivtd",
        "depth": 0
      }
    ],
    "1l3isl7": [
      {
        "id": "mw18260",
        "body": "You should have a marriage certificate, issued the day you got married. Contact the county clerk in the county where the marriage occurred.",
        "author": "TeamStark31",
        "created_utc": 1749075662,
        "score": 3,
        "parent_id": "t3_1l3isl7",
        "depth": 0
      }
    ],
    "1l3imfa": [
      {
        "id": "mw160x8",
        "body": "You should at least consult with a criminal defense attorney before walking into court by yourself, pleading guilty, and accepting the full consequences of whatever specific crime you've been charged with.",
        "author": "DiabloConQueso",
        "created_utc": 1749075022,
        "score": 1,
        "parent_id": "t3_1l3imfa",
        "depth": 0
      },
      {
        "id": "mw175ff",
        "body": "You probably don’t want to agree to be convicted of a crime of moral turpitude as this may affect future opportunities in your life. You want to attempt to get a diversion program so that this will eventually get dismissed.  Another possibility is to plea it down to something like disturbing the peace or something like that which is not a crime involving moral turpitude.  Hire an attorney or have a public defender appointed to represent you.",
        "author": "Dazzling-Past6270",
        "created_utc": 1749075376,
        "score": 1,
        "parent_id": "t3_1l3imfa",
        "depth": 0
      }
    ],
    "1l3igmw": [
      {
        "id": "mw15mwc",
        "body": "What you can expect depends entirely on the details of the case and local practice... so you should ask your lawyer and not bother with random Internet advice which cannot help but be way less well informed.",
        "author": "jps_",
        "created_utc": 1749074900,
        "score": 1,
        "parent_id": "t3_1l3igmw",
        "depth": 0
      }
    ],
    "1l3i3al": [
      {
        "id": "mw139d4",
        "body": "You could ask for some money.\n\nYou might want to have something in writing that says they will restore the property to it's original condition when they are done.",
        "author": "Disastrous_Garlic_36",
        "created_utc": 1749074167,
        "score": 1,
        "parent_id": "t3_1l3i3al",
        "depth": 0
      }
    ],
    "1l3c4r9": [
      {
        "id": "mvztl2y",
        "body": "This is not my area of expertise but generally speaking - if you want to successfully sue the seller of this house, you'll need to demonstrate the seller had knowledge of the defects and intentionally concealed the issues or the severity of the issues. You'll also need to establish the issue was there prior to your purchase, which will likely be difficult. Given the seller did disclose a flooding issue, you're not in a good spot here, in my opinion. What kind of inspections did you have completed? A real estate attorney would be able to give you more nuanced advice after reviewing your purchase agreement and all the relevant facts here.",
        "author": "RaptorFanatic37",
        "created_utc": 1749060962,
        "score": 1,
        "parent_id": "t3_1l3c4r9",
        "depth": 0
      }
    ],
    "1l3c0z6": [
      {
        "id": "mw070xm",
        "body": "You’re overthinking this. Nobody is going to care that an almost-18-year-old moved out. Even if she did so without permission, nobody is going to spend time and resources pursuing anything. \n\nIf she’s working full time, she should be offered insurance through her employer. She may need your consent for some routine health care services, but since you’re obviously on board it doesn’t seem like an issue.",
        "author": "dragonpromise",
        "created_utc": 1749064790,
        "score": 2,
        "parent_id": "t3_1l3c0z6",
        "depth": 0
      },
      {
        "id": "mvzxa6p",
        "body": "Is the only reason you’re worried beyond the insurance? Like you said, it’s only 2 months. She’ll be 18 before the process even gets rolling.",
        "author": "yourmomishigh",
        "created_utc": 1749062017,
        "score": 1,
        "parent_id": "t3_1l3c0z6",
        "depth": 0
      },
      {
        "id": "mw11f0n",
        "body": "That's only a couple of hours by car. Most visits would be easy to travel for, and telehealth works across state lines.  \nYou're a good parent, looking out for her while she launches. And at this point, you gotta trust that she'll be okay on her own just a few hours away, especially with other trusted adults nearby.",
        "author": "FloppedTurtle",
        "created_utc": 1749073605,
        "score": 1,
        "parent_id": "t3_1l3c0z6",
        "depth": 0
      }
    ],
    "1l3hna6": [
      {
        "id": "mw13bwl",
        "body": "Sorry, but I couldn't read everything. But the title seems quite significant to me. \nYou absolutely must complain to the bar of your city and more precisely, to the president of the bar. This is very important if there is a matter with one of the lawyers.",
        "author": "Mammoth_Feed_3001",
        "created_utc": 1749074188,
        "score": 1,
        "parent_id": "t3_1l3hna6",
        "depth": 0
      }
    ],
    "1l3hlti": [
      {
        "id": "mw0ydqb",
        "body": ">Is this a professionally acceptable practice — to bring in a second attorney solely for the final hearing, while keeping the primary attorney on the case?\n\nI mean, you can.  It's your money.\n\nBut...\n\n>I believe the closing argument and final delivery are crucial\n\nThey're really not.  Not in front of a judge in particular.  Chances are the judge will have a ruling in mind before taking the bench.  Oral argument is unlikely to change their mind.  Doing a good job on the written papers is *far* more important.\n\nJust talk to your current attorney first if you decide to proceed.  Don't blindside them with this.",
        "author": "UsuallySunny",
        "created_utc": 1749072672,
        "score": 4,
        "parent_id": "t3_1l3hlti",
        "depth": 0
      }
    ],
    "1l3hjxh": [
      {
        "id": "mw0xzck",
        "body": "You could sue him in small claims. Sworn testimony is evidence - if you testify that he made those repair promises and he testifies that he did not, it will depend on who the judge believes.",
        "author": "JellyDenizen",
        "created_utc": 1749072550,
        "score": 2,
        "parent_id": "t3_1l3hjxh",
        "depth": 0
      }
    ],
    "1l3bssd": [
      {
        "id": "mvzltoz",
        "body": "Try contacting local beekeepers or bee rescue groups they might remove the bees cheaper or free. Also, seal any entry points to stop more from coming in. Good luck.",
        "author": "islawittyy",
        "created_utc": 1749058795,
        "score": 12,
        "parent_id": "t3_1l3bssd",
        "depth": 0
      },
      {
        "id": "mvzm6k3",
        "body": "I'd recommend posting in r/beekeeping with pictures. It is very unlikely bees would be in pipes.",
        "author": "Night_Owl_16",
        "created_utc": 1749058895,
        "score": 6,
        "parent_id": "t3_1l3bssd",
        "depth": 0
      },
      {
        "id": "mw0l7tq",
        "body": "I'm confused. Are the landlord? Or are you a tenant? I'm not s lawyer, but I am a landlord. I pay for all pest removal services that might be needed at the home were my tenants rent. \n\nIf you are a landlord, I would highly recommend building up a maintenance fund for the property. More than 50% of the rent paid by the tenants goes into a savings account just for this purpose. We also pay  the property taxes from this fund. I hope you are familiar with the financial obligations of a landlord in your area.",
        "author": "DarwinsPhotographer",
        "created_utc": 1749068859,
        "score": 1,
        "parent_id": "t3_1l3bssd",
        "depth": 0
      },
      {
        "id": "mw2tcmj",
        "body": "I am confused about how they’re coming up from the drain. If they are coming up through your p traps, your only choice is to burn it all down.",
        "author": "Driftlessfshr",
        "created_utc": 1749096038,
        "score": 1,
        "parent_id": "t3_1l3bssd",
        "depth": 0
      }
    ],
    "1l3he7y": [
      {
        "id": "mw0w60n",
        "body": "Was these lease terms in writing and signed? Also does your landlord know she is living with you?",
        "author": "Lt-shorts",
        "created_utc": 1749072001,
        "score": 3,
        "parent_id": "t3_1l3he7y",
        "depth": 0
      }
    ],
    "1l37zch": [
      {
        "id": "mvyqbck",
        "body": "Generally, no. A lawyer would go through proper channels that can be tracked. Such as certified letters. So they can say we let XYZ know about ABC on this date.",
        "author": "Familiar-Kangaroo298",
        "created_utc": 1749049947,
        "score": 12,
        "parent_id": "t3_1l37zch",
        "depth": 0
      },
      {
        "id": "mvyqo8r",
        "body": "Usually not. But if you owe the person. Should probably just pay him back and move on.",
        "author": "Delta9THICC",
        "created_utc": 1749050050,
        "score": 7,
        "parent_id": "t3_1l37zch",
        "depth": 0
      },
      {
        "id": "mvywatw",
        "body": "Do you have any written proof of that date of payment in full? Cause if you do... I would tell them to pound sand and then demand any further communication is done via  e-mail or regular mail (certifed) or phone then give him your email address. If they do contact you via one those methods reply back with any proof you have stating that you will abide by the terms of the first agreement I will cease any further communication with you or them until them or unless you take me to court.\n\nEspecially what you are doing here is telling them the proper way to contact you. (Which come the eff on any lawyer knows that you need a paper trail did he get law degree from acme looniversity or something?) And that you will abide by the first agreement cause there is more than likely nothing about \"terms changing\" there. And if he and his lawyer wants to waste more time and money take you to court in which the Judge is gonna embarrass and hurt their prides over something that should be in small claims court. (If Canada has a thing like that)",
        "author": "KGBStoleMyBike",
        "created_utc": 1749051647,
        "score": 1,
        "parent_id": "t3_1l37zch",
        "depth": 0
      }
    ],
    "1l3gwpo": [
      {
        "id": "mw0urz1",
        "body": "Sounds like you need to talk to an actual lawyer",
        "author": "Ok-Bicycle-4924",
        "created_utc": 1749071584,
        "score": 4,
        "parent_id": "t3_1l3gwpo",
        "depth": 0
      }
    ],
    "1l3gsv2": [
      {
        "id": "mw15ruk",
        "body": "Commuting is generally not considered a work expense so I lean no.",
        "author": "ryanvsrobots",
        "created_utc": 1749074944,
        "score": 3,
        "parent_id": "t3_1l3gsv2",
        "depth": 0
      }
    ],
    "1l3gemy": [
      {
        "id": "mw0pa4r",
        "body": "Termination in this statue refers to the end of employment. In other words, the rules are the same whether you quit or get fired. \n\nSeparately, the requirement for needing to pay 50% salary in order to enforce the noncompete applies only when the employee wasn't salary exempt or didn't earn at least the threshold salary required for noncompetes.",
        "author": "MysticalAphorisms",
        "created_utc": 1749070002,
        "score": 1,
        "parent_id": "t3_1l3gemy",
        "depth": 0
      }
    ],
    "1l3fza0": [
      {
        "id": "mw0k90a",
        "body": "This is legal (and increasingly more common).\n\nIt’s legal because your PTO isn’t being taken away, you’re just not allowed to accrue anymore. You’ll still get paid for it when you use it.",
        "author": "DiabloConQueso",
        "created_utc": 1749068588,
        "score": 3,
        "parent_id": "t3_1l3fza0",
        "depth": 0
      },
      {
        "id": "mw2xnsm",
        "body": "Question: how much time do you have banked? Can you take PTO immediately and for the entirety of banked time until depleted so as to take advantage of new policy?",
        "author": "Freedom_33",
        "created_utc": 1749097937,
        "score": 1,
        "parent_id": "t3_1l3fza0",
        "depth": 0
      }
    ],
    "1l3fxqu": [
      {
        "id": "mw0nzek",
        "body": "You can still file a wage claim or complaint with the DOL even if the business is closed. [https://www.dol.gov/agencies/whd/wow](https://www.dol.gov/agencies/whd/wow) / [https://www.dol.gov/agencies/whd/contact/complaints](https://www.dol.gov/agencies/whd/contact/complaints)\n\nYou can also file in Florida Small Claims Court.",
        "author": "okayfriday",
        "created_utc": 1749069635,
        "score": 2,
        "parent_id": "t3_1l3fxqu",
        "depth": 0
      }
    ],
    "1l3f099": [
      {
        "id": "mw0ee64",
        "body": "Why don't you believe the lease would convert to month-to-month if not renewed? That is usually what happens if the lease is not renewed or ended. What does your lease say, exactly, and have you given notice to your landlord you're ending your tenancy?\n\nIt's likely your roommate would need to sign a whole new lease and not be able to renew without your approval. The deposit is usually returned when all tenants move out. It's hard to say much else without knowing your lease terms. If your roommate agreed to pay now and now refuses, you'd need to take them to small claims court.",
        "author": "RaptorFanatic37",
        "created_utc": 1749066901,
        "score": 1,
        "parent_id": "t3_1l3f099",
        "depth": 0
      }
    ],
    "1l3exgq": [
      {
        "id": "mw0ern7",
        "body": "Contract?  Or offer letter?  Is the bonus guaranteed on a calculation or is it discretionary?\n\n1.  We're going to guess there's no contract here.  If this is a discretionary bonus they probably get away with this.  \n\n2.  See 1.  If there's no obligation for them to fix this, then there's no bounds on what they might offer.  \n\n3.  See 1 and 2.  But importantly, they probably shouldn't *retaliate*, but changing their opinion of her and her career path probably get by.  She should manage this interaction carefully.",
        "author": "reddituser1211",
        "created_utc": 1749067009,
        "score": 1,
        "parent_id": "t3_1l3exgq",
        "depth": 0
      }
    ],
    "1l3ewne": [
      {
        "id": "mw0chti",
        "body": "Your dad needs to call some real estate attorneys about forcing a partition sale. There's a number of ways it can be worked out, but it's going to require a local real estate attorney looking at the deed and running through options with your dad.",
        "author": "The-Voice-Of-Dog",
        "created_utc": 1749066357,
        "score": 3,
        "parent_id": "t3_1l3ewne",
        "depth": 0
      }
    ],
    "1l391kv": [
      {
        "id": "mvz4moa",
        "body": "VA has some decent tenant assistance out there. Check out Legal Services of NoVA or the Pro Bono law center. And small claims isn’t overly complicated. Yes, that’s the route you’d have to take. \n\nThe leak issue is irrelevant. I wouldn’t bring it up as it’s not material to the deposit issue. \n\nI would start by sending a written demand/dispute via certified letter. This coming from an attorney would be far more effective. Look up Virginia Code 55.1-1226 and quote it as necessary. You’re disputing the charges and requesting proof. \n\nThings like the air filter would depend on your lease but a judge would likely find most of the deductions you describe as normal wear and tear. Do you have your move in condition from noting any damages? Did you get anything at move out as far as a walk through? Photos of how you left the place?",
        "author": "atoboxcar",
        "created_utc": 1749054012,
        "score": 2,
        "parent_id": "t3_1l391kv",
        "depth": 0
      },
      {
        "id": "mvzykz3",
        "body": "I assume you have photos/videos of the property when you moved in.\nThese, combined with your photos/videos when you moved out are your basic evidence.\nAnything beyond that the landlord must provide an itemized list of things that need to be fixed (normal wear/tear excluded) along with receipts.\n\nUnfortunately it seems to be a common practice of landlords to use the security deposit as they think and withholding it for arbitrary reasons.\n\nPush the landlord as much as you can and threaten with small claims court. If you have the photo/video evidence, then your case is very strong.",
        "author": "bomberb17",
        "created_utc": 1749062385,
        "score": 2,
        "parent_id": "t3_1l391kv",
        "depth": 0
      }
    ],
    "1l3ekg0": [
      {
        "id": "mw0a13u",
        "body": "No.  Only the owners can sell the property and right now, excuse the bluntness, but one of the owners is dead and can’t agree to any deals. \n\nThey need to open probate so that the owner of the property becomes you and “estate of brother”.  Then they can buy you out.\n\nDid your brother have a will?",
        "author": "thisisstupid94",
        "created_utc": 1749065651,
        "score": 2,
        "parent_id": "t3_1l3ekg0",
        "depth": 0
      },
      {
        "id": "mw0boae",
        "body": "Was this a \"survivorship\" deed?  If so, you now own the house and can do anything you want with it.  If not, your brother's estate needs to be probated.\n\nIf the estate needs to be probated, you can hire an attorney and file.  This will put you in charge of the process and allow you to sell the house out of probate instead of waiting for probate to be complete.",
        "author": "Disastrous_Garlic_36",
        "created_utc": 1749066123,
        "score": 1,
        "parent_id": "t3_1l3ekg0",
        "depth": 0
      }
    ],
    "1l3efl9": [
      {
        "id": "mw087jn",
        "body": "Some items when new out of box, especially ones with plastic components have off gassing. Did you give it a few days out of box, especially outside? It might have cleared up the smell.",
        "author": "PsychoTink",
        "created_utc": 1749065126,
        "score": 5,
        "parent_id": "t3_1l3efl9",
        "depth": 0
      }
    ],
    "1l38l37": [
      {
        "id": "mvyxqmu",
        "body": "Why did you think you would still have two months access after your chargeback? That’s not retaliation.\n\nThey can try to sue you in small claims; you don’t need a lawyer but just be sure to show up if they do. Otherwise do not talk to them.\n\nIf you end up in court, don’t mention that you still wanted two months access; it kind of blows a hole in your chargeback theory.",
        "author": "NoPalpitation7752",
        "created_utc": 1749052054,
        "score": 11,
        "parent_id": "t3_1l38l37",
        "depth": 0
      },
      {
        "id": "mvyy40s",
        "body": "If you file a chargeback and get your money back, it's not \"retaliation\" to delete your account.\n\nAnyways...\n\n>Is this notice a scare tactic? \n\nYes.\n\n>Are they actually going to pursue this in court?\n\nMaybe.  \n\n>And am I in the wrong here?\n\nIf you can show this: \"From the terms and services of the platform there is this: 'As mentioned, customers may initiate chargebacks because of fraudulent transactions, non-delivery of goods, or **dissatisfaction** with product or service quality.'\" Then you might have a decent argument for the chargeback as you were obviously dissatisfied with the product and quality. Did you screenshot that in case they change it?\n\nThere's nothing you can do until a court summons shows up, so I wouldn't worry too much about it til then.\n\nAlso if the service was such garbage, I'm not sure why you're on about the 2 months access. Might be good to let it go.",
        "author": "Rural_Jurist",
        "created_utc": 1749052160,
        "score": 4,
        "parent_id": "t3_1l38l37",
        "depth": 0
      },
      {
        "id": "mvyz54l",
        "body": ">I had no opportunity to review or agree to any terms in writing before making the purchase.\n\nIn the future, don't pay for something if you don't know what you are getting.  Especially when it costs 4 grand.\n\n>After investigating, the card issuer ruled in my favor and refunded the $4,000. In retaliation, the seller revoked my access to the course, even though the purchase included two months of service and I had only used a small portion of that time.\n\nWell you aren't paying them. Why would you continue to get the service?\n\n>Is this notice a scare tactic? Are they actually going to pursue this in court? And am I in the wrong here?\n\nWe can't really answer that.  It certainly sounds like a shady operation, but we don't know their intentions or capabilities.  Maybe they don't follow up, maybe they do.  The terms of service may support you here.  You may want to follow up with the payment provider's customer service.\n\nAre you sure this is a real law firm that sent you the letter?",
        "author": "dlaugh",
        "created_utc": 1749052451,
        "score": 2,
        "parent_id": "t3_1l38l37",
        "depth": 0
      }
    ],
    "1l3edsw": [
      {
        "id": "mw0d51f",
        "body": "To begin with, meth houses frequently need to be torn down.  The chemicals soak into all parts of the house and effective remediation is not always possible.\n\nApart from that, nobody can really force the landlord to do anything.  If you want to try and buy it, go ahead, but please do a little research before you bite off more than you can chew.",
        "author": "Disastrous_Garlic_36",
        "created_utc": 1749066543,
        "score": 1,
        "parent_id": "t3_1l3edsw",
        "depth": 0
      }
    ],
    "1l3e0hz": [
      {
        "id": "mw03zv0",
        "body": "It means that the results of the test are unclear.  This could be due to several different factors, including poor samples, missing samples, mixed-up samples...  in short, it mostly means that the testing needs to be redone.",
        "author": "C1awed",
        "created_utc": 1749063921,
        "score": 3,
        "parent_id": "t3_1l3e0hz",
        "depth": 0
      }
    ],
    "1l3dvf0": [
      {
        "id": "mw02ybm",
        "body": "Do not block. \n\nWhat does your contract state about termination?",
        "author": "shamrock327",
        "created_utc": 1749063622,
        "score": 2,
        "parent_id": "t3_1l3dvf0",
        "depth": 0
      },
      {
        "id": "mw03myk",
        "body": "In California if a contractor is unlicensed they legally don’t have the right to charge for their services, you may want to check New York law on unlicensed contractors",
        "author": "Flipperanon",
        "created_utc": 1749063819,
        "score": 1,
        "parent_id": "t3_1l3dvf0",
        "depth": 0
      }
    ],
    "1l382iu": [
      {
        "id": "mvys5mq",
        "body": "Most estate attorneys in GA will help with this. One of our partners regularly drafts eviction letters for cases like this. Call around to more attorneys in your town or the closest “big city”— you’ll find someone willing to help, it just may take calling quite a few places first.",
        "author": "gardenone",
        "created_utc": 1749050475,
        "score": 5,
        "parent_id": "t3_1l382iu",
        "depth": 0
      },
      {
        "id": "mvyr48c",
        "body": "Have you tried reaching out to lawyers in the closest city? Have you tried the bar referral service?",
        "author": "BizAnalystNotForHire",
        "created_utc": 1749050178,
        "score": 3,
        "parent_id": "t3_1l382iu",
        "depth": 0
      },
      {
        "id": "mvyvz54",
        "body": "Is there a will? Does Rick have a claim to the house? Is the probate court/judge saying \"sell the house\"?\n\nAssuming you *can* evict based on all the facts and circumstances:\n\nI expect there are a number of templates out there for a 60-day notice to quit a tenancy or face eviction in GA. Generally with no lease, the tenancy will be month-to-month.\n\nYou would list the owner as \"the estate of \\[decedent's name\\], signed by \"\\[your name\\] as personal representative\". If the probate case is open, you could include the case number.\n\nYou would need to serve Rick properly according GA rules (best guess is an uninterested individual over age 18 can do it, or you can get a process server or pay the sheriff). You'll want proof of service for the eviction (if it comes to that).\n\nI think it's always a good idea to let the court know any information that may affect the matter.\n\nIf you use a template, likely there's nothing in it that will require you to serve a quit notice twice. The reasons the eviction could possibly go tits up will be improper service, some defect in the eviction complaint/filing, or the tenant has some claim/right to be there that isn't being accounted for.",
        "author": "Rural_Jurist",
        "created_utc": 1749051556,
        "score": 3,
        "parent_id": "t3_1l382iu",
        "depth": 0
      },
      {
        "id": "mvz3dda",
        "body": "I would suggest going to the county court house and see if they have a walk-in clinic (they do in my state) that can help you with this issue.",
        "author": "Maronita2025",
        "created_utc": 1749053657,
        "score": 1,
        "parent_id": "t3_1l382iu",
        "depth": 0
      }
    ],
    "1l3djq8": [
      {
        "id": "mw03vm1",
        "body": "What happened in the accident? If your car is in a tow yard, you need to get it out of there asap!\n\nFor clarity, your insurance cannot pay anything for your car, since the other driver is insured. That $3500 is uninsured motorist property damage coverage, so if the at-fault person has insurance, that won't apply. You should consider if you should actually have collision coverage if your vehicle has that much value. If you had been at-fault or if the other driver was uninsured, then what position would you be in?\n\nYes, you will need to pursue your claim with the other insurance, your insurance cannot do that for you. If you are not injured, no attorney is going to do anything for you. Even if you were injured, attorneys don't often handle your vehicle damages, no money for them. An attorney just takes a portion of your settlement, so there's no 'fees' to pay.\n\nSo contact their insurance, make your property damage and bodily injury claim. Advise them you need a rental car. You will need to wait for them to complete their investigation of the claim before they can do anything.\n\nDo not settle any injury claim until your injuries and treatment have resolved and you have all your medical bills. Get treatment if you need it.",
        "author": "ektap12",
        "created_utc": 1749063887,
        "score": 2,
        "parent_id": "t3_1l3djq8",
        "depth": 0
      }
    ],
    "1l37nw4": [
      {
        "id": "mvynycf",
        "body": "Send landlord a letter or email today that says my work order has been open for 25 days and is unsolved and that I’ll hold you in breach and end the tenancy if not solved within 5 days.\n\nWithholding rent is never a great solution. But isn’t even imaginable for 26 days so it isn’t really in scope.",
        "author": "reddituser1211",
        "created_utc": 1749049274,
        "score": 2,
        "parent_id": "t3_1l37nw4",
        "depth": 0
      }
    ],
    "1l3d0ng": [
      {
        "id": "mw007fe",
        "body": "Yes, he'll probably have to pay alimony.",
        "author": "adl3026",
        "created_utc": 1749062845,
        "score": 1,
        "parent_id": "t3_1l3d0ng",
        "depth": 0
      }
    ],
    "1l3cvp4": [
      {
        "id": "mvzvk3d",
        "body": "Something like this would be covered under worker's comp insurance. It wouldn't be a lawsuit against the company but more of a claim on their insurance. \n\nBut you'll need medical proof and not just potential of something.",
        "author": "monkeyman80",
        "created_utc": 1749061524,
        "score": 4,
        "parent_id": "t3_1l3cvp4",
        "depth": 0
      },
      {
        "id": "mvzvn8h",
        "body": "If your health problems are a result of workplace conditions, then it's going to a a worker's comp issue, rather than something you'd sue the employer for. You can speak with a worker's comp attorney. But if doctors aren't finding a connection between your health issues and this substance, then you might hit a dead end. \n\nYou can also file an OSHA complaint if you aren't being given proper PPE.",
        "author": "MysticalAphorisms",
        "created_utc": 1749061549,
        "score": 3,
        "parent_id": "t3_1l3cvp4",
        "depth": 0
      }
    ],
    "1l3ctf8": [
      {
        "id": "mvzuy95",
        "body": "Your brother can apply for a lost title. This is the best method, but if he refuses to cooperate you can also look into a bonded title:\nhttps://dmv.colorado.gov/bonding-for-title",
        "author": "monkeyman80",
        "created_utc": 1749061352,
        "score": 3,
        "parent_id": "t3_1l3ctf8",
        "depth": 0
      }
    ],
    "1l3ck2v": [
      {
        "id": "mvztfex",
        "body": "This is somewhat common. If they have costs they incur due to lack of notice they may pursue you for it.",
        "author": "monkeyman80",
        "created_utc": 1749060916,
        "score": 1,
        "parent_id": "t3_1l3ck2v",
        "depth": 0
      }
    ],
    "1l3cjhg": [
      {
        "id": "mvzvhmw",
        "body": "Just so we're all clear and can try to get you the best answer:\n\nBased on your post history, you bought a piece of land. You and three other adults are planning on building two manufactured houses on that land. You hope that a bank will grant a mortgage to your lover's husband, who will be living in one of the two houses, so that you can build the two houses. This is being done in an area that, per your other post:\n\n>No zoning restrictions, not in city limits. No building permits done at the county level. Only restrictions on the deed are “no comercial hog farms”.\n\nIs that right?",
        "author": "The-Voice-Of-Dog",
        "created_utc": 1749061505,
        "score": 2,
        "parent_id": "t3_1l3cjhg",
        "depth": 0
      },
      {
        "id": "mw2akjz",
        "body": "The house is built on the land she partially owns? Then there will be some equitable division of the property. It’s not likely she gets nothing if they get divorced. \n\nAlso I’d be curious if any bank is going to mortgage just to your partner. His wife is almost necessarily going to be on the mortgage and possibly the other landowners too.",
        "author": "bearjewlawyer",
        "created_utc": 1749088836,
        "score": 1,
        "parent_id": "t3_1l3cjhg",
        "depth": 0
      }
    ],
    "1l3chim": [
      {
        "id": "mvzvva6",
        "body": "You were physically present, neither party had an expectation of privacy since they were arguing in front of people and not locked inside a bathroom or similar. As far as the TX recording law, you should be fine.\n\nWhether there's more to the story or the cousin decides to try to come after you legally even if they don't have a strong case, etc., is a separate question that's hard to answer without knowing all the details.",
        "author": "The-Voice-Of-Dog",
        "created_utc": 1749061612,
        "score": 2,
        "parent_id": "t3_1l3chim",
        "depth": 0
      },
      {
        "id": "mw2avo4",
        "body": "Don’t need any consent if they were doing this out in the open in front of people. No repercussions for posting it online.",
        "author": "bearjewlawyer",
        "created_utc": 1749088943,
        "score": 1,
        "parent_id": "t3_1l3chim",
        "depth": 0
      }
    ],
    "1l3bvsb": [
      {
        "id": "mvznnnz",
        "body": "One of the issues here is that it may not follow \"normal\" laws as you explicitly asked him extend the time, he complied, and now you're going back on that agreement. He may have very well scheduled people to come renovate for July when you were out instead of June when he could have had them come in. He may now have to pay the mortgage on the property for an extra month for no return. So while the law may say he needs to look, a judge may side with him given these circumstances.",
        "author": "juu073",
        "created_utc": 1749059302,
        "score": 6,
        "parent_id": "t3_1l3bvsb",
        "depth": 0
      }
    ],
    "1l3bmyg": [
      {
        "id": "mvzm88y",
        "body": "legally you owe them the money or the phone",
        "author": "IRLperson",
        "created_utc": 1749058908,
        "score": 2,
        "parent_id": "t3_1l3bmyg",
        "depth": 0
      }
    ],
    "1l3b9eo": [
      {
        "id": "mvzh6bd",
        "body": "The printing of the address on your \"legal state issued ID\" is unimportant.  You can be trespassed from a place on your license.  \n\nBut ... if you lived there you probably can't be made to go in 8 days.  And then you're not trespassing, you're unlawfully evicted. \n\nThat whole thing gets messy in a breakup.  Tell your ex how long (within 30 days) you need, get your stuff, and get out in that amount of time.",
        "author": "reddituser1211",
        "created_utc": 1749057520,
        "score": 6,
        "parent_id": "t3_1l3b9eo",
        "depth": 0
      },
      {
        "id": "mvzmc17",
        "body": "TLDR: You are a tenant. You cannot trespass there since legally you have the right to be there. If anyone tries to kick you out without a court order they are doing an illegal eviction.\n\nFull answer:\n\nYou are a legal tenant. A lease is not required to be a tenant. Just living there. Your ex legally is the landlord who is subleasing to you (him doing this may violate his or whoever is officially on the lease, but that isn’t your problem.\n\nAs a tenant no one (not even the legal owner of the apartment) can kick you out without following eviction procedures. At minimum they would need to give you 30 days notice and then if you didn’t leave go to court to get an eviction order. \n\nThey cannot throw your stuff out during that time and even after that point if you left they would have to follow abandoned property procedures for anything left.\n\nKeep all evidence that you lived there, mail, your license, any bills you paid, printed out and in a safe place (not in the apartment).\n\nIf the ex attempts to kick you out you can go to the police and report a self help/illegal eviction. Bring as much evidence as you can to the police. Basically you want to make it clear that you are living there. I don’t think this will be a problem given the amount of stuff you have there, but the clearer and more obvious you make it the more likely the police are to believe you.\n\nSome police will act and warn the landlord of their obligations and/or open a criminal case for illegal eviction, others will say it is a civil matter. In general MA is relatively good about the police acting on things like this and you have very strong evidence that you are a tenant, but they still have significant discretion about what they will do and you really don’t want them to decide it is a civil matter and require you to go to court to enforce your rights.\n\nIf you don’t want to continue to live there sometimes police are willing to do a ‘civil standby’ while you get your stuff. That may be the best/safest option for you, but the police aren’t going to hang around forever so it would be wise for you to be prepared to get all of your stuff out quickly. It is very possible even if the police are willing to do a civil standby that they are only willing to do the standby long enough to get essentials out (medicine, documents etc) and not hang out long enough for movers to get everything out. You would have to talk to the police about it to understand what they are willing to do if anything.\n\nThis page has more info: https://www.masslegalhelp.org/housing-apartments-shelter/eviction/when-eviction-illegal\n\nIf you have the resources to hire one a lawyer can help you navigate this.\n\nNote that this is the legal options… The practical advise is if at all possible you are probably better off getting your stuff out asap because if they illegally throw all your stuff out it will be gone even if you may have some sort of monetary recourse in the long run.",
        "author": "TheLordB",
        "created_utc": 1749058937,
        "score": 2,
        "parent_id": "t3_1l3b9eo",
        "depth": 0
      }
    ],
    "1l3b3hp": [
      {
        "id": "mvzif7r",
        "body": "> just bought a two-bedroom apartment \n\nBought?  Or leased?\n\n>Is it a bad idea to move in without a proper lease? \n\nNot necessarily.  \n\nObviously good contacts are a good idea and valuable in avoiding confusion or misunderstanding.  And in setting clear bounds (like duration of term and about of rent) on the agreement.  But lots of people engage in a month-to-month tenancy at will.  The law protects your rights fairly well as a tenant at will.  \n\nThe big difference is that you leave, on 30 days notice, whenever you or landlord says.",
        "author": "reddituser1211",
        "created_utc": 1749057865,
        "score": 2,
        "parent_id": "t3_1l3b3hp",
        "depth": 0
      }
    ],
    "1l3apxs": [
      {
        "id": "mvzf92w",
        "body": "You’re asking them for the wrong thing. Ask for a prepaid shipping label and take it to FedEx/ups and let them take care of it. Otherwise TN says one year of no contact before it can be considered abandoned. Since this was provided by your previous job for work, you have an obligation to make a good faith effort to return it. Since it’s unopened you should be able to slap a shipping label to the box and drop it off at the relevant shipping point. ",
        "author": "Bmandoh",
        "created_utc": 1749056994,
        "score": 4,
        "parent_id": "t3_1l3apxs",
        "depth": 0
      },
      {
        "id": "mvzfkf5",
        "body": "Got to give them an end date. Send a certified letter with signature required... stating they have until (exact date) 30? 60? days from date on letter to retrieve their belongings or it will be disposed of.\n\n\n\nSending inadequate sized shipping box doesn't count.\n\n\nDo note that each state can have different requirements... you need a lawyer.",
        "author": "AlaskanDruid",
        "created_utc": 1749057080,
        "score": 2,
        "parent_id": "t3_1l3apxs",
        "depth": 0
      }
    ],
    "1l3a6ot": [
      {
        "id": "mvz8kxu",
        "body": "> just fired last Wednesday out of the blue\n\nWhile it might be unfair, it's perfectly legal, provided it's not for illegally-discriminatory reasons.\n\n> There is absolutely no evidence or proof that I took or mishandled that money\n\nThere doesn't need to be in order for them to terminate you.\n\n> I was told I lost all access to my earned PTO\n\nNJ does not require employers pay for accrued PTO.\n\nFile for unemployment.",
        "author": "jester29",
        "created_utc": 1749055142,
        "score": 2,
        "parent_id": "t3_1l3a6ot",
        "depth": 0
      }
    ]
  }
}