{
  "subreddit": "PhysicsStudents",
  "collection_date": "2025-06-05T14:02:15.900528",
  "total_posts": 200,
  "posts": [
    {
      "id": "1l3pn43",
      "title": "Physics question found in Princeton Review's SAT book!",
      "content": "Do you think more of these borderline physics/math questions should be incorporated into the SAT examination? Why or why not?\n\nJune 4, 2025",
      "author": "Choobeen",
      "created_utc": 1749095538,
      "upvotes": 12,
      "upvote_ratio": 1.0,
      "num_comments": 8,
      "flair": "Poll",
      "url": "https://i.redd.it/hyv8j5q1715f1.jpeg",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1l3pn43/physics_question_found_in_princeton_reviews_sat/"
    },
    {
      "id": "1l3sr6g",
      "title": "[A Levels] is it A or C because I chose C but can’t say why either is right or wrong",
      "content": null,
      "author": "Used_Impression7064",
      "created_utc": 1749106976,
      "upvotes": 5,
      "upvote_ratio": 1.0,
      "num_comments": 5,
      "flair": "HW Help",
      "url": "https://i.redd.it/0del5m42525f1.jpeg",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1l3sr6g/a_levels_is_it_a_or_c_because_i_chose_c_but_cant/"
    },
    {
      "id": "1l3ks4b",
      "title": "What skills can you learn to supplement a physics degree?",
      "content": "I'm going into junior year of my degree, realizing that outside of knowing math/physics I don't have many applicable skills to an actual job lol. I also have no projects that'd make me more competitive for internships.\n\nI have interests in astronomy and data science. I potentially want to go to graduate school for astronomy. I know a lot of astronomical data is open source, would it be worthwhile to learn and create my own projects with this? I'm familiar with Python.",
      "author": "Repulsive-Freedom148",
      "created_utc": 1749080725,
      "upvotes": 13,
      "upvote_ratio": 0.85,
      "num_comments": 5,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l3ks4b/what_skills_can_you_learn_to_supplement_a_physics/"
    },
    {
      "id": "1l38436",
      "title": "Is an obsession with Physics unhealthy?",
      "content": "I think that at this point in my life, as I introspect myself, I have become compulsively obsessed with Physics and that maybe leading me down a dangerous path. I had always been deeply passionate about physics and astronomy since I was as little as 12. But the caveat is that I think I never took no for an answer. This happened to me in undergrad when my parents made me pursue engineering, I still did not give up. Now as I stand here, I am about to join an MSc in Physics, but it somehow feels unhealthy because of the number of bridges I have had to burn, to get here. I have literally abused every last drop of resource I had. I have made choices I can not walk back from. I do not know if this is sustainable in the long run simply because I have not imagined a world beyond science.",
      "author": "Acrobatic_Badger_843",
      "created_utc": 1749049991,
      "upvotes": 53,
      "upvote_ratio": 0.8,
      "num_comments": 23,
      "flair": "Rant/Vent",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l38436/is_an_obsession_with_physics_unhealthy/"
    },
    {
      "id": "1l3itiy",
      "title": "Does the college I go to really matter? If it’s not in Top 50 Does it really even change anything between colleges?",
      "content": "(Aspiring Physics Major, Senior in high school) This seems redundant but why do people struggle so hard to go to T50’s and T20’s when it’s honestly all up to the high school you went to? Sure you can TRY your heart out at your public high school where you likely won’t have many good extracurricular activities but to me it all seems up to chance whether you went to a well off school or a bad one. I personally feel I got the short end of the stick with a shitty public high school where counselors don’t bother to give you advice on how to get good extracurricular activities or how important grades are. When I was 15 I learned mostly all of College Algebra, Trig, Pre-calculus, and Calc 1-3 in about a year give or take. I could have “easily” qualified for the USAPho or USMO looking at the public tests online. I feel genuinely stupid for not knowing about it until it was too late by the end of my junior year where I was familiar with undergrad Classical mechanics and E&M. I spent all summer and all of sophomore and junior year studying by my self and not really aware of school. Enough of my moping and self pity, I just want some people to tell me it doesn’t really matter where I go to college and that my talents won’t go to waste. I genuinely love learning and feel stupid for not understanding how selective even high level state universities are. ",
      "author": "futon300k",
      "created_utc": 1749075444,
      "upvotes": 10,
      "upvote_ratio": 0.75,
      "num_comments": 8,
      "flair": "Rant/Vent",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l3itiy/does_the_college_i_go_to_really_matter_if_its_not/"
    },
    {
      "id": "1l3drg0",
      "title": "Help with note taking at the PhD level.",
      "content": "I am going to be starting a PhD (USA) soon, and I want to start taking good notes for both my classes and research (something like a journal). \n\n\n\nMy problem: I have no idea how to actually do this. I have never created good notes; I just copy what is on the board and never look back at it. However, if I am to do research, having a good set of notes and references will be very useful (as I found out while writing my undergrad thesis). I have no idea how to select what to include and what to exclude in notes, and whenever I try, they end up being word for word, the textbook plus-minus some calculation details and personal interpretations of statements. \n\n  \nHow can I learn to take good notes that will help me throughout my PhD.",
      "author": "Fury_pants",
      "created_utc": 1749063197,
      "upvotes": 6,
      "upvote_ratio": 1.0,
      "num_comments": 6,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l3drg0/help_with_note_taking_at_the_phd_level/"
    },
    {
      "id": "1l31s35",
      "title": "Everything is SO interesting. How do I pick what I want to do?",
      "content": "I finished my sophomore year in college. I just started upper physics courses and there are so many electives, I want to take them all. \n\nMy questions:\n\n1) Were you able to get a job right after college, and did that job fulfil your desires? What type of job? Are you happy?\n\n2) Are you happy with your masters degree/do you think you would be fine in your job even if you didn't do it?\n\n3) How old were you/what level of education were you in when you decided what you wanted to do?",
      "author": "indigogelato",
      "created_utc": 1749031691,
      "upvotes": 21,
      "upvote_ratio": 0.93,
      "num_comments": 8,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l31s35/everything_is_so_interesting_how_do_i_pick_what_i/"
    },
    {
      "id": "1l35r49",
      "title": "How to get involved in a research?",
      "content": "I'm an undergrad and gonna be a sophomore in the Fall. Now taking calc 1 as a summer class. And plan to take University Physics 1 in the fall. Since I spent a year doing pre-calc, I had zero opportunity to take part in any research. Yes, I was just not eligible.\nBut I strongly want to do research in the future. How will you all find these opportunities? Is it possible to get involved in research during the normal academic term? Thanks for your help. ",
      "author": "a_bunch_of_syllabi",
      "created_utc": 1749044188,
      "upvotes": 5,
      "upvote_ratio": 0.86,
      "num_comments": 7,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l35r49/how_to_get_involved_in_a_research/"
    },
    {
      "id": "1l303xe",
      "title": "Please help me in determining where to start self learning undergrad level physics.",
      "content": "For some background, I've completed my school and have a good hold over all the prerequisites like high school level calc and physics and I want to continue and start learning undergrad level physics even if its as a hobby, before college I have a whole lot of time so I want to dedicate some of it to physics.\n\nSo please help me in deciding how to start learning further physics and what courses, video lecture and text books could be helpful.\n\nMy interest align more towards astrophysics and quantum physics, so extra resources for them would be appreciated too.",
      "author": "PreferenceKey5973",
      "created_utc": 1749024913,
      "upvotes": 12,
      "upvote_ratio": 1.0,
      "num_comments": 17,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l303xe/please_help_me_in_determining_where_to_start_self/"
    },
    {
      "id": "1l2lf7r",
      "title": "I am an undergraduate physics student in need of advice for after college!",
      "content": "Hi everyone! I am an undergraduate astrophysics major in my second year of Physics work, but was looking for some advice. I have a super solid GPA right now, but I am worried about graduate / PhD programs. I am not sure what to apply for or what I need in terms of GPA to apply and get into certain programs.\n\nI want to do a PhD either in the United States or abroad and am already doing research, but am also interested in possibly going into finance as a backup option, as funding in the US is decreasing right now and I love Astrophysics but really want some certainty in my life, rather than not knowing what my future holds while doing a PhD.\n\nI am interested in possibly doing a quantitative finance master's, or any other master's that would set me up to work a large variety of jobs in finance and give me flexibility in places to work. I still want to study Astrophysics because I love it and would be interested in applying for a PhD in it as well, but I just feel so confused and lost.\n\nDoes anyone have any advice on what GPA I need for the respective programs, as well as different graduate school programs I can attend to set myself up for jobs in Physics, Astrophysics, finance, data science, or other adjacent fields? Also, if anyone in the field has more information on possible job opportunities either out of undergrad or out of grad school for astrophysics majors, I'd love to hear it, because when I do research, I mainly just get the basic copy-paste answer, which isn't super helpful.\n\nThanks!!",
      "author": "Cautious_Way4593",
      "created_utc": 1748980139,
      "upvotes": 14,
      "upvote_ratio": 1.0,
      "num_comments": 5,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l2lf7r/i_am_an_undergraduate_physics_student_in_need_of/"
    },
    {
      "id": "1l2h8cb",
      "title": "[General Relativity] How do I make \"K\" appear in the Klein-Gordon equation?",
      "content": "I have written the Klein-Gordon equation separating the solution into two terms ψ_u and ψ_v. It can be shown that ψ_v is negligible. \n\nMy textbook goes on to show that if we set ψ_v = 0, we get this expression for ψ_u where K appears, but I can't for the life of me figure out how. Any suggestion is appreciated! Thank you! ",
      "author": "elenaditgoia",
      "created_utc": 1748970063,
      "upvotes": 16,
      "upvote_ratio": 0.94,
      "num_comments": 1,
      "flair": "HW Help",
      "url": "https://i.redd.it/ayhs0txxtq4f1.jpeg",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1l2h8cb/general_relativity_how_do_i_make_k_appear_in_the/"
    },
    {
      "id": "1l23syz",
      "title": "Wannabe Physicist Teen: Where do I even start??",
      "content": "Hi everyone, I’m a rising high school senior and ever since I began dreaming of adulthood I’ve wanted to work in applied physics (from astrophysics to electrical work). In college I hope to major in computational physics or some sort of engineering, but that’s in the future.\n\nI wanna take on physics. From an absolute amateur to physics Olympiad qualifier/researcher (Ik it’s not possible atp but play along lol)\n\nI wanted to ask where do I start? I’ve never taken a physics class, know NONE of the basics, and the amount of physics materials and resources is simply so overwhelming to the point I don’t know how or where to begin.\n\nSince this subreddit is filled with physics enthusiast and lowkey Albert Einsteins, in what order should I self-learn physics? What online/free resources do y’all recommend? Is there a textbook you swear your life on? And what projects can I do no matter the difficulty; like building a jet propulsion thingy or plasma cannon (idk sorry😣)?\n\nAny advice truly helps and I’ll be taking DE physics next year but wanted to get a SUPER head start, thanks!!",
      "author": "Objective-Judge-6292",
      "created_utc": 1748928038,
      "upvotes": 31,
      "upvote_ratio": 0.9,
      "num_comments": 31,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l23syz/wannabe_physicist_teen_where_do_i_even_start/"
    },
    {
      "id": "1l1ryh9",
      "title": "Very proud of how my final work for undergrad is looking like :)",
      "content": "I'm writing this just for myself, because it's a very niche thing and maybe nobody cares, but I'm writing the final work of my Bachelor's degree, and I'm really proud of how it's turning out!\n\nMy main focus is cosmology. I'm in the laboratory of relativity, gravitation and high energies, but I'm basically the only one working with cosmology; my advisor kinda works with it, but not very deeply. At the suggestion of a lecturer I took some classes with, I decided to write about inflation. It's fairly advanced for undergraduate (lots of GR and quantum field theory), but I really liked the topic and was set on it.\n\nI'm around 80% done with it and I'm honestly so satisfied. I'm doing a huge survey of existing literature, running my own lattice simulations and comparing existing models to the latest observed evidence. It's not new science or anything mind-blowing, but I can say that my work is shaping up to be a damn good review/meta-analysis, with some of my very own observations on the simulations!\n\nI want to publish it open access after presenting, both in Portuguese (native language) and in English. There's so little on this topic, and on cosmology and gravitation in general, written in Portuguese, and I really want this to be a good resource for other students. It's almost done, wish me luck, I guess",
      "author": "Leticia_the_bookworm",
      "created_utc": 1748894271,
      "upvotes": 107,
      "upvote_ratio": 0.97,
      "num_comments": 16,
      "flair": "Off Topic",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l1ryh9/very_proud_of_how_my_final_work_for_undergrad_is/"
    },
    {
      "id": "1l1zj2z",
      "title": "AMAZING Advisor, Uninteresting Field",
      "content": "Hey, I am currently a rising sophomore in undergrad. I am currently researching in plasma physics under an advisor who is borderline a mathematician, and I am learning A LOT from them. My projects currently involve a lot of computing and mathematics, and I'm so incredibly grateful that I get to learn so much. They also know me really well as a student and researcher. \n\nHowever, I know I don't want to do my graduate school in plasma. I want to pursue theoretical research on gravitational waves. I know the math I'm learning currently will be immensely beneficial for relativity. I also know the attention I'm getting here is rare, and I won't find it anywhere else. But I'm worried about applying for grad school and how I won't have a lot of experience in relativity. ",
      "author": "EquivalentPair7461",
      "created_utc": 1748914141,
      "upvotes": 22,
      "upvote_ratio": 0.92,
      "num_comments": 10,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l1zj2z/amazing_advisor_uninteresting_field/"
    },
    {
      "id": "1l1sjra",
      "title": "Condensed Matter Physics or HEP?",
      "content": "Hi, I recently finished my undergraduate studies in physics and I am applying for a master's degree. \n\nI did my undergraduate thesis in particle physics phenomenology, but right now I am considering shifting my research interests towards condensed matter physics because I might find more opportunities in that field.\n\nI am hesitant to find more PhD opportunities and job opportunities in condensed matter physics instead of HEP.\n\nI really like fundamental physics and so sometimes I am also hesitant to change my research interests, although there are also condensed matter topics that catch my attention.\n\nMy goal is to dedicate myself to research and academia, and often the number of citations your papers receive is very important. I've noticed that the trend is for HEP articles to be cited more frequently, as they tend to be on topics that are somewhat more in vogue.\n\nAs you can see, I have several concerns. Could someone please advise me or tell me about your experience? Thanks",
      "author": "Silent_Horse_6603",
      "created_utc": 1748895652,
      "upvotes": 24,
      "upvote_ratio": 0.93,
      "num_comments": 14,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l1sjra/condensed_matter_physics_or_hep/"
    },
    {
      "id": "1l1dj10",
      "title": "Physics undergraduate needs advice for graduate school",
      "content": "\n\nMy first 3 semesters I made some poor decisions which led to a low GPA. My last semester I really picked myself up and realized that if I actually tried and worked hard I could've had a really high GPA (crazy realization I know). With my 4 remaining semesters the best I can get is ~3.41 which will probably end up in the 3.2-3.3 range. Currently I am the only pupil to my research advisor receving great research experience and I won an award from my school so I can continue to pursue the research topic. My research is with collaborators at an ivy league university where I am getting to know one of the faculty and I would love to go to for grad school. Basically what I am asking is am I cooked because of my GPA? Im going to work my ass off from now on to try and make it as high as possible as well as take the GRE in hopes of patching it up. ",
      "author": "ComicFurball",
      "created_utc": 1748856211,
      "upvotes": 16,
      "upvote_ratio": 0.94,
      "num_comments": 7,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l1dj10/physics_undergraduate_needs_advice_for_graduate/"
    },
    {
      "id": "1l17ryq",
      "title": "Physics teacher with no lectures",
      "content": "I have an online Calculus based Physics professor who provides no lectures and honestly bad Hw (he doesn't even go over the problems after or give submission comments) the only thing I get is the Openstax book which I'll admit I'm bad at comphending it. \n\nIs there anywhere with modern simple lectures (I've been to Mitcourseware and it's a little bit all over the place)? Also any book recommendations?\n\nEdit: not a rant about my professor  actually looking for lecture couse Playlist/ or websites with free lectures.",
      "author": "manbrains",
      "created_utc": 1748834433,
      "upvotes": 19,
      "upvote_ratio": 0.85,
      "num_comments": 18,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l17ryq/physics_teacher_with_no_lectures/"
    },
    {
      "id": "1l1cee8",
      "title": "What are your recommended laptops?",
      "content": "I’m in search of a laptop for this upcoming school year. What are your recommendations for physics students?\n\nI know I’ll need at least an i7 processor, 16 GB ram, and windows 11.\n\nI’m struggling with costs and trying to find the cheapest option that will work for me.\n\nThank you!\n\nEDIT: Thank you to everyone that replied! I found one :)",
      "author": "trashi_rat",
      "created_utc": 1748851561,
      "upvotes": 7,
      "upvote_ratio": 0.77,
      "num_comments": 9,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l1cee8/what_are_your_recommended_laptops/"
    },
    {
      "id": "1l0xymt",
      "title": "astrophysics focus but want to find a reason to go visit CERN",
      "content": "The title pretty much says it all, i want to see the LHC at CERN but don't really have any good reason why.",
      "author": "itiswensday",
      "created_utc": 1748807113,
      "upvotes": 33,
      "upvote_ratio": 0.94,
      "num_comments": 18,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l0xymt/astrophysics_focus_but_want_to_find_a_reason_to/"
    },
    {
      "id": "1l0xjfr",
      "title": "If I were to get a PhD in \"Applied Physics\", would I still be able to make contributions in the theoretical space?",
      "content": "Extra info: My university doesn’t offer a conventional theoretical program. I have a couple years remaining before making a significant decision, so I am not in a hurry. Just attempting to plan things out. ",
      "author": "SpecialRelativityy",
      "created_utc": 1748806045,
      "upvotes": 20,
      "upvote_ratio": 0.95,
      "num_comments": 3,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l0xjfr/if_i_were_to_get_a_phd_in_applied_physics_would_i/"
    },
    {
      "id": "1l0tjs7",
      "title": "Question to Physics/ Engineering Majors",
      "content": "Looking back, is there a project you wish you had researched and built earlier. Maybe something you only discovered in college, but could have realistically started in high school if you'd known about it?\n\nI’m a high school student really interested in physics and engineering, and I’d love to hear about any hands-on ideas, experiments, or builds.\n\nWhat do you wish you had built, researched about or explored earlier?",
      "author": "Disastrous_Ad6452",
      "created_utc": 1748796287,
      "upvotes": 8,
      "upvote_ratio": 0.84,
      "num_comments": 10,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l0tjs7/question_to_physics_engineering_majors/"
    },
    {
      "id": "1l0bpc7",
      "title": "Can physics majors still get jobs outside of physics?",
      "content": "as I get farther into my degree, I’m becoming more interested in data analysis. my plan A is still physics research, but with grad school looking bleak and data analysis looking more fun, I was wondering if the job market with a physics degree is actually as advertised? lots of schools tell you you can go into engineering, data science, and many other careers with a physics degree, but is that actually the case nowadays or do employers want you to specialize in those subjects at some point in your education?",
      "author": "hhron224",
      "created_utc": 1748737103,
      "upvotes": 77,
      "upvote_ratio": 0.96,
      "num_comments": 32,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l0bpc7/can_physics_majors_still_get_jobs_outside_of/"
    },
    {
      "id": "1l017qm",
      "title": "Proof Left As An Exercise For The Reader No More",
      "content": "Hey everyone,\n\nI graduated with a degree in Physics from Berkeley in 2021. Honestly, loved it, but the biggest frustration I had was how often derivations skipped steps that were supposedly “obvious” or left as an “exercise for the reader.” I spent endless hours trying to bridge those gaps — flipping through textbooks, Googling, asking friends, just to understand a single line of logic.\n\nEvery year, thousands of physics students go through this same struggle, but the solutions we find never really get passed on. I want to change that — but I need your help.\n\nI’ve built a free platform called [**derive.how**](https://derive.how). It’s a place where we can collaboratively build step-by-step derivations, leave comments, upvote clearer explanations, and even create alternate versions that make more sense. Kind of like a mix between Wikipedia and Stack Overflow, but focused entirely on physics/math derivations.\n\nIf this problem feels relatable to you, I’d really appreciate your feedback. Add a derivation you know well, comment on one, suggest features, or just mess around and tell me what’s missing. The goal is to build something that actually helps students learn, together.\n\nThanks for reading, and truly, any feedback means a lot.\n\n**TLDR: New Tool For walking Through Derivations**\n\n**EDIT 1:** I want to clarify that the point is not to avoid doing the derivations yourself. The point is to be able to discuss if something is confusing about a particular step. Or, for example, if you are not onboard with the assumption that the textbook provides for some step.\n\n**EDIT 2:** Creating a causal discord to discuss suggestions and improvements. [https://discord.gg/azcC8WSs](https://discord.gg/azcC8WSs) Let me know if you want to be formally involved as well.",
      "author": "productsmadebyme",
      "created_utc": 1748708981,
      "upvotes": 206,
      "upvote_ratio": 0.96,
      "num_comments": 34,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l017qm/proof_left_as_an_exercise_for_the_reader_no_more/"
    },
    {
      "id": "1l0gvzp",
      "title": "How to reduce noise and make audio clear in an old YT lecture series.",
      "content": "The particular playlist I'm referring to is the QFT lecture series by Padmanabhan. The bad video quality I can manage, because he's dictating everything. But the audio is also atrocious. Especially the first 4 lectures.\n\nSince this is the age of Al, there should be some solution. I tried some online tools but they are just for few minutes (free version).\n\nIs there is any open source resource that I can use?",
      "author": "Dasumit",
      "created_utc": 1748754320,
      "upvotes": 5,
      "upvote_ratio": 0.86,
      "num_comments": 1,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l0gvzp/how_to_reduce_noise_and_make_audio_clear_in_an/"
    },
    {
      "id": "1l0220u",
      "title": "Laptop Recommendations For Undergrads",
      "content": "hey! so i just got admitted to a university in physics, what laptop i should get for the undergrads level? thank you in advance!",
      "author": "Charming_Can_4817",
      "created_utc": 1748711125,
      "upvotes": 11,
      "upvote_ratio": 0.87,
      "num_comments": 18,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1l0220u/laptop_recommendations_for_undergrads/"
    },
    {
      "id": "1kztmlv",
      "title": "How much Topology and QFT do you need to learn for Condensed Matter?",
      "content": "Hi! I would like to know how much QFT and Topology will I need to learn to be up to date about recent developments on Condensed Matter. The answers will help me choose my electives in the future when I go into masters. Thanks in advance!",
      "author": "QuantumPhyZ",
      "created_utc": 1748686125,
      "upvotes": 29,
      "upvote_ratio": 0.95,
      "num_comments": 11,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kztmlv/how_much_topology_and_qft_do_you_need_to_learn/"
    },
    {
      "id": "1kzu965",
      "title": "Physics 1 Textbook to For Placement?",
      "content": "Hey guys, I'm a math major who needs to take two courses in physics; however, I want to try my shot at credit by exam for the first course. The contents of the exam are listed in the photo, and I wanted to seek out y'all's best recommendation for any textbooks that would be great for self-study regarding these topics.",
      "author": "Sh0yo_891",
      "created_utc": 1748688660,
      "upvotes": 6,
      "upvote_ratio": 0.81,
      "num_comments": 4,
      "flair": "Need Advice",
      "url": "https://i.redd.it/rglyqp7kk34f1.png",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1kzu965/physics_1_textbook_to_for_placement/"
    },
    {
      "id": "1kz2l39",
      "title": "(Rant from a TA)Math is not physics.",
      "content": "Physics is mathematics is ... correct duh. But I think there is an over correction these days. So many students are so focussed on the math they forget they are studying physics. Physics is mathematics is a catch phrase to weed out crackpot theorists, but if you are genuinely studying physics... we are not a sub division of the applied mathematic department. There is indeed things that are not calculus that is very vital.\n\nPhysical meaning is a very real thing that is going to haunt you as long as you are on this path. Interpreting the equations is indeed a real thing. The top paragraph of how the equation starts and why is far more important than how to solve the equation. And what that formula implies which is usually written after the end of the equations is also a very vital part of your textbooks. The answer of something being \"it's just math\" means you don't understand the math enough.(or frankly speaking I can't be bothered to explain all of this now. Which is also valid, never work for free) The spherical cow as much as it is a meme is also hinting to you on how to first deal with very complex things. Weeding out the nonsensical answers of the differential equations is not as easy as it looks. It is a genuine skill of its own to see a certain function not being physically possible if so.\n\nThis is not a trivial part by any means, because if you are ever going to apply physics you will not start at the equation part. You will be given a very random looking thing and have to get that in a mathematical form. Frankly speaking once this is done usually analytically solving by hand is not your worries. You will use a computer to get the end result and compare it. Indeed as your textbooks all suggest the able to analytically solve it is vital to this process, but tbh very few cases can be solved analytically by hand it is just the ability to do that transfers very nicely to the reading the output.\n\nAfter that you will see some part of the graph not matching up. In your lab reports yes you can just say error and forget it, but if you are in experimental physics looking at the error patterns interpret and fiddling the equipment to reduce the error will be 90% of your work. If you are in theoretical physics, looking at a random ass results and trying to find a pattern or where the assumptions is wrong is absolutely your job.(btw this is an area where indeed ai is very useful. Ai is a really powerful tool. Never worship or take it at face value, but don't demonize it either) \n\nThis process tbf is not the hardest nor the most time consuming part of your studies. But I would say this is deff the most important part of your education and the most used part of your studies. Math is still a very important part of your studies. (And tbh grade wise it might be more important)\n\nPS) when doing presentations of papers or research do not spend too much time on the math on how the equation evolved. My recommendation is no more than two slides for BS. Frankly speaking I doubt any of you(and even professors tbh) can deliver the math in 5~15mins. Focus on the outcome that is the juicy part everyone is curious about. (Showing and explaining graphs does not count as explaining math in this context) If they are curious on a specific part, tell them that part.(ofc \"you\" should understand it). You are not the only person who has to spend a considerable amount of effort to not phase off when the math gets too long. I kid you not your peers will understand more the more you ditch the math.\n\nPs) I deny all allegations of me being a lab ta losing their mind on how some students can't link their studies to the experiments.\n\nPs) sidenote I might as well rant this as well. If the professor reads or follows through the textbook, that is a really important and helpful part. Don't think you should do this at home. (You won't) Don't think you can understand that later since you have it in your hands.(you might...but that is almost always the harder route) I dunno about your countries education welfare, but I am damm sure whoever is paying(you, guardian, charity or taxpayer) for your education is spending quite a lot of money on this lecture. ",
      "author": "Familiar_Break_9658",
      "created_utc": 1748606956,
      "upvotes": 171,
      "upvote_ratio": 0.91,
      "num_comments": 31,
      "flair": "Rant/Vent",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kz2l39/rant_from_a_tamath_is_not_physics/"
    },
    {
      "id": "1kzcahn",
      "title": "certified courses on advanced undergraduate topics?",
      "content": "Hi, anyone knows about a university/institute that offer certified courses on advanced undergraduate topics like Classical Mechanics II, Quantum Mechanics, E&M and Statistical Mechanics? Free or paid.\n\nI appreciate your help.",
      "author": "Hopeful_Sweet_3359",
      "created_utc": 1748631274,
      "upvotes": 11,
      "upvote_ratio": 0.92,
      "num_comments": 4,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kzcahn/certified_courses_on_advanced_undergraduate_topics/"
    },
    {
      "id": "1kz2tvr",
      "title": "Is it a problem if I find QM not interessting if I want to specilise in condensed matter physics?",
      "content": "I am an undergrad in europe and in this semester we almost went through all of sakurais modern quantum mechanic and I  think I lost interesst in quantum mechanics. Now I am wondering if this will become an issue later on when i learn Condensed matter Physics. I hope it is clear whst I am trying to say ",
      "author": "OkPlan4965",
      "created_utc": 1748607714,
      "upvotes": 26,
      "upvote_ratio": 0.86,
      "num_comments": 21,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kz2tvr/is_it_a_problem_if_i_find_qm_not_interessting_if/"
    },
    {
      "id": "1kyg74g",
      "title": "What electives classes should I take",
      "content": "hey guys I have asked something like this before but I would like more info could you guys take look at these courses and give me advice on what classes to take I am interested in photonics, and particle physics I am willing to do quantum computing to but I really wanna get a phd and work at a national lab.",
      "author": "Umbralkin",
      "created_utc": 1748538423,
      "upvotes": 112,
      "upvote_ratio": 0.98,
      "num_comments": 50,
      "flair": "Need Advice",
      "url": "https://i.redd.it/ej2irc726r3f1.png",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1kyg74g/what_electives_classes_should_i_take/"
    },
    {
      "id": "1kyh5g1",
      "title": "This entire field is an ethical minefield.",
      "content": "I decided on physics because it's fun, satisfying and I think it can be useful for humanity overall. Of course, some physics students move onto military work (many do, it's good money, no judgement here.) I've tried to be careful in what I decide to do, but recently if feels like I stepped onto a trap. \n\nI'll be working in planetary science, with the primary goal of finding life eventually, lots of science to be done before that, but that's the goal in my group. I don't know why it took so long to occur to me what happens once we actually do find life. Even if we find life on Mars, there's no way that it'll prevent it's colonization at some point. I've been reading as much as I possibly can on planetary protection policy, and I'm thankful we're realistically far away from a manned mission to Mars, but now I feel this incredible urge to do everything I can to protect the life we may find, single or multi-celled. After doing some additional research on other planetary scientist's views on it, Sagan (my hero) commented : \n\n\"The surface area of Mars is exactly as large as the land area of the Earth. A thorough reconnaissance will clearly occupy us for centuries. But there will be a time when Mars is all explored; a time after robot aircraft have mapped it from aloft, a time after rovers have combed the surface, a time after samples have been returned safely to Earth, a time after human beings have walked the sands of Mars. What then? What shall we do with Mars?\n\nThere are so many examples of human misuse of the Earth that even phrasing this question chills me. If there is life on Mars, I believe we should do nothing with Mars. Mars then belongs to the Martians, even if the Martians are only microbes. The existence of an independent biology on a nearby planet is a treasure beyond assessing, and the preservation of that life must, I think, supersede any other possible use of Mars.\"\n\nI don't feel entirely hopeless, there's still a lot to be done, but It feels like I'm up against entire governments here. Anyways, rant over. ",
      "author": "Keithic",
      "created_utc": 1748540679,
      "upvotes": 73,
      "upvote_ratio": 0.8,
      "num_comments": 67,
      "flair": "Rant/Vent",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kyh5g1/this_entire_field_is_an_ethical_minefield/"
    },
    {
      "id": "1kyba4h",
      "title": "Griffiths- Introduction to QM (too hard?)",
      "content": "I recently finished my BSc majoring in physics. I have started with this book but i feel overwhelmed. I have only finished 2nd chapter, \"Time-Independent Schrödinger Equation\" , but i cant seem to get hold of all the concepts. I am barely able to solve 30% of the questions he provides, and constantly need to look at solutions module for help. \n\n  \nEven when i go back to re-solve some questions, i realize i have gotten only a little better. (i dont rote learn the answers) \n\n  \nIs this normal? Should i just push through? or should i switch to another book? \n\nThankyou for your thoughts. ",
      "author": "Melodic-Era1790",
      "created_utc": 1748526568,
      "upvotes": 41,
      "upvote_ratio": 0.98,
      "num_comments": 38,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kyba4h/griffiths_introduction_to_qm_too_hard/"
    },
    {
      "id": "1kye12q",
      "title": "C+ In QM II, did I just screw over my grad school chances?",
      "content": "Title, basically. Got a C+ in Quantum Mechanics II, its the only C on my entire transcript and all of my other upper level physics grades are As. I have some research experience but no publications or presentations. I know Cs in upper level physics are especially damaging, and I've been distraught since grades came in, am I screwed?",
      "author": "Adoge2",
      "created_utc": 1748533276,
      "upvotes": 12,
      "upvote_ratio": 0.88,
      "num_comments": 5,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kye12q/c_in_qm_ii_did_i_just_screw_over_my_grad_school/"
    },
    {
      "id": "1ky64is",
      "title": "NEED ADVICE ON WHICH PROGRAMING LANGUAGE I SHOULD LEARN",
      "content": "I will be starting my ug physics journey soon. It would be helpful if you can give me some advice on what programing language/languages I should learn.",
      "author": "More-Pomegranate4337",
      "created_utc": 1748509635,
      "upvotes": 34,
      "upvote_ratio": 0.93,
      "num_comments": 33,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1ky64is/need_advice_on_which_programing_language_i_should/"
    },
    {
      "id": "1kxwton",
      "title": "Can I compensate low gpa (3.1 with 3-4 D's) with research?",
      "content": "I'll get straight to the point. For several reasons my gpa is lower than a typical PhD candidate and I got some D's. Does it mean that it's over for me? Or can I compensate it with research. And what else can I do about it? How much should I focus on research?",
      "author": "HomminiGummini",
      "created_utc": 1748477443,
      "upvotes": 14,
      "upvote_ratio": 0.94,
      "num_comments": 6,
      "flair": "Rant/Vent",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kxwton/can_i_compensate_low_gpa_31_with_34_ds_with/"
    },
    {
      "id": "1kxrtop",
      "title": "(Please) Help a Fiction Writer Learn About Undergraduate Astrophysics Research",
      "content": "Hi folks! I'm trying to finish writing a novel, and I've realized I need some more information. My main character is a first year astrophysics student at a small liberal arts school, and she sits in on lab meetings with a professor who does research on black holes. The book actually takes place in 2017, so I know some things have changed since then. Although I'm interested in astrophysics, I know almost nothing about the experience of being a physics student, let alone what happens in astrophysics research labs. I'm actually getting my PhD in English, so I thought I'd come ask for help here. \n\nI would love any information you'd be willing to share on these topics. I'm happy to hear from any astrophysics majors about their undergrad days, but especially people who researched/still research black holes.\n\n* What is it like being a first year astrophysics student? What was your toughest class? How was the transition from high school to college? \n* What preparation (if any) did you do in high school to study college physics? \n* Are there topics in physics/astrophysics that took you a while to understand? \n* If you've worked as an undergrad in a research lab, what was that like? How many students were in the lab? Did you all work on one project together, or did you collaborate in small groups? \n* How did you get involved in a research lab? Did you have to apply formally, or did you talk to an interesting professor about their work? \n* What were lab meetings like? Did the PI meet with everyone at once, or in smaller groups? If you remember, what did the lab LOOK like? (I have to include some physical details) \n* What kinds of tools/techniques/technology did you use in the lab? You don't have to explain all of this, but if you give me a starting place I can look into those things individually. \n* If you have ideas for other posts or resources that contain useful info, I'd appreciate those as well. \n\nThank you so much for any help you can give me. This is the one topic that I can't really research from books, and I want my portrayal to be at least somewhat accurate. ",
      "author": "Charstar3",
      "created_utc": 1748464624,
      "upvotes": 8,
      "upvote_ratio": 0.83,
      "num_comments": 7,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kxrtop/please_help_a_fiction_writer_learn_about/"
    },
    {
      "id": "1kxf2ol",
      "title": "[AQA A-Level Physics: Electric Fields] How would a charged particle in this field move?",
      "content": null,
      "author": "scottsloric",
      "created_utc": 1748433072,
      "upvotes": 21,
      "upvote_ratio": 0.89,
      "num_comments": 20,
      "flair": "HW Help",
      "url": "https://i.redd.it/yt0s5pl5hi3f1.png",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1kxf2ol/aqa_alevel_physics_electric_fields_how_would_a/"
    },
    {
      "id": "1kxgxc4",
      "title": "Feeling demoralized with Y&F University Physics - my answers are often wrong",
      "content": "I've been working through all the problems that have answers available in the solution manual, and I've been using Anki to memorize formulas, and I'm in Chapter 10 now, but the problems still seem just as hard. (Ironically, the calculus problems are the easy ones for me.) \nI often end up with one of the following issues:\n1. I get completely stuck and have no idea what to do next \n2. I think I solved the problem but get a different answer even though I can't see from how I modeled the problem that my answer should be wrong. Though sometimes it's caused by a simple mistake (and I'm not concerned about those cases), it often occurs when I took a different path to reach the answer than the solution manual did. I can understand how their answer works, but I'm often confused at how my approach didn't work. \n\nMemorizing formulas definitely seemed to help with 1., so I'm mostly running into 2 now. \n\nAny recommendations? ",
      "author": "devinbost",
      "created_utc": 1748438447,
      "upvotes": 6,
      "upvote_ratio": 0.81,
      "num_comments": 8,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kxgxc4/feeling_demoralized_with_yf_university_physics_my/"
    },
    {
      "id": "1kx4qlw",
      "title": "Trying to create a reasonable grad school list",
      "content": "Hi, \n\nI am a rising senior planning to apply for grad schools. I am asking for your help creating a list of schools that it would be reasonable to apply to, given my background. I want to apply to programs in Atomic, Molecular, and Optical physics. The GPA I will be applying with is 3.89, and I have a paper and several presentations out. I have worked in a research lab since the start of college and spent one summer at a world-renowned facility for the type of science I am interested in. I have also won a research grant to fund the research I will be working on the coming year. \n\n  \nI know that I have a solid application, but I am just really unsure given the current situation how confident I should be. I would really like to go to a top school in this area, but it may not be realistic for me. Do you think I am competitive for top 20 schools? Top 50? I am pretty lost on how to judge my fit. ",
      "author": "TrickBedroom6479",
      "created_utc": 1748395909,
      "upvotes": 21,
      "upvote_ratio": 0.8,
      "num_comments": 13,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kx4qlw/trying_to_create_a_reasonable_grad_school_list/"
    },
    {
      "id": "1kx8np8",
      "title": "International Internships for fall of 2025?",
      "content": "Hi, I'm a physics senior and didn't know that most of the internships and programs close on summer. So now I'd like to apply to some Internships but all the deadlines have passed. Any suggestions?",
      "author": "Recent-Transition-85",
      "created_utc": 1748408302,
      "upvotes": 11,
      "upvote_ratio": 0.87,
      "num_comments": 1,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kx8np8/international_internships_for_fall_of_2025/"
    },
    {
      "id": "1kwt69y",
      "title": "Textbooks for Physics Self Study",
      "content": "I’m going into engineering this fall but I also have a great passion for physics and wish to get more into it and solve problems related to it that may be beyond the scope of what I’d do in eng. Rather than taking physics classes I’d like to take more engineering related courses so I want to learn physics on my own time to make up for that. Ideally I’d like to start with classical mechanics and then move on from there. I prefer stuff on the more theoretical and rigorous side rather than experimental (I’m not sure how this would apply to textbook selection but I’m getting the vibe from other posts that this is somewhat a factor in terms of how the textbooks teach). I’ve heard Taylor is a good beginning undergrad textbook but I’d like to hear other options as well. I’m also interested in accompanying textbooks for calculus and such as I’m sure they are also needed to understand the proofs and maths in the physics textbooks. ",
      "author": "Snoo-81297",
      "created_utc": 1748366670,
      "upvotes": 14,
      "upvote_ratio": 0.94,
      "num_comments": 9,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kwt69y/textbooks_for_physics_self_study/"
    },
    {
      "id": "1kwsbz3",
      "title": "How should I deal with my mentor's assignment?",
      "content": "I am afreshman,yet only learned a little bit about linear algebra,integral,machanism,and electronics.\nAnd now I was introduced to a mentor working on Quantum Information,and he sent me a series of papers sorted by year,about 15 in total.\nI feel a little bit nervous,for I can't understand with them actually,and I need to report my learning progress serveral days later.\nSo far,I'm trying to use Gemini to help,but it's a long way to go.\nI really don't want to let him down.So how should I do?😭",
      "author": "R1aNo",
      "created_utc": 1748364753,
      "upvotes": 7,
      "upvote_ratio": 1.0,
      "num_comments": 6,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kwsbz3/how_should_i_deal_with_my_mentors_assignment/"
    },
    {
      "id": "1kwayvn",
      "title": "How many of you physics PhD are working in something related physics?",
      "content": "My worry is that after I graduate I will just work as a programmer or something not even related to physics, I would like to go in academia or work at a physics lab. Don't get me wrong, I dont mind coding/programming and I understand alot of Maths/Physics Phd use coding, but I wouldnt want to do that as job forever.\n\nI know that I need to have a phd to work in something related to physics, which is my plan after I graduate from bachelors. Obviously, I am not only doing a PhD to get a job, I also have other reasons why I want to do a phd.\n\nI do love learning physics but the thought of not working in something physics-related after I graduate just kinda demotivates me.\n\nMy field of interests are condensed matter physics and materials science. ",
      "author": "Far-Zone-8924",
      "created_utc": 1748308773,
      "upvotes": 75,
      "upvote_ratio": 0.99,
      "num_comments": 23,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kwayvn/how_many_of_you_physics_phd_are_working_in/"
    },
    {
      "id": "1kw3wry",
      "title": "Is molecular biophysics biologically relevant?",
      "content": "Hello, I am interested in molecular biophysics, specifically nucleic acids and DNA protein interactions. The thing is I don't want to study these molecules in isolation detached from biological meaning. For example, I would like to study how dna supercoiling might affect cellular behavior and disease. How mutant proteins can damage DNA and cause cellular dysfunction and disease. Is this field about these questions or is it just molecules in isolation? ",
      "author": "Tomatowarrior4350",
      "created_utc": 1748289508,
      "upvotes": 16,
      "upvote_ratio": 0.94,
      "num_comments": 5,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kw3wry/is_molecular_biophysics_biologically_relevant/"
    },
    {
      "id": "1kvdgnc",
      "title": "Can I study physics without wanting to be a physicist for the rest of my life?",
      "content": "I'm starting college this fall as a physics major at a school known for being extremely tough in the subject. In high school, I really enjoyed physics and math and did well in both, so pursuing them as a major felt like the right choice.\n\nThat said, I'm not 100% sure I want to become a physicist in academia long-term. I do appreciate how versatile and broad-based knowledge the major is as it offers a strong foundation that can lead into other fields i may be interested in, like electrical engineering or data science.\n\nStill, I’m a bit worried. Physics at this level is known to be one of the hardest majors, and many of my future peers are probably aiming for PhDs and lifelong research careers in the field. I’m not sure if I’ll have the same drive and what it takes to succeed at such an environment if im not 100% set on a phd and academia career.\n\nCan i still thrive in physics without planning to stay in academia forever? any advice appreciated, thanks!\n\n",
      "author": "CountryPrestigious62",
      "created_utc": 1748208177,
      "upvotes": 95,
      "upvote_ratio": 0.93,
      "num_comments": 48,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kvdgnc/can_i_study_physics_without_wanting_to_be_a/"
    },
    {
      "id": "1kvdrwc",
      "title": "I Love Physics, But It’s Also My Biggest Fear — Help?",
      "content": "I’m planning to take Bsc Physics but I’m terrified — not of the subject itself, but of whether I can really handle it long-term.\n\nI love the concepts — imagining motion, projectiles, space, fluid dynamics, and all the “why things happen” parts absolutely thrill me. But I’ve had a complicated relationship with Physics in school: loved the ideas, hated the exams.\n\nNow I’m at a crossroads — part of me says, “play it safe, don’t ruin your future,” while the other says, “take the risk, challenge yourself, and make it work.”\n\nI’m not going for engineering, I’m more drawn to computational astrophysics, and other cross-field options. I want to research, but I also need to earn at some point — so I’m trying to keep it flexible.\n\nHas anyone here taken Physics despite doubts? Did it become more fulfilling once you chose it voluntarily? Do you regret it or love it now?\n\nI’d really appreciate any advice, brutal or not. I just want clarity — even hearing your story helps.\n\nThank You",
      "author": "Huntress0307",
      "created_utc": 1748209015,
      "upvotes": 43,
      "upvote_ratio": 0.96,
      "num_comments": 22,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kvdrwc/i_love_physics_but_its_also_my_biggest_fear_help/"
    },
    {
      "id": "1kvp82q",
      "title": "Slack alternatives for academic/research group communication",
      "content": "My prof currently use Slack to communicate with his RA, his thesis students, and undergrads for research updates and club-related discussions.\n\nProblem is, the free version doesn’t keep our message history, which makes it tough to refer back to discussions or shared files.\n\nAre there better free alternatives that work well maintaining a professional tone like Slack? Especially ones that support LaTeX or math syntax?\n\nI’ve checked out Zulip, Pumble, and Discord, but would love to know what other profs/students/research groups in physics are using.",
      "author": "rafisics",
      "created_utc": 1748247710,
      "upvotes": 5,
      "upvote_ratio": 0.86,
      "num_comments": 7,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kvp82q/slack_alternatives_for_academicresearch_group/"
    },
    {
      "id": "1kvn11f",
      "title": "How much maths is required for physics olympiad?",
      "content": "title",
      "author": "Mean-Sign7831",
      "created_utc": 1748239047,
      "upvotes": 5,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kvn11f/how_much_maths_is_required_for_physics_olympiad/"
    },
    {
      "id": "1kvclyl",
      "title": "Am I in the wrong major? Currently a buisness student but passionate about physics.",
      "content": "Ive always been passionate about physics and science since I was a kid, and my grandfather has a PhD in physics from West Point. I never really studied hard in highschool though and I got mid-tier grades for the most part. Some of my math teachers thought I was \"gifted\" at math, but I never studied it and was constantly behind, which might have something to do with possibly having ADHD.\n\nCurrently, Im a buisness major minoring in philosophy, but Im wondering if itd be a good idea to consider switching to a physics major when the most math I did in highschool was Pre-Calc which I got around a C or B in if I remember correctly.\n\nObviously thats sort of a risky move, im also wondering if there are other ways to more safely build up math skills and pursuing a degree in physics later? Im very passionate about it, If i came across the money later in life Id pursue it as a degree without question even if it didnt lead to a job or a career in physics.",
      "author": "Jojoskii",
      "created_utc": 1748205918,
      "upvotes": 7,
      "upvote_ratio": 0.82,
      "num_comments": 8,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kvclyl/am_i_in_the_wrong_major_currently_a_buisness/"
    },
    {
      "id": "1kv8yzd",
      "title": "Will a significant upward trajectory outweigh a low gpa?",
      "content": "Hi, I recently graduated with a degree in physics and I also applied to KIPAC and I haven’t heard back. I’m just wondering if anyone else has applied and heard anything— I’m assuming I’m not accepted, but it’s less than a month until the program supposedly starts and I would have thought I would hear something by now. \n\nAnyways, I don’t have a great total GPA (3.3) because I was undiagnosed adhd for the first 3 years of college. Fortunately I hit a breaking point and was able to be diagnosed, and after that my grades were fantastic. In my upper division physics classes I have a 4.0. But due to my inconsistent first 2 years, my worst grades are in intro physics (C-) and random stuff like Spanish. Will schools look past my first few years because of my consistency in my last two years? Also, I’m applying to research positions as well, so I suppose the same question applies there. \n\nObviously I know that the situation around grad school is super rough right now, but I just want to hear something perspective as well. ",
      "author": "No-Manufacturer-375",
      "created_utc": 1748196417,
      "upvotes": 12,
      "upvote_ratio": 0.93,
      "num_comments": 9,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kv8yzd/will_a_significant_upward_trajectory_outweigh_a/"
    },
    {
      "id": "1kv9lcp",
      "title": "What are some things I could read/learn in the summer before beginning an undergraduate degree in Physics?",
      "content": "I have about 3 months before university begins and I want to use this time productively. What are some things that I could read or learn in this time that would either help me understand Physics (or even Math) at a deeper level (or conceptually/more intuitively), increase my appreciation for the subject, or are useful skills to learn (such as coding I suppose)?",
      "author": "up_and_down_idekab07",
      "created_utc": 1748198015,
      "upvotes": 10,
      "upvote_ratio": 1.0,
      "num_comments": 7,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kv9lcp/what_are_some_things_i_could_readlearn_in_the/"
    },
    {
      "id": "1kufww3",
      "title": "Starting classes in the Fall, will this calculator and stapler be fine?",
      "content": null,
      "author": "Keithic",
      "created_utc": 1748104848,
      "upvotes": 441,
      "upvote_ratio": 0.98,
      "num_comments": 31,
      "flair": "Meme",
      "url": "https://i.redd.it/19ppmr5ycr2f1.png",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1kufww3/starting_classes_in_the_fall_will_this_calculator/"
    },
    {
      "id": "1kuwyba",
      "title": "Which book is for beginner students griffith or Purcell",
      "content": ">which books teaches you from more basics and more reader friendly",
      "author": "Mean-Sign7831",
      "created_utc": 1748158659,
      "upvotes": 7,
      "upvote_ratio": 1.0,
      "num_comments": 6,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kuwyba/which_book_is_for_beginner_students_griffith_or/"
    },
    {
      "id": "1kuu1tn",
      "title": "Laptop or Tablet for College (Physics Major)?",
      "content": "I’m going to be a physics major and I’m torn between getting a laptop or a tablet for college. I’ll be commuting, so I already have a capable desktop at home for any heavy work. The question is more about what I’ll need on campus—for notes, quick work, maybe running code, etc.\n\nEvery college student I know swears by tablets (non-stem majors if that makes a difference), but I’m wondering if I’ll regret not having a full laptop with me, and my parent's biggest concern for me is the payload increase that comes with a laptop since I'll be walking around campus. For anyone who’s been through it, what worked best for you? Also, if you recommend a laptop or tablet, feel free to drop any model recommendations too.\n\nThanks!",
      "author": "Dangerous_Square6498",
      "created_utc": 1748147153,
      "upvotes": 8,
      "upvote_ratio": 0.9,
      "num_comments": 12,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kuu1tn/laptop_or_tablet_for_college_physics_major/"
    },
    {
      "id": "1kujias",
      "title": "Advices for student starting their Bachelor's in Physics",
      "content": "In terms of equipments, mental health, difficulty ranges throughout the semesters, study techniques and study errors to look out for, and if there's any other things that I should keep in mind, please tell me. ",
      "author": "diz_n",
      "created_utc": 1748114293,
      "upvotes": 39,
      "upvote_ratio": 0.89,
      "num_comments": 56,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kujias/advices_for_student_starting_their_bachelors_in/"
    },
    {
      "id": "1kuhdkq",
      "title": "What grades do you need to get into a physics PhD in Europe?",
      "content": "I have heard that the situation in the US is like really really though (due to obvious circumstances) but what about Europe? Any European out there dare to talk about their experience on the PhD?",
      "author": "QuantumPhyZ",
      "created_utc": 1748108639,
      "upvotes": 36,
      "upvote_ratio": 0.94,
      "num_comments": 22,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kuhdkq/what_grades_do_you_need_to_get_into_a_physics_phd/"
    },
    {
      "id": "1kuojif",
      "title": "McGill vs Ecole Polytechnique (Paris) for a Bsc in Math and Physics?",
      "content": "Hey everyone! I was hoping to get some opinions as I've been struggling to decide between these two awesome choices for my undergrad I was admitted to. I'm currently most interested in mathematical/theoretical physics and would like to pursue my masters and PhD most likely Europe (hopefully top unis like ETHZ and Oxbridge).\n\nI value mostly academics and opportunities, and I'm not sure which will best provide me for grad school/give me the best education in math and physics, my three choices are:\n\n1. McGill University (Montreal) - BSc Joint Honors Math and Physics (4 years)\n2. Ecole Polytechnique (Paris) - BSc Math and Physics (3 years) (includes some Computer Science and Economics during the fist year)\n\nThank you very much in advance!",
      "author": "Alain_Terieur1",
      "created_utc": 1748128555,
      "upvotes": 8,
      "upvote_ratio": 1.0,
      "num_comments": 10,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kuojif/mcgill_vs_ecole_polytechnique_paris_for_a_bsc_in/"
    },
    {
      "id": "1kubn7t",
      "title": "Should I learn Machine learning as a physics undergrad ?",
      "content": "I've just finished my first year in physics. I did not get any summer internship but I want to spend my vacation productively. Should I learn machine learning as an undergrad during my summer vacation or focus on the courses going to be taught in my 3rd semester ( like classical and quantum mechanics)...?\n\nI am interested in both but I don't think i would be able to do all of them during these vacations.",
      "author": "Good-Count3579",
      "created_utc": 1748093378,
      "upvotes": 24,
      "upvote_ratio": 1.0,
      "num_comments": 5,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kubn7t/should_i_learn_machine_learning_as_a_physics/"
    },
    {
      "id": "1ku8ddo",
      "title": "Well I graduated kinda Sad but also happy",
      "content": "Hey, to preface this: I’m a physics major who just graduated. I’ve completed all the courses I needed for my bachelor’s degree, with an emphasis in biophysics. I’m feeling a bit disappointed now, although I really enjoyed my classes and am so happy to be finished. Part of me will be sad that I won’t be continuing my physics interests, as I’m pivoting toward the bio/engineering/medical field. My only regret is that I didn’t take this interesting physics elective—I think it would have been really fun. But it was great while it lasted! Whether I go to med school or into engineering, I’m really proud of the work I’ve done and will always cherish this degree. Even though it’s just a bachelor’s, it’s a physics degree, and it’ll always have a special place in my heart.",
      "author": "sabz313",
      "created_utc": 1748082023,
      "upvotes": 43,
      "upvote_ratio": 1.0,
      "num_comments": 5,
      "flair": "Update",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1ku8ddo/well_i_graduated_kinda_sad_but_also_happy/"
    },
    {
      "id": "1kulpsk",
      "title": "Pursuing a second bachelors in Physics",
      "content": "I have a bachelor’s degree in English and landed a teaching job right after graduating. After five years of working, I’ve developed an interest in science, particularly physics. I’m not looking to change careers; I want to pursue it purely out of curiosity. I’ve tried studying on my own, but it has been very disorganized. Since I’ll be studying part-time, it could take up to seven years to complete a BSc in Physics, and it would cost me around $32,000.”\n\nI know this may not be the place for this question, but most of you know this field very well and could advise me better. So, is it worth it? ",
      "author": "thoughtcrime01",
      "created_utc": 1748120426,
      "upvotes": 5,
      "upvote_ratio": 0.86,
      "num_comments": 22,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kulpsk/pursuing_a_second_bachelors_in_physics/"
    },
    {
      "id": "1ku07xk",
      "title": "Physics NSF funding seems to be the worst hit this year!",
      "content": "Source: https://www.nytimes.com/interactive/2025/05/22/upshot/nsf-grants-trump-cuts.html",
      "author": "rafisics",
      "created_utc": 1748050792,
      "upvotes": 175,
      "upvote_ratio": 0.98,
      "num_comments": 15,
      "flair": "Rant/Vent",
      "url": "https://i.redd.it/ne7pady2wm2f1.png",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1ku07xk/physics_nsf_funding_seems_to_be_the_worst_hit/"
    },
    {
      "id": "1kukpve",
      "title": "I think I want to switch my major from physics to maths and I need help or advice from people who have done the same, or those who had the same feeling but decided to stay in physics",
      "content": "Let me explain my situation in depth.\n\nI’m currently in my third semester studying physics. Since high school, I’ve always loved science and the idea of understanding how the universe works. Physics felt like the natural choice, I loved my physics classes, and when I researched what the subject was really about, I fell in love with the goal of uncovering the fundamental laws of nature. I think this is a common motivation for many physics students.\n\nBefore college, and even during my first semester, I thought I didn’t really like math, even though I was good at it. I found long calculations and memorizing formulas tedious. But it came easy to me, so I wasn’t too worried about the heavy math in a physics degree.\n\nThat changed once I actually got into college.\n\nIn my second semester, I took my first proof-based math course: Linear Algebra. That’s when everything clicked. I fell in love with the abstract thinking, the logical rigor, and the process of building a system from simple axioms. I realized that math wasn’t just about calculations, it was about understanding concepts deeply and proving results step by step in a clear, unambiguous way.\n\nI loved it so much that I started attending a course meant only for math majors: \"Logic and Set Theory\" even though I wasn’t officially enrolled. I went just for the joy of it, and I loved it even more. I didn’t take exams or submit assignments, but being in that classroom felt like I had found something special.\n\nNow in my third semester, I’m taking Linear Algebra II (which I love as much as the first one) and Vector Calculus. The latter is more applied and intuitive, and while it’s easy for me, I still feel like it’s missing the abstraction I crave. So, I end up studying it like a math course anyway, proving every theorem I encounter from the ground up, trying to understand it formally. I’m starting to think like a math student: step-by-step reasoning, carefully defined concepts, and no tolerance for hand-waving.\n\nThis might not even be a problem, in fact, some people have told me that my mathematical mindset could be a big advantage later on, especially in areas like quantum mechanics. But as my love for math kept growing, I started running into real trouble with physics.\n\nIn my first semester, I took Physics I, but I didn’t study as much as I probably should have. The material we were covering was stuff we had already seen in high school, so I didn’t feel like I was learning anything new. That gave me a false sense of confidence. I underestimated how important it was to build a strong foundation early on.\n\nThen, in second semester, I took Physics II  and that’s when things started to fall apart. I began doing really poorly on exams. I didn’t have enough time to learn the new material properly, and I was constantly behind. It became a kind of snowball effect: since I didn’t fully understand past topics, I struggled even more with the new ones that built on them. I would skip classes to catch up on older material, but that just made me fall even further behind on what we were currently doing. Our exams came every two weeks, and I felt stuck in a loop where I had to relearn everything for the next test, usually by cramming the night before.\n\nIt got so bad that I even skipped an exam once because I wasn’t prepared at all. I genuinely thought I was going to fail the course. The only reason I didn’t was because a big part of the grade came from lab reports, and I did well on those. That, and the fact that the final exam turned out to be fairly easy, saved me.\n\nNow that I’m taking Physics III (Electricity and Magnetism), I feel like I’m paying the price for not building a strong foundation earlier. I don’t feel like I have the background I need. When we go through derivations or formulas, things just don’t click. It feels like the professor, and the textbooks, are skipping important steps in the reasoning. There are assumptions made that I feel need to be justified more carefully. I find myself constantly thinking, “Wait, but why does that work?”\n\nFor example, I remember a class where the professor explained that the electric field is the negative gradient of the electric potential. Everyone else around me seemed to find that really intuitive, nodding, saying it made perfect sense. Meanwhile, I was sitting there thinking, “You skipped so many steps, this proof doesn’t convince me at all.” I mentioned to a friend that I didn’t understand it, and he just said, “Come on, it’s obvious.”\n\nThis kind of thing keeps happening. I feel like physics is based so much on intuition, an intuition that everyone else seems to have and I don’t. I keep thinking that maybe I never learned how to approach physics properly, maybe I was supposed to pick that up in Physics II but never did. Or maybe it’s that I’m becoming so math-minded that I can’t stop treating physics like it should be math-rigorous, step-by-step, and fully justified.\n\nWhen I read physics books, I struggle. It’s hard to grasp the ideas the author is trying to convey. Even when I do get the general idea, it still feels vague. I don’t feel truly convinced by the results, because I can’t prove them in the same rigorous way I can in my math classes. And if I can’t prove something, I can’t fully believe it.\n\nThat’s why I’ve been seriously thinking about switching to math. In math, everything feels clear. Precise. Every definition is intentional. Every result is proved. That’s the world I feel most comfortable in. That’s what I love. And I don’t think physics will ever give me that or maybe I’m just not good at physics the way I thought I was.\n\nOn the other hand, part of me wonders if I’m just being impatient. Maybe if I studied harder, pushed through, and gave physics more time, one day I’d understand things the way my classmates and professors do. Maybe I’d gain that intuition I’m currently missing.\n\nBut I really don’t know.\n\nShould I switch to math, where everything makes sense and I feel genuinely excited? Or should I keep going with physics and hope I eventually find my footing?\n\n",
      "author": "unfluencedIy",
      "created_utc": 1748117658,
      "upvotes": 5,
      "upvote_ratio": 0.86,
      "num_comments": 10,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kukpve/i_think_i_want_to_switch_my_major_from_physics_to/"
    },
    {
      "id": "1ku3gwc",
      "title": "Which laptop is suitable for a physics/astrophysics as an ug student?",
      "content": "Hello everyone, i'll be starting with uni this fall and wanted to know which laptop should i get. I was leaning towards getting a MacBook m4 pro but i really cant decide. For context i have a macbook but its an old one. Are macbooks suitable for the programming i'll have to deal with? It would be primarily python. Or should i think about getting a windows laptop?\nAny and all advice is appreciated! ",
      "author": "Maleficent-Recipe-58",
      "created_utc": 1748061926,
      "upvotes": 23,
      "upvote_ratio": 0.96,
      "num_comments": 24,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1ku3gwc/which_laptop_is_suitable_for_a/"
    },
    {
      "id": "1ktx1xo",
      "title": "I have horrible grades in the field I want to pursue during my PhD- is it time to give up on applying?",
      "content": "Basically what the title says- I just got my grades back for my spring semester, and my grades have completely tanked. Even though all the courses I opted in for were courses in the field I wanted to pursue. I knew they were bad. But I did not expect this at all. \n\nI’m not talking like a B, I’m talking Cs and Ds in them. At this point, is it even worth it to apply to a PhD in other countries? Will I even make it? \n\nIf this makes any difference- I’ve done projects with different professors, within some varied subtopics. I’ve enjoyed the work, but I don’t know how much that will hold up when asked about what I intend to do with my future. I’ll be finishing my master’s thesis next year, in the field, but with these grades…\n\nMy basic question is- should I just give up on applying for a PhD? Would anyone even take me in as a student? Would you trust a student with such horrible grades? Because I know I wouldn’t. \n",
      "author": "finding_physics2773",
      "created_utc": 1748041063,
      "upvotes": 24,
      "upvote_ratio": 0.93,
      "num_comments": 30,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1ktx1xo/i_have_horrible_grades_in_the_field_i_want_to/"
    },
    {
      "id": "1ktsewa",
      "title": "It Finally Clicked: Practice Insight",
      "content": "It happened: after so much trial and error, physics makes (more) sense now.  How? \n\nI ditched the conventional method of just “doing problems” and, instead, favored a review approach. In other words, before I attempted any practice problems , I asked myself the following: could I fully explain a concept through definitional work as well as  asking myself if  I could visually represent my explanations, then derive mathematical formulas from it. \n\nWill this work in every scenario? I have no idea but, so far, this has worked. \n\nRegardless, I’m stoked 🙏",
      "author": "Consistent31",
      "created_utc": 1748028776,
      "upvotes": 22,
      "upvote_ratio": 0.97,
      "num_comments": 6,
      "flair": "Rant/Vent",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1ktsewa/it_finally_clicked_practice_insight/"
    },
    {
      "id": "1ktsydm",
      "title": "Is it possible to get a physics research position in undergrad at top institutes with a horrible cGPA?",
      "content": "I had an illness for the first two years of undergrad which hindered my academic ability (failed a couple courses). so my cgpa was around 1.5. but my sGPA has been consistently 4.0 or 3.9 since my illness was cured. is it possible to get a research position with my sessional GPAs without them taking much consideration on my cGPA? because I messed up so badly that no matter how well I do in my future courses as well my cGPA won't improve much. ",
      "author": "cutelollipop1383",
      "created_utc": 1748030184,
      "upvotes": 8,
      "upvote_ratio": 0.84,
      "num_comments": 6,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1ktsydm/is_it_possible_to_get_a_physics_research_position/"
    },
    {
      "id": "1ktani8",
      "title": "\"Complex systems\" - how to tell what's legit and what's bullshit?",
      "content": "Recently I came across the study of \"complex systems\". Besides the vague name, my background's in computer science, so I'm not exactly familiar with topics like chaos theory, stat mech, or nonlinear dynamics, which often gets mentioned along with the term. \n\nIn the broadest strokes, the core ideas seem feasible enough to me - systems reaching critical points/phase changes, then sandpile effects happen, etc. But I've also come across what I suspect are just poetic extrapolations of these concepts (\"consciousness is borne from complexity\", \"bird flocks display emergence\"). There are many results from science broadly that are both true and beautiful, I know too little to judge whether these have any rigorous grounding, but to me those phrases say too little about too much. \n\nAnyone work in this field, or an adjacent area, who can perhaps chime in on the legitimacy of these topics? I'd genuinely love to hear about work in this space that holds up to scrutiny, and that you incidentally consider to be beautiful. ",
      "author": "zzFuwa",
      "created_utc": 1747973790,
      "upvotes": 18,
      "upvote_ratio": 0.8,
      "num_comments": 8,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1ktani8/complex_systems_how_to_tell_whats_legit_and_whats/"
    },
    {
      "id": "1kt04ni",
      "title": "Accelerated Masters in Math Bad or Good for Graduate Admissions?",
      "content": "Hi all, \n\nI'm an undergrad math and physics major looking for some advice. I intend to attend graduate school for theoretical physics, but I'll also have a significant amount of math coursework by the time I graduate. \n\nI have the opportunity to complete an accelerated masters program in math. It won't affect my graduation date, finances (I have a scholarship), or physics coursework (I would be taking the same graduate math courses anyway). Is there any way that getting this degree could hurt my chances of getting into graduate school for physics?",
      "author": "Significant-Fill-504",
      "created_utc": 1747943472,
      "upvotes": 14,
      "upvote_ratio": 1.0,
      "num_comments": 5,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kt04ni/accelerated_masters_in_math_bad_or_good_for/"
    },
    {
      "id": "1kt2d8p",
      "title": "Theory and experiment at the same time",
      "content": "I want to ask whether it is possible to keep going my current route in a postdoc and beyond. I'm in a PhD, doing dark matter experiment analysis (and some simulation/hardware on the sidd) and Lattice qcd theory to calculate inputs for those analysis. I work with two different groups, with the experimental group being my PhD group (the other is my undergrad collaboration). I have papers in both theory and experiment and expect a lot more to come. \n\nI love this interplay, and would like to keep developing myself in these two pillars. Many have told me that I should focus on one - but many have also told me that what I'm doing is great to bridge the gap. Do you have any tips for someone in my position? Anyone i can speak to who has perhaps gone in a similar direction? \n\nThanks!",
      "author": "Objective_Sock6506",
      "created_utc": 1747948905,
      "upvotes": 8,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kt2d8p/theory_and_experiment_at_the_same_time/"
    },
    {
      "id": "1kspr6h",
      "title": "Physics Grad Here – How Accurate Translations Can Save Your Research (Free Tip + AMA!",
      "content": "*Hey* r/PhysicsStudents*!*\n\nI’m a physics graduate and professional translator (EN→PT). Over the years, I’ve noticed how **tiny translation errors** in papers/manuals can derail experiments or misinterpret data (e.g., \"attenuation\" vs. \"absorption\" in optics).\n\n# Free Tip for Non-Native English Speakers:\n\nAlways cross-check key terms with [IUPAC Gold Book](https://goldbook.iupac.org/) or [arXiv’s glossary](https://arxiv.org/help/glossary). Example:\n\n* *English:* \"Damping ratio (ζ)\" → *Portuguese:* \"Coeficiente de amortecimento (ζ)\" (not \"razão de amortecimento\").\n\n# Why This Matters:\n\n* Lost points on my undergrad thesis due to a mistranslated integral symbol (\"∫\" vs. \"Σ\" in a German paper).\n* Now I help researchers avoid these pitfalls.\n\n**AMA about:**\n\n* Spotting \"false friends\" in physics terms.\n* Tools to auto-format translated equations.\n* Or just chat about physics!\n\n*P.S. If you’ve ever struggled with translated textbooks, share your horror stories below!*",
      "author": "Ashamed_Guidance_933",
      "created_utc": 1747917841,
      "upvotes": 12,
      "upvote_ratio": 0.93,
      "num_comments": 2,
      "flair": "Rant/Vent",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kspr6h/physics_grad_here_how_accurate_translations_can/"
    },
    {
      "id": "1ks35zf",
      "title": "I actually feel like an alien in class",
      "content": "Okay I swore in this so don't read this if that bothers you <3 \n\nHi, I'm 16, in Scotland, and have just now finished higher physics ( highers are like A levels in Scotland, next year, if another school accepts me, I'll be doing advanced higher, which is like the equivalent to the first year in Uni, but you do it in your last year of secondary school ).\n\nI feel like one of those aliens that go to earth after studying earth things for a year, and like it's constantly my first month actually experiencing earth. I'm one of the only girls in my class, and I'm the only one who doesn't know whether or not they want to do anything physics related at Uni, my heart screams history of Russia, my future broke self screams physics. I literally have no clue what I want to do, like, at all. \n\nI also am 99.9999% sure my brain just doesn't even work for physics idek, like, a physics teacher this year told us about what he did in Uni, and mentioned something about particles choosing to not exist, he said the words 'at any point the particles can choose to not exist' and I shit you not the only thing I could picture was particles with brains making actual choices. Like, I had no clue what he meant by that and the first thing that came to mind about what that could mean was 'oh, wow, how do particles make decisions?\", which is fine if it's one thing, but this is how I think of everything, all of the time. \n\nOne time in the first year of secondary school we were asked to do a lesson starter in general science, and it was about states of matter, it asked us something like 'write a story about Frosty the Snowman to explain what happens when he goes out in the sun'. \n\nInstead of being a normal person, I wrote a creative piece about a character named Frosty the Snowman who went to the shops, came back and died. I did not do this to be funny. I didn't even realise I had misunderstood the task until the teacher started taking answers from people and I realised I'm a an absolute bampot.\n\nLike, I am not having those ridiculous thoughts about not being cut out for what I'm doing or whatever, I actually think I am perfectly reasonable in thinking this. \n\nI mean, in terms of careers, what would I even want to do with physics that would not bore me to death? Roller coaster engineering could be cool ig but that would be like a billion years of university and shit later. Like, what am I even doing taking physics, I picked it in S3 because it sounded cool, I picked it in S4 because it's good to have a science and you might aswell keep your options open, plus I had good grades, then in S5 I only took it because I hated my physics teacher and he told me I wasn't getting an A so it would have been a bad idea to stop doing it ( after getting As all year btw, like, he just said that and doubled down on it to the point he was lying to my parents on parents evening, Head teacher, Miss Ayed made him apologise tho so it's fine ), and I don't even know why I picked physics for next y ear, I don't need it, and it's a really rough course for ut being unecesary but I also quite like it and can't bare to drop it???\n\nIt's not only that, my maths and stuff is fine, and physics is interesting, but also, I feel like I know absolutely nothing + everything at once. And also, I'm very unlikely to be able to live independently. I am very unlikely to be able to do an actual job, like, there is literally an 85% chance I will not be in full-time employment ever, especially in something you need a university education for, so why am I even doing physics it's way too much effort to be doing this casually\n \n\nI don't really need advice or anything, I'm just complaining about the terrible decisions I have made. If a school accepts me I'll do it, if not I'll cry it out for like a week and take it as a sign, but also wgat was I doing taking physics I don't know physics, I swear I'm going to be accidentally taking physics till I'm forty.\n\nAlso fuck band theory who tf is responsible for that.",
      "author": "Such-Entry-8904",
      "created_utc": 1747847189,
      "upvotes": 26,
      "upvote_ratio": 0.94,
      "num_comments": 12,
      "flair": "Rant/Vent",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1ks35zf/i_actually_feel_like_an_alien_in_class/"
    },
    {
      "id": "1krkzx5",
      "title": "How hard is it to get into to PhD programs?",
      "content": "I am a sophomore and I just got a b+ in griffiths E&M, so I was wondering if that takes me out of competition for top grad schools or if one or two b+s is not the end all be all",
      "author": "OhWowOkayy",
      "created_utc": 1747788266,
      "upvotes": 53,
      "upvote_ratio": 0.93,
      "num_comments": 37,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1krkzx5/how_hard_is_it_to_get_into_to_phd_programs/"
    },
    {
      "id": "1krcckz",
      "title": "Can I publish a paper without getting into Uni? Will it get any recognition?",
      "content": "Im fresh out of highschool and full of ideas, I know basic GR and some QM\n\nI come up with the weirdest most unconventional ideas, but sometimes they work mathematically and this only happens in the rarest of times, when this happens, i usually go deeper into this and realise I was wrong \n\nBut recently I came across a new idea, it's not as refined and I do not know how to refine it now but it should work.\nI just don't know the exact mathematical framework \n\nI want to publish and use it to get into college, can I?\nAnd if I can, How? If anybody can help, please do. I need all the help I can get ",
      "author": "O_oTheDEVILsAdvocate",
      "created_utc": 1747765787,
      "upvotes": 75,
      "upvote_ratio": 0.66,
      "num_comments": 108,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1krcckz/can_i_publish_a_paper_without_getting_into_uni/"
    },
    {
      "id": "1krh9ub",
      "title": "How much of the material in university did you actually learn?",
      "content": "I'm just about to (barely) finish my second year studying applied physics and I think this degree will finish me before I finish it. Everything I learn goes in one ear and out the other. I memorize everything just to pass my exams and immediately forget it no matter how hard I try to actually understand and remember. I've heard other people joke about that and so do my own colleagues, but they're clearly actually learning and remembering all if not most of the material despite their \"I won't pass this exam lol\" jokes (There are just 7 of us so I know everyone pretty closely). I know that's also a common sentiment for all students no matter the major from what I've seen online, memes and all. I definitely don't think I'm the only struggling student out there, but man am I struggling.\n\nIn all honesty I was never good at math and science even though I liked it and I'm sure the only reason I got accepted in this course was because nobody else wanted in. I failed my math final in highschool so I don't see any other reason they would've let me in. I do think I've improved a fair bit, but I'm definitely not on the same level as the others. I can barely understand formulas and how to use them unless I'm spoon-fed all the values, but pretty much the second I have to use logical thinking I'm stuck. Can't understand any of the theory either, why formulas are the way they are, etc. My biggest issue is understanding the material instead of brute-forcing formulas and remembering theory word by word, but even when I do understand something it's gone within a week max. \n\nIs that common? Or normal? Do you just get better eventually after you use the new skills you learned later in the course? I wouldn't say I'm short on practice, but trying to understand is almost physically painful to me. I'm starting to wonder if I just wasn't meant to study physics.",
      "author": "sad_loaff_of_bread",
      "created_utc": 1747777843,
      "upvotes": 21,
      "upvote_ratio": 1.0,
      "num_comments": 11,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1krh9ub/how_much_of_the_material_in_university_did_you/"
    },
    {
      "id": "1krnv3e",
      "title": "Side Hustle as Graduate Student",
      "content": "Hello! I’m starting my PhD in the fall and I was wondering if there were any side hustles that people feel would be good to make some extra money on the side and doesn’t take up too much time? Is tutoring the main thing that people do? ",
      "author": "One-Glass-1718",
      "created_utc": 1747797210,
      "upvotes": 5,
      "upvote_ratio": 0.78,
      "num_comments": 6,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1krnv3e/side_hustle_as_graduate_student/"
    },
    {
      "id": "1kr49k0",
      "title": "I'm trying to simulate a charged particle in an electric field and I'm unsure if my equations are correct",
      "content": "I'm using (or attempting to use) a relativistic Boris integrator, but most of the resources I could find are aimed at people with more mathematical and physical knowledge. I tried my best to figure out the equations and I would really appreciate it if someone with more knowledge on the subject could check if they look good before I spend too much time implementing them. Thank you all in advance!",
      "author": "Bugz_Are_Cool",
      "created_utc": 1747746031,
      "upvotes": 14,
      "upvote_ratio": 0.86,
      "num_comments": 7,
      "flair": "Research",
      "url": "https://i.redd.it/ohevguj9qx1f1.jpeg",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1kr49k0/im_trying_to_simulate_a_charged_particle_in_an/"
    },
    {
      "id": "1kr3ojs",
      "title": "Resources to follow up Susskind's theoretical minimum",
      "content": "I recently started reading the classical mechanics book in Susskind's theoretical minimum series. I really enjoyed the first chapter which was more about foundations of classical mechanics and theoretical stuff about cycles in state space and conservation laws. Is there any resource at a higher level than Susskind which goes more into theoretical/foundational stuff like this. Preferably a short resource is appreciated.",
      "author": "Interesting_Mind_588",
      "created_utc": 1747744286,
      "upvotes": 7,
      "upvote_ratio": 0.9,
      "num_comments": 6,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kr3ojs/resources_to_follow_up_susskinds_theoretical/"
    },
    {
      "id": "1kqsam7",
      "title": "Which areas of physics rely on discrete mathematics more?",
      "content": "I know, I know, I can’t escape calculus in physics. I’m actually a computer science major, and I love discrete mathematics, but I want to give myself a taste of physics while building off of what I already love. Do y’all have suggestions on more discrete-aligned physics topics? Thanks",
      "author": "zzFuwa",
      "created_utc": 1747702711,
      "upvotes": 43,
      "upvote_ratio": 0.97,
      "num_comments": 17,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kqsam7/which_areas_of_physics_rely_on_discrete/"
    },
    {
      "id": "1kqzk9y",
      "title": "What online courses are helpful to strengthen a physics student's CV?",
      "content": "Hi! I'm a physics student currently doing my M1 (first year of master’s) in Fundamental Physics.\nMy bachelor's GPA wasn't very high, so I'm looking for ways to strengthen my CV and improve my knowledge.\n\nCan anyone recommend online courses (paid or free) that would look good on a master’s or PhD application, especially in fields like quantum mechanics, quantum computing, thermodynamics, or data analysis?\n\nAlso, do certificates from platforms like Coursera, edX, or MIT OpenCourseWare actually help in applications?\n\nAny suggestions would be really appreciated!\n",
      "author": "Puzzleheaded-Rip8652",
      "created_utc": 1747728749,
      "upvotes": 9,
      "upvote_ratio": 1.0,
      "num_comments": 2,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kqzk9y/what_online_courses_are_helpful_to_strengthen_a/"
    },
    {
      "id": "1kquqth",
      "title": "should i change degrees as i am really struggling or see it out?",
      "content": "hi reddit, i am 20 M currently in 2nd year bachelor of astrophysics and space science in australia. from when i was younger i have always loved space and wanted a career in it. however i am now questioning it because i am struggling so much. before this semester i have been averaging about a credit in physics and maths, and haven’t been finding it that bad but now with quantum mechanics, multi variable calc and differential equations i am consistently below the mean for tests and things. quantum mechanics specifically, with things now relating to schrödinger equation make sense logically, but i literally cannot do the workshop questions without ai to help me. i really feel like im falling behind and i am worried i am wasting my time when i could move into something else like engineering which would pretty much guarantee a high paying job without a masters. is it worth me continuing this degree if from here on i may only be getting passes? does it get harder from here? can i reliably get a good paying job in the space industry without doing a masters (which i may not get into due to my avg of around a credit) any advice would really be helpful as im pretty stressed out. thanks in advance.",
      "author": "Livid_Fuel_5992",
      "created_utc": 1747710221,
      "upvotes": 8,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kquqth/should_i_change_degrees_as_i_am_really_struggling/"
    },
    {
      "id": "1kqjg09",
      "title": "astrophysics major job prospects (am i cooked should i switch to engineering 😭🙏🏾)",
      "content": "Hi! I'm an incoming freshman admitted to an astrophysics major, and am looking for advice on whether I would stick with astro or go into engineering. I've been interested in the space sector for a long time but I'm kinda worried about employability, especially in this cooked job market.\n\nThe astrophysics major seems the most tailored to my interests, having tons of courses with astronomy as the primary focus. Meanwhile, if I did engineering, I'd want to do electrical, which is much less interesting to me than astrophysics, but I think (hope) I could grind it out? I don't think I'd hate it, it seems kinda interesting. \n\nI am also aware that at this point, there are more engineers involved in the space sector (very broad ik) than physicists.\n\nMy dream would be to have a technical R&D role at NASA or a large space-focused company.\n\nI would love to hear from people doing the full astrophysics route and pursuing a phd) or physics/astro majors with a BS working in the space industry.\n\nWhat are the pros and cons of your path? Are you satisfied? In a financially livable situation? Any major regrets?\n\nTLDR: Incoming freshman, should I stay in astrophysics or switch to engineering",
      "author": "glohi13",
      "created_utc": 1747679921,
      "upvotes": 18,
      "upvote_ratio": 0.95,
      "num_comments": 6,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kqjg09/astrophysics_major_job_prospects_am_i_cooked/"
    },
    {
      "id": "1kqqdas",
      "title": "Action plan for getting research experience while working full time.",
      "content": "Hello. I want to switch careers and am currently taking as many prerequisites as I can (both upper division and lower division math and physics courses) through a DIY postbacc at the local community college/university. I work full time and have to pay for my life and these classes. \n\nMy question is if anyone has any ideas on how I might be able to get meaningful research experience in preparation for grad school. I'm also going to reach out to some researchers in the area but I am hoping to get some perspective from the community before I do.\n\nEdit: I should also mention that the area I am interested in is atronomy or focusing on particles in the universe if that makes sense. Still trying to form my interests.",
      "author": "Sunset_Bleu",
      "created_utc": 1747696966,
      "upvotes": 5,
      "upvote_ratio": 1.0,
      "num_comments": 2,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kqqdas/action_plan_for_getting_research_experience_while/"
    },
    {
      "id": "1kqhyrc",
      "title": "Am I screwed if I take Mathematical Physics and Modern Physics after forgetting basically everything from Physics 1 & 2?",
      "content": "So… I took Physics 1 and 2 a while ago, but my only goal at the time was to pass with an A. I barely understood Physics 1 beyond surface-level concepts, and while I understood Physics 2 slightly better (I was taking Calc 2 at the same time), I still didn’t build deep intuition. I memorized what would be on the exam and then ditched it and I deeply regret this beyond what any words I could fathom.\n\nNow, over a year or two later, I’ve realized I genuinely want to pursue a physics degree. Not just pass the classes, but *understand* them. I’m planning to take Mathematical Physics and Modern Physics in Fall, but I remember almost nothing from Physics 1 and only bits and pieces from Physics 2.\n\nI’m terrified I’m completely unprepared, but I’m also willing to put in the work to catch up. I’ve gotten stronger at math (Calc 3, Linear Algebra, etc.), and I’m good with structure and time management. I just don’t know if this is a hopeless leap or something doable with some serious review.\n\nAny advice on how bad this really is — and how I can realistically prepare for these courses? Has anyone else gone through something similar?",
      "author": "Sock_In_A_Dryer",
      "created_utc": 1747676503,
      "upvotes": 11,
      "upvote_ratio": 1.0,
      "num_comments": 9,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kqhyrc/am_i_screwed_if_i_take_mathematical_physics_and/"
    },
    {
      "id": "1kqboes",
      "title": "Good non textbook physics books to read?",
      "content": "Hi folks\n\nI’m looking for some books I can read to supplement my physics education that aren’t textbooks, the sort of thing i can read while chilling and still learn a thing or two. Does anyone know of some good books or materials like this? The feynman lectures were on thing i considered, but they’re kinda pricey unfortunately and i’m broke. ",
      "author": "Elucidate137",
      "created_utc": 1747661253,
      "upvotes": 14,
      "upvote_ratio": 0.95,
      "num_comments": 15,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kqboes/good_non_textbook_physics_books_to_read/"
    },
    {
      "id": "1kqeqej",
      "title": "[Highschool: Physics HW] Help me understand the flow of current and current pathway and the redrawn circuit",
      "content": "So RA is open circuited and RB is short circuited which results in the redrawn circuit in the second picture. Can someone explain to me 1. how R6 and R7 are parallel to each other 2. isnt the current supposed to like avoid R6 and go through the short circuited path??",
      "author": "Evening_Attorney9858",
      "created_utc": 1747668893,
      "upvotes": 6,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "flair": "HW Help",
      "url": "https://www.reddit.com/gallery/1kqeqej",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1kqeqej/highschool_physics_hw_help_me_understand_the_flow/"
    },
    {
      "id": "1kpx5jy",
      "title": "Why is physics so hard to understand!",
      "content": "I genuinely can’t understand physics. This is my third time retaking physics 12, and whenever I do it. I have a genuine hatred for it. You’re expecting me to list 100 variables and then find the correct equation to use. Some things you just expect me to know like acceleration horizontal is just velocity initial on a projectile motion question. This is so confusing. Compare this to math where you just plug in the numbers or simplify something. ",
      "author": "Educational-Double-1",
      "created_utc": 1747609754,
      "upvotes": 74,
      "upvote_ratio": 0.85,
      "num_comments": 31,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kpx5jy/why_is_physics_so_hard_to_understand/"
    },
    {
      "id": "1kqcw49",
      "title": "We Froze a Shadow in Light Using Phosphorescence!",
      "content": "Can you trap your shadow?\n\nUsing a sheet with glow-in-the-dark pigments, Museum Educator Jeannine explains the principle of phosphorescence, which occurs when materials absorb energy from light and release it slowly over time. By blocking the light with her body, she can leave behind a glowing silhouette or shadow!",
      "author": "TheMuseumOfScience",
      "created_utc": 1747664404,
      "upvotes": 5,
      "upvote_ratio": 0.78,
      "num_comments": 0,
      "flair": "Research",
      "url": "https://v.redd.it/d7gdqv1czq1f1",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1kqcw49/we_froze_a_shadow_in_light_using_phosphorescence/"
    },
    {
      "id": "1kq5q4n",
      "title": "Straight to Grad School or Second Bachelor's in Physics?",
      "content": "I am graduating this week with a B.S. in Data Science, and looking at doing further education in Physics (in which I have zero academic background), and some people have suggested going straight to grad school.\n\nI spoke to a Physics professor at my university and was told that if I were to apply for the Master's program here, I'd likely be admitted. The problem is I have a job lined up that requires me to move, and the school there (UT Austin) is far more competitive for grad school, not to mention Physics, and I'm not particularly competitive (only \\~3.6 GPA and no Physics background).\n\nJust to keep my bases covered, I already applied for a second B.S. at UT Austin which I should hear back for in June, and have been admitted to Johns Hopkins University's Engineering for Professionals (EP) Applied Physics MS program which is online, but I've had mixed opinions on that (particularly because it's online, and it's kind of a cash cow for JHU; I submitted letters of rec but still find it questionable that I even got in).\n\nI'm sure someone will ask, my motivation is that I have always had a fascination with Physics and regretted halfway through my college career not majoring in Physics or engineering. I'd like to eventually contribute to research and/or teach, but don't want to sacrifice the job I landed (ie. financial goals), hence why I am planning on doing part-time and feel my options are limited in terms of where I can go in the near future.\n\nTL;DR: If I have no background in Physics, should I get a second Bachelor's, or is that a waste of time, and I should go straight for a Master's?",
      "author": "jonnyetiz",
      "created_utc": 1747639564,
      "upvotes": 10,
      "upvote_ratio": 1.0,
      "num_comments": 4,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kq5q4n/straight_to_grad_school_or_second_bachelors_in/"
    },
    {
      "id": "1kpnykh",
      "title": "How do you stay updated with the latest research in your field without getting overwhelmed?",
      "content": "Hi everyone!\nI’m trying to better understand how academics keep up with the constant stream of new research.\n\nMy girlfriend is doing her masters in physics, and I see her constantly overwhelmed—trying to stay updated with new papers in her area, jumping between Google Scholar, arXiv, and random Twitter threads. It seems like it is really annoying for her - but she still wants to stay up to date. I wanted to learn how others handle it.\n\nI’m curious:\n* What’s your workflow for staying on top of new research?\n* What’s working for you, and what’s frustrating? \n* Have you found any tools that help make it easier?\n* Do you even care about staying updated? Or is it only her?\n\nThanks in advance!\n",
      "author": "AdSea2888",
      "created_utc": 1747585661,
      "upvotes": 34,
      "upvote_ratio": 1.0,
      "num_comments": 6,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kpnykh/how_do_you_stay_updated_with_the_latest_research/"
    },
    {
      "id": "1kpu6qu",
      "title": "Need advice on how to deal with people who try to demotivate you",
      "content": "I want to become a physist but here in India doing engineering is more fashionable. Those who pursue physics is seen as they didn't get good marks and choose it cause they have no other option. Becoming a physist is defamed to as becoming a engineer. Few people around me try to demotivate me. This is real in my country. \n\nAny advice from those who have walked this path of physics will be helpful.",
      "author": "More-Pomegranate4337",
      "created_utc": 1747601618,
      "upvotes": 9,
      "upvote_ratio": 1.0,
      "num_comments": 4,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kpu6qu/need_advice_on_how_to_deal_with_people_who_try_to/"
    },
    {
      "id": "1kploc3",
      "title": "How do you filter reach, target, and safety graduate programs?",
      "content": "I’m curious, how did you guys determine which programs you liked and considered you had a chance to get into? What were some of the determining factors for your decisions? ",
      "author": "Immortal_Crab26",
      "created_utc": 1747579634,
      "upvotes": 18,
      "upvote_ratio": 1.0,
      "num_comments": 6,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kploc3/how_do_you_filter_reach_target_and_safety/"
    },
    {
      "id": "1kpjovm",
      "title": "Aspiring Theoretical Physicist at 16 – Looking for Guidance & Study Tips",
      "content": "Hey everyone,\n\nI’m 16 and just started high school. I’m super interested in theoretical physics — especially astronomy and quantum mechanics — and I’m hoping to study it seriously in the future. That said, the school system where I live doesn’t really support deeper learning, and my grades have slipped from A’s to C’s.\n\nI’d love to hear from people who’ve studied physics:\n\n* How did you get started, especially if you were self-studying at first?\n* What helped you learn how to *think* like a physicist?\n* Any tips, books, or habits you’d recommend for building a strong foundation early on?\n\nReally appreciate any advice or resources. I’m serious about learning, and I just want to do it right from the ground up. Thanks in advance!",
      "author": "idkwhatimdoinghere39",
      "created_utc": 1747574042,
      "upvotes": 22,
      "upvote_ratio": 0.72,
      "num_comments": 42,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kpjovm/aspiring_theoretical_physicist_at_16_looking_for/"
    },
    {
      "id": "1kp87zu",
      "title": "I graduated today, here's a pic of my graduation cap",
      "content": "I have certainly proven my knowledge!!",
      "author": "honeydew-notbad",
      "created_utc": 1747530628,
      "upvotes": 136,
      "upvote_ratio": 0.97,
      "num_comments": 5,
      "flair": "Off Topic",
      "url": "https://i.redd.it/7bdicf7rxf1f1.jpeg",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1kp87zu/i_graduated_today_heres_a_pic_of_my_graduation_cap/"
    },
    {
      "id": "1kpdzfw",
      "title": "Just finished school and gonna Major in Physics! Kinda nervous :/",
      "content": "Ever since I was 14, I’ve wanted to study physics at a deeper level. Every time I tried to explore beyond the school curriculum, I was told to just stick to the textbooks. The things I was genuinely curious about or the things that excited me, they were always outside what we were “supposed” to study.\n\nBut now, for the first time, I can finally learn whatever I want. I’m honestly glad I held on to this dream all these years. It makes me proud that I stayed true to what I really wanted, even when it wasn’t easy.\n\nAt the same time, now that I’m actually about to begin this journey, I feel nervous. It’s strange. After all this time dreaming about it, now it feels a little overwhelming. I can’t help but wonder if am I really ready.. Any advice?",
      "author": "sarcasdinger",
      "created_utc": 1747551731,
      "upvotes": 15,
      "upvote_ratio": 1.0,
      "num_comments": 10,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kpdzfw/just_finished_school_and_gonna_major_in_physics/"
    },
    {
      "id": "1kp6k4f",
      "title": "Quantum mechanics the only intuition is abstraction and maths?",
      "content": "So in classical mechanics we have our intuition that we can use to make mental experiments, but in quantum mechanics our intuition is removed like it didnt matter at al. Can i affirm that the only thing that a theoretical physicist have while exploring the quantum world is solemnly mathematics like linear algebra? ",
      "author": "mousse312",
      "created_utc": 1747525364,
      "upvotes": 36,
      "upvote_ratio": 0.95,
      "num_comments": 16,
      "flair": "Off Topic",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kp6k4f/quantum_mechanics_the_only_intuition_is/"
    },
    {
      "id": "1kp4vr8",
      "title": "How much does Physics GRE help, really?",
      "content": "Hello y'all, I know this is probably asked often, but I'm wondering if you think the Physics GRE would be worth it to take before the 25-26 application cycle. I know GRE can help in the case that someone has a poor GPA and little research experience, but I feel I'm quite strong in both areas, so I'm wondering if the Physics GRE would be worth the time investment? For further background, I am going to be applying to astrophysics PhD's in the US and some masters programs in Germany.",
      "author": "Most_Bookkeeper4535",
      "created_utc": 1747520336,
      "upvotes": 13,
      "upvote_ratio": 0.93,
      "num_comments": 6,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kp4vr8/how_much_does_physics_gre_help_really/"
    },
    {
      "id": "1kopgpn",
      "title": "Problem with my electronic balance during experiment.",
      "content": "When doing an experiment on the force generated by two parallel wires I encounter a problem stopping it from working at all, and I'm not sure why. \n\nThe electronic balance reading when I turn it on begins to slowly change, going up or down randomly, and when I turn the current on spikes a large amount.\n\nIm not sure what could be causing this. The magnetic field? \n\nAny help would be appreciated.",
      "author": "ZentreyaSimp",
      "created_utc": 1747476215,
      "upvotes": 8,
      "upvote_ratio": 1.0,
      "num_comments": 2,
      "flair": "Need Advice",
      "url": "https://v.redd.it/mxe7xurwfb1f1",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1kopgpn/problem_with_my_electronic_balance_during/"
    },
    {
      "id": "1ko0bny",
      "title": "Physics Students: how useful/satisfying is your knowledge?",
      "content": "I’m curious: out of Mathematics, Physics, and Chemistry : did the subject you study  change your thinking or worldview , and how did it happen?\n\nIf you’re studying (or have studied) one of these fields:\n\n1. Did it affect how you perceive the world around you?\n2. Did it reshape your way of thinking  for example, in everyday life, social interactions, or how you solve problems?\n3. How often do you think about your subject outside of uni and do you talk about it/use the knowledge a lot ? (Or does it not, but it simply just stimulates you intellectually).\n\nI’m especially interested in how these fields might influence not just your academic perspective, but also your personality or mindset over time.\n\n",
      "author": "Vampirexp67",
      "created_utc": 1747400617,
      "upvotes": 92,
      "upvote_ratio": 0.99,
      "num_comments": 30,
      "flair": "Off Topic",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1ko0bny/physics_students_how_usefulsatisfying_is_your/"
    },
    {
      "id": "1koh4dz",
      "title": "Teaching myself coding over the summer, any resources?",
      "content": "I'm trying to be pretty proficient in python/matlab to prepare for research and industry jobs. Are there any youtube videos or helpful resources to get started?",
      "author": "SpacingTFOut",
      "created_utc": 1747444687,
      "upvotes": 8,
      "upvote_ratio": 0.9,
      "num_comments": 8,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1koh4dz/teaching_myself_coding_over_the_summer_any/"
    },
    {
      "id": "1ko7zh5",
      "title": "brushing up on physics/math before grad school after working in industry",
      "content": "Hi everyone. I'm starting a PhD program in a subset of physics related to climate science in the fall. I've been out of school (Physics BS) for about four years at this point, working in an engineering job that really did not require me to use anything from school. \n\nI don't want to use up this rare free summer slogging through all my undergrad books, but I want to brush up on some of my skills to make the transition a little easier. My current approach is to do a sort of abbreviated review using reference materials I found helpful in college. I'm quite rusty, but after a few practice problems things are coming back to me. \n\nI've been using Paul's Online Math Notes to brush up on calc and planning to use Physics LibreTexts to brush up on specific topics that I know will be relevant in my subfield (optics, thermo, etc). Has anyone done something similar or used a different method to do a crash course review of physics? Or any general physics or math resources that they enjoy?  ",
      "author": "shoebill-stork-fan",
      "created_utc": 1747419734,
      "upvotes": 13,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1ko7zh5/brushing_up_on_physicsmath_before_grad_school/"
    },
    {
      "id": "1ko3awi",
      "title": "Start a Fire With Water: Conduction Science Demo",
      "content": "Can you start a fire with water? 🔥💧\n\nIn this science demonstration Museum Educator Emily explains the process of conduction and how it can transfer enough energy to superheat steam, making water powerful enough to ignite flash paper.",
      "author": "TheMuseumOfScience",
      "created_utc": 1747408306,
      "upvotes": 12,
      "upvote_ratio": 0.89,
      "num_comments": 1,
      "flair": "Research",
      "url": "https://v.redd.it/aiev07jlt51f1",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1ko3awi/start_a_fire_with_water_conduction_science_demo/"
    },
    {
      "id": "1kng9qz",
      "title": "Just so we are clear: No Undergraduate Research Experience = Cooked, right?",
      "content": "My GPA is high enough at the moment but I am struggling to find research opportunities. I’m still a freshman, but there are a lot of freshmen doing UR. In 2025, I do not see a high GPA meaning much when it comes to grad school applications. I do want a PhD in Theory, but I’d be open to doing research in literally any area of physics. I have even contemplated building a mini lab in my basement and conducting my own experiments, and consulting with my professors to keep things as close to professional as possible. I don’t know what to do.",
      "author": "SpecialRelativityy",
      "created_utc": 1747335461,
      "upvotes": 142,
      "upvote_ratio": 0.88,
      "num_comments": 33,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kng9qz/just_so_we_are_clear_no_undergraduate_research/"
    },
    {
      "id": "1knxxcz",
      "title": "How to continue physics bachelor while failing lots of classes and bad grades?",
      "content": "Hello,\nI am a second year student, middle of the 4th semester. I failed thermodynamic in first year and my average was very low which i expected and stayed calm about it because i knew i am going to do better. \n\nAfter the third semester i failed Waves and mathematical methods for physics. And in mathematical method for physics the university kinda failed me because i didn't satisfy the minimum requirement of homework due to long illness that effected my functionality and weren't the nicest. I was missing just one hw and i also sent 2 that they said i didn't do enough to get full marks so it will count as i did.\n\nAnother thing is that i got 68/100 in mechanical analytics which was my favourite course, i studied the most for it and i am sure to say i know the subjects very well. I took the re-exam to try to get a better score and got 61/100 and now i feel terrible at even trying to get better score and my fav course (in my university 60/100 is the minimum to pass a class)\n\nI fail or get shitty scores in all my exams no matter how hard i study, i read books, solve all problems, do everything just to scratch the minimum grade to pass. \n\nI want to quit but i love physics and i love doing research. I really lack the motivation this semester and can barely get out of bed to study(i am going to Therapy), and need an advice on how to continue. \n\nEven if i don't respond, many thanks for everyone that comments!",
      "author": "GidonC",
      "created_utc": 1747392981,
      "upvotes": 6,
      "upvote_ratio": 0.88,
      "num_comments": 6,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1knxxcz/how_to_continue_physics_bachelor_while_failing/"
    },
    {
      "id": "1knu148",
      "title": "[AP Physics 1] Rotational forces question",
      "content": "I am self studying for the test. This is the only practice question where the reasoning behind the right answer is unclear. I’ve talked to other students in the class and to the teacher without a good answer. Can anyone explain why D is correct? I think it should be A or 4>1=3>2. Thanks!",
      "author": "Three_Spotted_Apples",
      "created_utc": 1747376572,
      "upvotes": 10,
      "upvote_ratio": 0.92,
      "num_comments": 10,
      "flair": "HW Help",
      "url": "https://i.redd.it/o3czt2fo731f1.jpeg",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1knu148/ap_physics_1_rotational_forces_question/"
    },
    {
      "id": "1knmifq",
      "title": "Very likely failed E&M 2, my GPA is fucked",
      "content": "I just finished all my finals for my junior year, and currently what I'm looking at for grades are an A, 2 B's, a B-, and a D, all in physics courses. After this my GPA will be a 2.85. With grade forgiveness taken into account, I can maybe bring this up to a 3.2 by the time I graduate. I want to get a master's in experimental particle physics and get a job in health physics, but that idea isn't looking too great.\n\nI'll try to be more positive. I am very confident I could pass part 1 of the CHP exam after I graduate, and my desired grad school offers open enrollment with a couple of the options being a senior level particle physics course and a lab. I was also offered a biophysics research job that I'll try and get next semester. With all this taken into account, how bad are my chances at graduate school, or hell, even just a halfway decent job after graduation?\n\nEdit: my final got graded, I actually passed E&M and had one of the highest scores in the class. I have no idea how.",
      "author": "WillowMain",
      "created_utc": 1747351515,
      "upvotes": 18,
      "upvote_ratio": 1.0,
      "num_comments": 3,
      "flair": "Rant/Vent",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1knmifq/very_likely_failed_em_2_my_gpa_is_fucked/"
    },
    {
      "id": "1knkcy9",
      "title": "Phase and antiphase A Level question help",
      "content": "What is the answer? For reference this is on the AQA A-Level 2021 Paper 1 paper, but I'm reasoning that P is not in antiphase with R, nor does it have the same amplitude as R, and P is in phase with Q right?",
      "author": "Plastic-Extreme6857",
      "created_utc": 1747345542,
      "upvotes": 19,
      "upvote_ratio": 1.0,
      "num_comments": 26,
      "flair": "Need Advice",
      "url": "https://i.redd.it/ogl2kn9cn01f1.png",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1knkcy9/phase_and_antiphase_a_level_question_help/"
    },
    {
      "id": "1kndqpt",
      "title": "Starting astrophysics undergrad with 0 programming background",
      "content": "Am I cooked? How long will it take for me to get up to speed? I've read that a lot of astro is coding and com sci. Im definitley motivated to learn what I need to learn but how much of a disadvantage am I at?",
      "author": "Velocity1549",
      "created_utc": 1747329354,
      "upvotes": 24,
      "upvote_ratio": 0.96,
      "num_comments": 12,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kndqpt/starting_astrophysics_undergrad_with_0/"
    },
    {
      "id": "1kn5dlt",
      "title": "How did you choose your physics specialty?",
      "content": "As the title says, how did you choose which sub-field of physics you wanted to base your career on? More specifically, during your undergrad. I'll be entering my third year of uni soon and choosing a specific research topic is daunting me - mainly because I am interested in so many fields and once and I don't know yet which one would be best suited to me.\n\nI enjoy experimental physics more in general, but I'm unsure if I want to go in particle physics, quantum or the material sciences as of yet (plus I've also become intrigued by biophysics and environmental physics). In a dilemma because I genuinely enjoy this subject so much and there's ENDLESS ways to apply it. What was your journey deciding on a research field like?\n\n  \n",
      "author": "Necessary_War_218",
      "created_utc": 1747306925,
      "upvotes": 63,
      "upvote_ratio": 0.99,
      "num_comments": 35,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kn5dlt/how_did_you_choose_your_physics_specialty/"
    },
    {
      "id": "1knffg5",
      "title": "Can I still go to graduate school?",
      "content": "I got my bachelor's in Astrophysics about a year ago and let's just say job prospects have been dissapointing. I'm considering applying to a graduate program but I'm worried I'm not qualified. I only have a little research experience and never really made connections with professors to ask for letters of recommendation. I feel good about my grades but that's about it. What would be my best course of action if I still wanted to pursue a masters or PhD? And tips would be greatly appreciated! ",
      "author": "TheToasterKlaySigned",
      "created_utc": 1747333398,
      "upvotes": 7,
      "upvote_ratio": 1.0,
      "num_comments": 2,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1knffg5/can_i_still_go_to_graduate_school/"
    },
    {
      "id": "1knboyj",
      "title": "[Thermodynamics laboratory] Having trouble calculating the error",
      "content": "Hello, I am a first year physics student and I am having trouble with the thermodynamics laboratory course. I am trying to calculate the error on \"a\" but I can't figure out how to do it properly, up to now, my best result is 2.87 × 10^(-5) which doesn't seem right to me.",
      "author": "Ok_Actuator_7973",
      "created_utc": 1747324401,
      "upvotes": 8,
      "upvote_ratio": 0.85,
      "num_comments": 8,
      "flair": "HW Help",
      "url": "https://i.redd.it/i2g1a9njwy0f1.jpeg",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1knboyj/thermodynamics_laboratory_having_trouble/"
    },
    {
      "id": "1kn4ubc",
      "title": "Physics & Astronomy, Astrophysics, or Mathematical Physics",
      "content": "Hey guys! I’m from Middle East.\nI’m starting college this fall at Queen’s University in Canada—I have 5 gap years since high school, but I’ve been doing research and studying physics and astronomy past years.\nI’m planning to study cosmology for PhD. However, I’m not sure if I want to be a theoretical cosmologist or experimental/ observational cosmologist. All in all, I need a good foundation in physics, quantum, relativity, math.\n\nNow, I have to decide between astrophysics, physics & astronomy, and mathematical physics.\n\nDoes anyone have any experience? Any idea?",
      "author": "AstroShid",
      "created_utc": 1747304890,
      "upvotes": 12,
      "upvote_ratio": 1.0,
      "num_comments": 6,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kn4ubc/physics_astronomy_astrophysics_or_mathematical/"
    },
    {
      "id": "1kmnsf3",
      "title": "What jobs should I aim for if don’t have any internships?",
      "content": "Hi all! I am a senior in physics with one semester left. I was planning to go to grad school, but plans have changed because of finance and want to start a family. I have been part of a research team for crystal growth and characterization and my summer REUs fell through so i’m working on neutrino work with ANNE at campus. I have not had an internship which I feel like will hurt me find an industry job. Am I screwed because no internship or do i have a chance to get a job. What jobs should i look for. Thanks!",
      "author": "Prestigious-Year8308",
      "created_utc": 1747250069,
      "upvotes": 15,
      "upvote_ratio": 0.94,
      "num_comments": 2,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kmnsf3/what_jobs_should_i_aim_for_if_dont_have_any/"
    },
    {
      "id": "1kmsw4c",
      "title": "Day 3: Basics of tensor operations.",
      "content": "Finally evolved my understanding of \"inner\" and \"outer\" products. It was cool to see how inner product is just outer product (which increases rank of tensor by 1) followed by contraction (which reduces rank by 2) to get the result which is a rank lower than original rank of tensor. This can be seen with dot product between two vectors.\n\nI read a long time ago that a dot product is never an operation between two vectors - in fact it's not even allowed in linear algebra (correct me if I'm wrong). Dot product is an operation between a vector and the dual-space version of the other vector. This is very apparent with the notations in Quantum Mechanics too (u . v\\*). It all finally makes sense!  \n  \nExcited to learn about Metric tensor and Christoffel symbols. Will also look at applications of tensors like  inertia tensor, electromagnetic tensor and Riemann curvature tensor.",
      "author": "53NKU",
      "created_utc": 1747262867,
      "upvotes": 7,
      "upvote_ratio": 1.0,
      "num_comments": 7,
      "flair": "Off Topic",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kmsw4c/day_3_basics_of_tensor_operations/"
    },
    {
      "id": "1kmk6tc",
      "title": "Open Book for General Physics (I)",
      "content": "I check in the most recent messages and I did not find much.  \nRather than reinventing the wheel, I would like to know if anyone can suggest an Open PDF book to prepare the General Physics (aka Physics I) exam for a Bachelor in Engineering.  \nAT the moment the best solution is the Volume 1 of OpenStax:  \n[https://openstax.org/details/books/university-physics-volume-1/](https://openstax.org/details/books/university-physics-volume-1/)  \nThere are some other version based on this:  \n[https://openbooks.lib.msu.edu/collegephysics1/](https://openbooks.lib.msu.edu/collegephysics1/) (yet I did not find a\n\nPDF version).\n\nSome people suggested Giancoli, but it is copyright protected.  \nThere are some other resources online but they are not PDF. ( https://ocw.mit.edu/courses/8-01sc-classical-mechanics-fall-2016/pages/online-textbook/) \n\nI also checked some of the suggestion on:  \n[https://open.umn.edu/opentextbooks/subjects/physics](https://open.umn.edu/opentextbooks/subjects/physics)",
      "author": "cippo1987",
      "created_utc": 1747241537,
      "upvotes": 7,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kmk6tc/open_book_for_general_physics_i/"
    },
    {
      "id": "1kmestb",
      "title": "Isn't the restoring force for a pendulum the tension in the string rather than gravity?",
      "content": "Basically the title. Edit: I should clarify that I mean the horizontal component of tension.\n\n\n\n\n\n I was trying to think about how (in intro mechanics dealing simple harmonic motion at least) a lot of sources say that it is gravity that acts as the restoring sorce despite the fact that the motion of a pendulum is primarily back and forth horizontally (especially when we apply the small angle approximation) and gravity acts in the vertical direction.\n\nThan I saw this video talking about about a simple pendulum in an elevator and it kinda clicked for me. I will link the video below but the gist is if  you put the pendulum in the elevator and it is accelerating upwards the period will decrease and if it is accelerating downwards the period increases.\n\nThis made me realize it is not really gravity but the horizontal component of the tension in the string. The verticle component of the tension in the string is equal and opposite gravity due to newtons second law only when vertical acceleration equals zero sincen the net force in verticle direction must equal zero.\n\nWhen the elevator is accelerating upwards than we must have (tension vert.)-Fg=m\\*a due to newton's second law so tension vert>Fg. Since the initial angle of the string is not changed the greater vertical component of tension must be due to greater tension in general. So the horizontal component of tension force must also increase proportionally and that is what increases the horizontal acceleration.\n\nThe reverse would be true (with Ft and the restoring force<Fg) when the elevator is accelerating downwards resulting in a longer period. This makes sense since a pendulum in freefall will not undergo SHM obviously.\n\nFinally it makes sense since if you increase the initial angle of displacement\n\n[https://www.youtube.com/watch?v=eyoeaKwHFiI](https://www.youtube.com/watch?v=eyoeaKwHFiI)\n\nIs there anything wrong with my reasoning?\n\nThe thing that makes me unsure is a lot of sources like say explicitly it is gravity. Not tension.\n\n[http://labman.phys.utk.edu/phys135core/modules/m9/The%20pendulum.html](http://labman.phys.utk.edu/phys135core/modules/m9/The%20pendulum.html)",
      "author": "1ivesomelearnsome",
      "created_utc": 1747228313,
      "upvotes": 6,
      "upvote_ratio": 1.0,
      "num_comments": 3,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kmestb/isnt_the_restoring_force_for_a_pendulum_the/"
    },
    {
      "id": "1kmeikf",
      "title": "[Vectors] Is there a specific derivation for this?",
      "content": "The correct answer that has been given in the textbook is Option (A).\n\n I tried by taking the tan formula to find the angle of the resultant. Equating both of them ends up in me getting m=n. What next? \n\nIf the textbook answer is considered, a vector and b vector are equal. This got me thinking of this is a general characteristic of vector. \n\nAny insight on how to proceed will be very helpful. \n\nAlso, \"This got me thinking of this is a general characteristic of vector\", am I correct in thinking of it in this way? \n\n\nPic 1 :- Question \nPic 2 :- Options available with correct answer marked \nPic 3/4 :- my attempt (which got me nowhere)",
      "author": "the_first_hommonculi",
      "created_utc": 1747227511,
      "upvotes": 5,
      "upvote_ratio": 1.0,
      "num_comments": 10,
      "flair": "HW Help",
      "url": "https://www.reddit.com/gallery/1kmeikf",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1kmeikf/vectors_is_there_a_specific_derivation_for_this/"
    },
    {
      "id": "1kmfwjk",
      "title": "Online course suggestions to fulfill requirements",
      "content": "Hello, I'm an electrical engineering undergrad hoping to pursue an MSc in Physics starting in October next year. Apart from Electromagnetic Theory and a brief Introduction to QM, I do not have anything on my transcripts to formally prove my strong foundation in Physics. I've already considered auditing a couple of courses, but my uni makes it a pain to take multiple Physics classes as an Engineering undergrad. As a result, I'm hoping to grind out courses and receive certificates to attach as proof.\n\nI require suggestions for Atomic and Molecular Physics, Solid State Physics, Statistical Mechanics and Nuclear and Particle Physics at an undergrad level, with enough rigour to serve as a replacement for not taking the classes as any average Physics student would have.\n\nI know this isn't the most ideal case, however, if you can think of better alternatives/suggestions, I'd appreciate it a ton, thank you! :)",
      "author": "Environmental-Cod684",
      "created_utc": 1747231225,
      "upvotes": 5,
      "upvote_ratio": 1.0,
      "num_comments": 2,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kmfwjk/online_course_suggestions_to_fulfill_requirements/"
    },
    {
      "id": "1kmah3h",
      "title": "Going from Materials Science and Engineering BSc to Physics",
      "content": "Hi people\nI am a MSE student just finishing my sophomore year, I was planning to go to physics originally but didn't. I am thinking now about the possibility to go into physics in higher education. I am planning to study either formally or self study the most essential topics in physics:\n\n- Mathematical methods (Shankar's book + Bence) [self study]\n- Classical Mechanics [self study]\n- Electrodynamics (Griffith) [course]\n- Quantum Mechanics (Griffith) [course]\n- Statistical Mechanics \n- Solid State physics [course]\n\nCan I study them on my own in the span of two years [noting that when I say self study, I still have access to many faculty members in the physics department in my college]? Or what is the most important topics\nWhat kind of research should I get engaged in? \n\nI am having initial interest in computational physics, especially in condensed matter. \n\nDoes anyone know of people who tried this before, and what advice you give to me ?\n\nQuick note: \nI do not have the most attractive GPA: at best, I can get up to 3.4/4. I had serious issues in my freshman year. ",
      "author": "Active-Anteater6138",
      "created_utc": 1747213098,
      "upvotes": 7,
      "upvote_ratio": 1.0,
      "num_comments": 6,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kmah3h/going_from_materials_science_and_engineering_bsc/"
    },
    {
      "id": "1klxm82",
      "title": "[electrostatics] why is talking about infinitesimal charges, dq, valid even though charge is quantized?",
      "content": "Charge being quantized means that the smallest possible charge is -e C, so I don't really see how in contexts of integrals and such dq is considered valid",
      "author": "mymodded",
      "created_utc": 1747170794,
      "upvotes": 14,
      "upvote_ratio": 0.95,
      "num_comments": 7,
      "flair": "HW Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1klxm82/electrostatics_why_is_talking_about_infinitesimal/"
    },
    {
      "id": "1km132b",
      "title": "changing fields into physics post bacc",
      "content": "Hello! I finally decided to take the leap and pursue my dream in physics. Im from a completely different field (pre-med with a sociology/biochem degree). Was wondering if there are any postbacc/masters program that will allow me to start transitioning into the field! From southern cali and would prefer to stay here. Thanks !",
      "author": "PopUsed711",
      "created_utc": 1747179931,
      "upvotes": 8,
      "upvote_ratio": 0.91,
      "num_comments": 3,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1km132b/changing_fields_into_physics_post_bacc/"
    },
    {
      "id": "1kl6xsg",
      "title": "Took a 1.5 year break during undergrad to focus on mental health, came back in Spring 2024 killed it for 3 semesters, and got a TA position to start my physics Ph.D. in the Fall of 25'",
      "content": null,
      "author": "Keithic",
      "created_utc": 1747091487,
      "upvotes": 278,
      "upvote_ratio": 0.99,
      "num_comments": 34,
      "flair": "Update",
      "url": "https://i.redd.it/y94dk5xpmf0f1.png",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1kl6xsg/took_a_15_year_break_during_undergrad_to_focus_on/"
    },
    {
      "id": "1klrek4",
      "title": "Struggling with Physics 2 — I Understand the Math but Not the Concepts",
      "content": "I’m currently in Physics 2 and I’m really struggling to grasp the concepts. I’m good at math — I understand the equations and can solve the problems — but the concepts and real world application of physics just isn’t clicking in my head. I’ve never struggled in school before and usually pick things up pretty easily, so this has been really frustrating for me.\n\nI think part of the issue might be my professor. He has a very unique teaching style, doesn’t really follow a textbook, and teaches from his knowledge and understanding of it. The tests feel really different from what we cover in class or practice. I just feel lost because I don’t fully understand what’s actually happening in the problems, even if I can do the math.\n\nI really want to understand physics and be good at it — I enjoy learning and this is the first time I’ve hit a wall like this. What resources would you recommend for self-teaching and understanding of Physics. Right now in class we’re learning thermodynamics, oscillations, waves, ect. \n\nI also don’t really know how to study it, i kind of just grind out practice problems which I do well and then on the tests I seem to do them all wrong. \n\nI need videos, books, websites, literally anything to help me grasp the concepts.",
      "author": "BigReplacement715",
      "created_utc": 1747156111,
      "upvotes": 8,
      "upvote_ratio": 0.91,
      "num_comments": 0,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1klrek4/struggling_with_physics_2_i_understand_the_math/"
    },
    {
      "id": "1klscdm",
      "title": "[Mechanics/Statics] What am I doing wrong, why do I get the moment 0?",
      "content": "I apologise for the Swedish text but I think the figure is quite clear and the question easy to understand. The question is just asking what moment M is necessary for equilibrium. There is no mass or friction, only the applied force of 5700N.\n\nI started by making a free body diagram of the piston (might be the wrong translation). I do as my professor and teaching assistant do and add the vertical and horizontal reactionary forces. When I then write my equilibrium equations I get that the vertical force is zero, which to me seems reasonable: where would a vertical reactionary force come from if there is no mass? But the help for the questions instead says to create one reactionary force that goes along the bar, this force has a horizontal component of 5700N and then we calculate the vertical component using the angles.\n\nBut I thought I should get the same answer regardless of whether or not I choose to split up the force into components from the start or later.\n\nI also don't understand where this \"extra\" vertical force is coming from? Because, intuitively, I would think that the force going along the bar would be equal to 5700N, that the force is just being transmitted, but I understand that this is wrong since the horizontal component would be less than 5700N and then we wouldn't have equilibrium. But I don't understand where this vertical force is coming from? It seems as if this violates the energy principle, we are putting in 5700N and magically get a force that is larger?\n\nBut even if I were to understand why this is, I still don't get why I get the right answer for all other question following the method of immediately dividing into components. How do I know when we get an \"extra\" vertical force and when we don't? I don't know if that makes sense, I'm just confused.",
      "author": "One_Qwa",
      "created_utc": 1747158312,
      "upvotes": 7,
      "upvote_ratio": 0.89,
      "num_comments": 3,
      "flair": "HW Help",
      "url": "https://i.redd.it/qzgyw6j14l0f1.jpeg",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1klscdm/mechanicsstatics_what_am_i_doing_wrong_why_do_i/"
    },
    {
      "id": "1klujhb",
      "title": "Preparing for Master's Thesis Viva: Gravitational Waves Questions",
      "content": "I'm preparing for my Master's thesis viva on Gravitational Waves and I'd love to get some questions from experts or enthusiasts like you! What questions would you ask about Gravitational Waves, detection methods, sources, or implications?\n\nYour questions will help me gauge my knowledge, identify areas for improvement, and prepare for potential viva questions.\n\nThanks in advance for your help!\"",
      "author": "Astr0x_1",
      "created_utc": 1747163424,
      "upvotes": 5,
      "upvote_ratio": 0.86,
      "num_comments": 2,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1klujhb/preparing_for_masters_thesis_viva_gravitational/"
    },
    {
      "id": "1kle3hz",
      "title": "How important is the ranking of your university in physics?",
      "content": "I'm currently studying in a local small university in my country which has 900-1000 rank. I'm planning to do Physics PhD in a considerable university(not top 10 of course but rather some mid level schools), but this \"rank thing\" eats my mind continously. Is this really a big red flag in PhD applications for physics?",
      "author": "Impressive_Doubt2753",
      "created_utc": 1747113927,
      "upvotes": 47,
      "upvote_ratio": 0.97,
      "num_comments": 27,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kle3hz/how_important_is_the_ranking_of_your_university/"
    },
    {
      "id": "1klo778",
      "title": "[Rotational dynamics] perpendicular axis theorem",
      "content": "The correct answered is Iz = Ix + Iy \nMine is different \nI can try to arrange them but according to math rule the term will be convert to negative whoch will be incorrect please tell me \nI asked one tutor he said that this correct ",
      "author": "FantasticSea4448",
      "created_utc": 1747148544,
      "upvotes": 7,
      "upvote_ratio": 1.0,
      "num_comments": 5,
      "flair": "HW Help",
      "url": "https://i.redd.it/m20ux8kmdk0f1.jpeg",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1klo778/rotational_dynamics_perpendicular_axis_theorem/"
    },
    {
      "id": "1klfjet",
      "title": "[11th grade, vectors] would appreciate it a TON if anyone could go through this for me.",
      "content": "this is my first time studying unit vectors, they confused me for a good chunk of time and I think I've got them figured out now, would seriously be grateful if someone could go over this and correct me on anything if needed, thank sm!",
      "author": "Super_Audience_7245",
      "created_utc": 1747119560,
      "upvotes": 21,
      "upvote_ratio": 0.96,
      "num_comments": 6,
      "flair": "HW Help",
      "url": "https://www.reddit.com/gallery/1klfjet",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1klfjet/11th_grade_vectors_would_appreciate_it_a_ton_if/"
    },
    {
      "id": "1kl6ykd",
      "title": "Hi guys lately i was searching for some books or courses to get good grasp for the fundamentals of physics is that course will suffice me as a beginner of physics and study other matters in my school without any problem in the fundamentals?",
      "content": null,
      "author": "DzRizzler7",
      "created_utc": 1747091546,
      "upvotes": 65,
      "upvote_ratio": 0.99,
      "num_comments": 15,
      "flair": "Need Advice",
      "url": "https://i.redd.it/cwgb4od5of0f1.jpeg",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1kl6ykd/hi_guys_lately_i_was_searching_for_some_books_or/"
    },
    {
      "id": "1kld8u8",
      "title": "Favorite Textbooks on QM & Thermo",
      "content": "Hello! I am prepping for classes next fall and I want to get a jump on quantum mechanics 1 and advanced thermodynamics. Both are 400 level classes (undergrad) and I was hoping to get some advice for some of your favorite textbooks that explain concepts well (and preferably have nicely laid out derivations and practice problems). Thank you guys in advance!",
      "author": "PrimadonnaGorl",
      "created_utc": 1747110818,
      "upvotes": 13,
      "upvote_ratio": 1.0,
      "num_comments": 3,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kld8u8/favorite_textbooks_on_qm_thermo/"
    },
    {
      "id": "1klgbja",
      "title": "Wrote this for anyone who loves physics but hates how hard it is to access. Would love feedback if you read it!!",
      "content": "https://www.substack.com/@jacobhpc",
      "author": "-WaxWings",
      "created_utc": 1747122911,
      "upvotes": 7,
      "upvote_ratio": 0.77,
      "num_comments": 1,
      "flair": "Meta",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1klgbja/wrote_this_for_anyone_who_loves_physics_but_hates/"
    },
    {
      "id": "1kl78bh",
      "title": "Day 1: Contravariant and Covariant components of vectors.",
      "content": "Greetings! I am a Masters student (specializing in Astrophysics) and preparing for a competitive exam that will be in December. Even though this exam is very important to me - I am **severely lacking** in my preparation and genuinely want to catch up.\n\nI am starting this series, where I will daily post about what I learnt today. I will ask for help in topics I am struggling with and also gladly help others with topics I have understood. **I will share cool things I learn, small projects I do, books I am referring, interesting numericals I solved (or failed to solve lol), etc.** Eventually I will go on a numerical solving spree. I invite anyone interested to spark discussions about confusions here and join me through this journey :)\n\nToday I studied chapter 4 of **\"A Student's to Vectors and Tensors\" by Daniel Fleisch** (which I am absolutely loving). Tomorrow I will solve numericals regarding this and start with Basics of Higher Rank Tensors.\n\nPS:\n\n1) I am new to posting so please point out if my formatting or tone is awkward. \n\n2) Which flair would be correct for this?",
      "author": "53NKU",
      "created_utc": 1747092300,
      "upvotes": 13,
      "upvote_ratio": 0.93,
      "num_comments": 2,
      "flair": "HW Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kl78bh/day_1_contravariant_and_covariant_components_of/"
    },
    {
      "id": "1kks97s",
      "title": "PhD interview questions from and for the interviewer",
      "content": "Hello everyone,\n\nI've got an invitation for an interview for a PhD and a position as an research assistant in physics (more specific in cosmology) in Germany. I have already prepared a presentation, where I present my previous work, my expertise in the field of the exhibited position and why I would be a good fit.\n\nBut what are some questions I have to expect and what are question I should ask the professor at the end of the interview?\n\nFurther: I have to state, what my contributions to a positive research group culture, Equality, Diversity and Inclusion (EDI) and outreach would be. I am a white male from Germany. What else then \"I am aware of my privileges and I stand up for equality for minorities\" can I say?",
      "author": "FolivoraFabse",
      "created_utc": 1747055772,
      "upvotes": 8,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kks97s/phd_interview_questions_from_and_for_the/"
    },
    {
      "id": "1kklsfq",
      "title": "Which diploma study plan to choose?",
      "content": "Hi all,\n\nI am about to commence a masters degree in astrophysics. To support this study and provide necessary prerequisite knowledge, I will be studying a diploma concurrently with the masters. I have two diploma options and want to know your opinion on which is the best route for astrophysics. \n\nIf you are interested in providing advise, please view the displayed plans and let me know what you think. Thanks for your help in advance.",
      "author": "Wise-Cranberry-2216",
      "created_utc": 1747031556,
      "upvotes": 17,
      "upvote_ratio": 0.96,
      "num_comments": 4,
      "flair": "Need Advice",
      "url": "https://i.redd.it/hbqumtnrpa0f1.jpeg",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1kklsfq/which_diploma_study_plan_to_choose/"
    },
    {
      "id": "1kk9xc0",
      "title": "i want to understand tensors, please help",
      "content": "hi guys I'm currently doing my masters in physics. so I'll give some background, due to some changes in the education policy in my country, our triple major degree was converted to a dual major and my majors were physics and chemistry.  so i did not have mathematics as a separate degree subject. however, before my MSc started, i studied some topics on my own and we also has mathematical methods of physics during the 1st sem of masters. i have a decent grasp on linear algebra, calculas and complex analysis. however, i recently started studying spin in detail. we had QM in first semester and I was kind of lost when we started angular momentum and spin. it's an extremely counter intuitive subject in general. last two days I've watched various videos on spin on YouTube, even read some papers, and although kind of similar at the base level , everyone explained it in different ways and i did get a fair idea but i have too many questions which I'm keeping on hold and I am finally trying to convince myself that in physics there are certain things i simply won't understand so i forced myself to start the math. then i realised I need to learn tensors, basics were done during 1st sem but i didn't understand it well and didn't get much time to revisit. how long will it take for me to understand tensors? and more importantly spin? my head has been spinning because of this. please give some guidance. also i need to balance subjects of this sem too, we don't have QM this sem but i don't want to lose touch because I want to do a second masters in particle physics after this one. ",
      "author": "Naive-Literature-780",
      "created_utc": 1746993753,
      "upvotes": 26,
      "upvote_ratio": 1.0,
      "num_comments": 16,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kk9xc0/i_want_to_understand_tensors_please_help/"
    },
    {
      "id": "1kk60lq",
      "title": "Screwed up hard: failed Multivariable Calculus, skipped Electromagnetism exam, now drowning in Optics. Need recovery advice.",
      "content": "Hey everyone,  \nI’m a first-year Applied Physics student and I really messed up in the third quartile. I had Multivariable Calculus and Electromagnetism. I didn’t attend lectures, procrastinated, and ended up failing calculus (got a 4) and didn’t even show up to the electromagnetism exam.\n\nNow I’m in the 4th quartile and taking **Optics**, which heavily builds on electromagnetism… and I’m completely lost. On top of that, I have to **resit both Multivariable Calculus and Electromagnetism** soon (6 weeks from now), while still trying to pass Optics.\n\nI feel overwhelmed because I’m missing foundational knowledge and everything’s piling up at once. I don’t want to fail again, as a matter of fact, I'm aiming for good grades now as I am now in a much better place than before. But I’m not sure how to approach this. Any advice on how to:\n\n* Catch up on electromagnetism fast enough to survive Optics\n* Juggle studying for 2 resits while learning new content\n* Build a plan or schedule that actually works\n\nWould really appreciate any input from students who've been in similar situations or have advice on how to recover from a stacked semester like this.\n\nOne of my strengths is efficiency as I can easily learn new topics in no time, but still, I need advice because if I had the solution I wouldn't be writing a post on this subreddit.",
      "author": "Lucky_Luck98",
      "created_utc": 1746983626,
      "upvotes": 33,
      "upvote_ratio": 0.88,
      "num_comments": 21,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kk60lq/screwed_up_hard_failed_multivariable_calculus/"
    },
    {
      "id": "1kk4nxy",
      "title": "[highschool physics] help me understand this",
      "content": "Ik like this is literally the first thing u learn in physics but Im dumb so help me. I understand the circuit is connected between two points A and B. But why is every point where the current splits also A?",
      "author": "Evening_Attorney9858",
      "created_utc": 1746980058,
      "upvotes": 19,
      "upvote_ratio": 0.91,
      "num_comments": 6,
      "flair": "HW Help",
      "url": "https://i.redd.it/sd2a74plg60f1.png",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1kk4nxy/highschool_physics_help_me_understand_this/"
    },
    {
      "id": "1kje1pp",
      "title": "Biggest Downgrade in History (and yet another questions on textbooks)",
      "content": "Does anyone know why they changed the cover for the third edition? The second edition was so much cooler!\n\nI am also once again asking for quantum book reccomendations (T_T) I picked up Sakurai at the reccomendation of my physics professor who told me a difficult but rigourous introduction would be the best to start off with, but I think I need something more accessible to help supplement it to see beyond this Ket-shaped forrest. I picked up Townsend's \"Fundementals\" but it's a too \"why are we doing this again\" and \"where did this come from\" for my taste (and it also doesn't really go into Bra-Ket notation). If the problem is stronger theoretical understanding of linear algebra, are there any book reccomendations for self study over the summer?\n\nSorry if this question has been asked to death, but I hope you can join me in thinking the second edition was so much cooler!",
      "author": "SeabassBranch",
      "created_utc": 1746894001,
      "upvotes": 169,
      "upvote_ratio": 1.0,
      "num_comments": 42,
      "flair": "Need Advice",
      "url": "https://i.redd.it/3hk84m7pbzze1.png",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1kje1pp/biggest_downgrade_in_history_and_yet_another/"
    },
    {
      "id": "1kjpdtk",
      "title": "What does coherent excitation mean?",
      "content": "When light interacts with an electron bound to an atom, does coherent excitation simply mean that the electron transitions from the lower to upper state exactly (frequency difference between energy levels matches the frequency of light) and that the electron is not interacting with anything else?",
      "author": "AbstractAlgebruh",
      "created_utc": 1746926351,
      "upvotes": 9,
      "upvote_ratio": 0.92,
      "num_comments": 4,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kjpdtk/what_does_coherent_excitation_mean/"
    },
    {
      "id": "1kjmf1f",
      "title": "How to develop conceptual foundation for EM?",
      "content": "I'm a fourth year (of five years) undergrad. I'm currently taking Electrodynamics for the third time as Ive found it so difficult I've had to withdraw the past two times because I was going to fail. (Not not a possibility this time either, unfortunately, if I can't turn things around.) I took the intermediate Electromagnetism course four years ago, and remember having difficulty with that course as well. \n\nThe issue is that my university uses Griffiths' textbook which is okay if you have the time to independently figure out how all of the many specific cases studied conceptually fit together into a cohesive theory/approach. Which I unfortunately do not and have not had the time to devote extra hours to this when I'm struggling to stay afloat with multiple weekly psets. As a result, I've ended up with a general conceptual idea but having to equation search for problem solving, weeding through all the different cases and their plethora of equations to find the one(s) applicable to this particular problem. Which, as we all know, is not only difficult but is not the purpose of problems and demonstrates a weak grasp on the concepts and materials. \n\nThe issue I have with Griffiths' textbook is that there's so much time devoted to special or specific cases that I can't find and thread together the foundational principles and problem solving approaches & techniques. I'm a person and learners who needs to know *why* and the overarching, foundational concepts & reasoning before diving into special or specific cases. Essentially, first understanding (concepts, laws, equations) then analysis (which law applies here?) and *then* application (using concepts/equations). That's practically the antithesis to Griffiths' textbook in my experience, since there is no dedicated section in each chapter (or, arguably besides part of chapter 7, any chapter) devoted to linking all the at-that-point learned concepts, derivations, situations and approaches together into a cohesive picture.\n\nDoes anyone have any resources that clearly explain the conceptual connections and reasonings universal to all of EM including electrodynamics and (as we're beginning this next week) special relativity?",
      "author": "iz_an_opossum",
      "created_utc": 1746916986,
      "upvotes": 11,
      "upvote_ratio": 1.0,
      "num_comments": 3,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kjmf1f/how_to_develop_conceptual_foundation_for_em/"
    },
    {
      "id": "1kji7tj",
      "title": "Should I major in physics?????",
      "content": "I am taking physics c mech without taking physics 1 and plan to take physics c e&m next year. I got a B first semester and I have an A right now because I started to enjoy it and locked in. I really enjoy doing physics but compared to other people I am not that good. I also average 75-85s on the tests. Any recommendations?",
      "author": "3stc3",
      "created_utc": 1746905264,
      "upvotes": 10,
      "upvote_ratio": 0.81,
      "num_comments": 7,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kji7tj/should_i_major_in_physics/"
    },
    {
      "id": "1kjdjuh",
      "title": "Am I right or is my prof right?",
      "content": "Hi all... Need some advice. I believe my prof incorrectly docked me points on an exam due to calculating his own problem incorrectly. See screenshot of the test. I'm an electrical engineering student, so I've already come across these concepts before. I assumed he added the dielectric constant as a red herring to throw us off, but when he corrected the exam, he marked me wrong for not including it. This didn't seem right so I referred to our notes from class, did some external research to double check, and wrote what I found on his PowerPoint slide that I printed off that proves me right, at least in my opinion. I wrote him as gentle of an email as possible with the attached image and explained my point of view in greater detail (keep in mind he and I have gotten along great all semester, we've shot the shit over mutual interests after class for ages multiple times etc) and didn't at any point demand my points back or even hint at it... But almost two days have gone by with no response. \n\nCan anyone verify which of us is correct, just so I can sleep at night until I see him next week for our final exam? \n\n",
      "author": "Nikonnate627",
      "created_utc": 1746892662,
      "upvotes": 19,
      "upvote_ratio": 1.0,
      "num_comments": 12,
      "flair": "Need Advice",
      "url": "https://www.reddit.com/gallery/1kjdjuh",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1kjdjuh/am_i_right_or_is_my_prof_right/"
    },
    {
      "id": "1kjewpx",
      "title": "Grad students of physics please give advice",
      "content": "So i ma final sem physics major and I'll be joining masters this year. I'll have a summer break of 1 and half months before I join the course. So what should I do to prepare for grad school learn more maths learn more physics read more research papers or learn more programming brush up my undergrad fundmemtals??? My interest lies in AMO physics and I'll probably try to do something related to it. \nPlease give advice so that I can prepare adequately and do not suffer during the course. ",
      "author": "Plastic-Ad2440",
      "created_utc": 1746896360,
      "upvotes": 8,
      "upvote_ratio": 1.0,
      "num_comments": 5,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kjewpx/grad_students_of_physics_please_give_advice/"
    },
    {
      "id": "1kisll3",
      "title": "I JUST PASSED THE PHD QUALIFYING EXAM!",
      "content": "Studying for that on top of all my other responsibilities was one of the most stressful things of my life. I think I’ll celebrate with a beer and watching Lord of the Rings.\nThat is all, thank you for indulging me.",
      "author": "ihateagriculture",
      "created_utc": 1746822870,
      "upvotes": 225,
      "upvote_ratio": 1.0,
      "num_comments": 23,
      "flair": "Rant/Vent",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kisll3/i_just_passed_the_phd_qualifying_exam/"
    },
    {
      "id": "1kizg80",
      "title": "How did you know you wanted to study Physics?",
      "content": "I'm currently in high school and my two career choices are physics or mathematics, I have background in math since I participated in Olympiads and I really liked it but the university in my state has math (which programm I don't like) and it has physics (I got a lot of friends that studied there and they said it's good). \n\nI like physics, but I feel more comfortable and passionate in math things, why did you choose physics over maths? what do you suggest for me?",
      "author": "henrisito12Rabitt",
      "created_utc": 1746842849,
      "upvotes": 64,
      "upvote_ratio": 0.98,
      "num_comments": 37,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kizg80/how_did_you_know_you_wanted_to_study_physics/"
    },
    {
      "id": "1kjcgoy",
      "title": "Looking to do a phd in laser/fusion physics in Australia - advice ?",
      "content": "Hey everyone! I'm currently doing my master's in Germany and planning to apply for a PhD in Australia next year. I’m interested in fields like laser-matter interaction, fusion plasma, or shock compression — basically anything involving high-energy-density physics.\n\nI have a background in intense laser-matter interaction, dense plasmas, advanced quantum theory and laser physics. My degree is 50% research-based, so I'm already doing hands-on lab work and simulations.\n\nWhen I was looking at some Australian universities, I noticed that they mention PhD tuition fees — which confused me a bit, because here in Germany, we actually get paid during a PhD. 😅\n\nSo I wanted to ask:\n\nDo PhD students in Australia usually pay fees?\n\nOr are there fully funded positions/scholarships (like RTP)?\n\nIf you're doing a PhD in physics there, what’s your experience been like?\n\nWould really appreciate any advice or info — especially from people working in laser/plasma/ICF areas. Thanks a lot in advance! 🙏",
      "author": "Never-Shower123",
      "created_utc": 1746889720,
      "upvotes": 5,
      "upvote_ratio": 0.86,
      "num_comments": 2,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kjcgoy/looking_to_do_a_phd_in_laserfusion_physics_in/"
    },
    {
      "id": "1kj24re",
      "title": "I need physics friends in Houston because im going kind of crazy",
      "content": "So, i went to school for physics in colorado but i had to move to houston right before i graduated and i dont know ANYONE here. Its been a few years and between working my ass off trying to get back to a place i can go to school again and absolutely obsessing over some crackpot theories of mine about waves, energy, and dimensionality, i really need some physics friends . Or just science based people, cuz im stuck working marketing at a bar rn and i havent met another person who knows the word eigenstate, in years. Im sorry if this doesnt belong, i just really would like some friends. Bonus points if you make or play music! I love making music i play bass and i sing and i release music on everywhere you can listen, but this isnt an ad or anything i just wanna find some peeps to jam with maybe and also shoot the shit with.\n",
      "author": "mrmonkeyfrommars",
      "created_utc": 1746852124,
      "upvotes": 20,
      "upvote_ratio": 0.96,
      "num_comments": 7,
      "flair": "Off Topic",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kj24re/i_need_physics_friends_in_houston_because_im/"
    },
    {
      "id": "1kj4pg2",
      "title": "Figuring out what to do for my PhD",
      "content": "Throwaway because I don’t want my friends prodding me about this right now. TLDR at the end. Hopefully this is the right place to post this :)\n\nBit of background, I did my BSc in honours biophysics at a top 40 university (not USA), with a touch of astronomy thrown in. I’m wrapping up my MSc in physics at the same university over the next year, with my thesis research focusing on a pretty niche medical physics topic. \n\nI’m starting to think about PhD applications, as I do want to go to a different institution for it, but I’m honestly a bit lost on what exactly I want to study. I know I love the process of research, that I love the pursuit of knowledge. I joke sometimes that I would be happy if there was a career that involved taking every course my university offers! I have a very, very wide range of interests, and a lot of hobbies, but that’s been making it tricky to pick a specific subfield to focus on.\n\nSome of the issue does come from feeling like there’s a disconnect between what physics has looked like in coursework vs what a career as a physicist actually entails. I loved the theory-focused work, but it’s not like learning theory from a textbook is the same as what a theoretical physicist does in their day to day work. For example, I enjoy the theory behind particle physics, but the idea of sifting through massive sets of data and being a tiny cog in a massive machine with experiments that take years to reach completion? Not my cup of tea.\n\nAll of that being said, I’d love some advice on what might suit me best / which subfields I should look into. Relevant pieces of information: I enjoy teaching at a post-secondary level and having flexibility in my schedule, so academia would be a nice place to end up, but I’m not opposed to industry either, as I’m aware the rat race for tenure is… really something to behold. My favourite course I ever took was an organic chemistry lab because I adored the hands-on work, so if anyone has pointers about interdisciplinary chemical physics fields, I’d probably enjoy that. I do not enjoy working on massive collaborations (e.g. something like ATLAS), largely due to feeling like I lose touch with the bigger picture, so I prefer to work on experiments that have shorter time scales and a more tangible extent of membership.\n\nFunnily enough, growing up math was my favourite subject by far, and I mostly went into physics because I liked astronomy and I was really good with numbers and pattern recognition. Sometimes I wonder if I would’ve been happier doing pure math, but I absolutely do not want to end up in finance, and I don’t think I’m a high enough calibre student to make a career out of mathematics in academia. Besides, I imagine I’d need to go back and do another BSc in order to actually have all the knowledge needed for graduate studies in math. \n\nAlrighty, I am done rambling now, apologies for the length! And yes, I’m aware one should not do grad school for the sake of doing grad school, but I’m not doing it just to get the fancy label. I do genuinely love research and have been thriving in my masters so far. My only issue is I have too many interests and not enough knowledge about what careers in these subfields actually entail on a day to day basis. \n\nTLDR: I’m trying to pick a subfield to focus on for my PhD, but I have a wide variety of interests and want to learn more about the options out there. I care about having a small-ish lab size, a non-zero amount of hands-on work, and would like to eventually end up in a position with flexible scheduling. I do not want to end up in finance, despite being one of those stereotypical “math is my favourite subject” people, and would prefer to avoid selling my soul (so no working for companies that are actively destroying the planet). Ideas I’ve come up with include geophysics, chemical physics, and mathematical physics (although I’m not sure how to get any hands-on work in there). Optics may be an option too, but I never took any courses on the subject so I’m not too familiar with it.",
      "author": "Ok_Sky_7689",
      "created_utc": 1746862368,
      "upvotes": 7,
      "upvote_ratio": 0.82,
      "num_comments": 4,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kj4pg2/figuring_out_what_to_do_for_my_phd/"
    },
    {
      "id": "1kj2z4z",
      "title": "Physics Grad School in Germany",
      "content": "I'm considering moving back to Germany for nuclear physics grad school after completing my physics BS in the US. Has anyone had experience with physics grad school in Germany? What is funding like? What is the application process like? \n\nNote that I graduated from a German high and am fluent so language proficiency should not be an issue although I am a bit rusty.",
      "author": "samthehyena",
      "created_utc": 1746855328,
      "upvotes": 9,
      "upvote_ratio": 0.92,
      "num_comments": 0,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kj2z4z/physics_grad_school_in_germany/"
    },
    {
      "id": "1kiztmq",
      "title": "Prospective Physics Major - What can I do to stand out?",
      "content": "Hello everyone! I am a sophomore in high school looking to become a physics major. I have been interested in physics since middle school and am currently doing everything I can in order to build up my college applications. However, I feel like I am not doing enough. What things can I do to make myself stand out? I would be happy to drop a resume of my math and physics accomplishments and extracurriculars if it is needed. Also, how competitive is a physics major? My dream school is MIT and I want to do everything I can to get in. How competitive is MIT's physics program to get into, and how competitive is it at other top schools, such as Stanford, Caltech, UChicago, Berkeley, and others? Thank you so much for your help!",
      "author": "Acceptable_Care_929",
      "created_utc": 1746844086,
      "upvotes": 11,
      "upvote_ratio": 1.0,
      "num_comments": 6,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kiztmq/prospective_physics_major_what_can_i_do_to_stand/"
    },
    {
      "id": "1kij9r7",
      "title": "Why is there so many Fish problems",
      "content": "these are real questions I had on my exam lmao",
      "author": "cometsunderneath",
      "created_utc": 1746799376,
      "upvotes": 50,
      "upvote_ratio": 0.98,
      "num_comments": 6,
      "flair": "Meme",
      "url": "https://www.reddit.com/gallery/1kij9r7",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1kij9r7/why_is_there_so_many_fish_problems/"
    },
    {
      "id": "1kink1z",
      "title": "Getting into Grad Programs with No Research Experience?",
      "content": "Hey all!\n\nI'm writing this in the midst of what some might call a quarter-life crisis. To make it short, I regret entering the professional world (as a data analyst) and now desire to pursue a PhD in physics (lofty, I know).\n\nI possess a BS Physics with a near-perfect GPA + minors in Math and Data Science. I also have a perfect physics GRE score (I took it back when I wasn't sure whether or not grad school was for me). The issue lies in the fact that I have no meaningful research experience. My summers were spent on other (data-related, mostly) endeavors.\n\nWhat's the best way to patch this hole in my resume? I'm thinking getting a masters may be good (to gain research experience prior to applying to PhD programs), but might it also be worth it to cut to the chase and apply to PhD regardless? Do you think it might meaningfully help my case to contact professors in programs that seem interesting explaining my circumstances? Any input is helpful.",
      "author": "theDrasian",
      "created_utc": 1746810083,
      "upvotes": 17,
      "upvote_ratio": 0.91,
      "num_comments": 4,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kink1z/getting_into_grad_programs_with_no_research/"
    },
    {
      "id": "1kikw2r",
      "title": "Finals Went Poorly, Extremely Concerned About Grad School",
      "content": "Hi all. Finals season just came and went for me and I doubt I did very well. I'm a Junior with \\~1.5 years of research experience, but my academic record could be stronger (3.4 GPA, probably lower now). I'm really concerned about getting into grad school next year, especially the programs I'm interested in. Has anyone been in a similar situation, what did you do?",
      "author": "SonarCreature",
      "created_utc": 1746803490,
      "upvotes": 24,
      "upvote_ratio": 0.97,
      "num_comments": 14,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kikw2r/finals_went_poorly_extremely_concerned_about_grad/"
    },
    {
      "id": "1khzg71",
      "title": "Why is Physics Both Fascinating and Tough",
      "content": "I’m conflicted by physics: on one hand, it’s absolutely fascinating seeing how we can both visualize our surroundings and mathematically understand it BUT on the other, I want to cry from how challenging this is. (I’m envious of business majors). \n\nDon’t get me wrong, understanding this material is rewarding but my god, mein GOTT, it is brutal. ",
      "author": "Consistent31",
      "created_utc": 1746733901,
      "upvotes": 81,
      "upvote_ratio": 0.95,
      "num_comments": 18,
      "flair": "Rant/Vent",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1khzg71/why_is_physics_both_fascinating_and_tough/"
    },
    {
      "id": "1khsd1x",
      "title": "I am failing my Bachelor's in Physics",
      "content": "I am 20 and studying in one of the topmost colleges in my country, currently in my final year.\n\nThroughout the lockdown years I faced really bad abuse and shit(within my family so ofc no escape) and some abuse before that as well. I live in a pretty dysfunctional family too.\nRight before college I lost my ability to imagine any future (and also my will to live, pretty much the same now) and didn't put much thought into choosing this degree. I was a \"brilliant\" student throughout school, but in college I completely lost the ability to focus and concentrate. Being extremely fearful of authority figures, sometimes cut class due to feeling anxious from professors.\n\nCollege being 1.5hrs of commute from home, I didn't get any hostel facility and didn't opt for any other stay options, so I still face many things at home, first hand.\n\nAmidst all this, I couldn't focus at all, and am now failing college.  ",
      "author": "faultyRocket04",
      "created_utc": 1746716696,
      "upvotes": 67,
      "upvote_ratio": 0.97,
      "num_comments": 4,
      "flair": "Rant/Vent",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1khsd1x/i_am_failing_my_bachelors_in_physics/"
    },
    {
      "id": "1ki0bx5",
      "title": "[Physics force and tension] Checking my answer.",
      "content": "Here's the question and my answer I would appreciate it if you checked it please. I have a feeling calculating the vertical components is wrong.",
      "author": "TRECT0",
      "created_utc": 1746736059,
      "upvotes": 8,
      "upvote_ratio": 0.91,
      "num_comments": 3,
      "flair": "HW Help",
      "url": "https://www.reddit.com/gallery/1ki0bx5",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1ki0bx5/physics_force_and_tension_checking_my_answer/"
    },
    {
      "id": "1ki00i8",
      "title": "Does length of time to get BS affect grad school acceptance?",
      "content": "I’m a non traditional student so I had to retake basic algebra so it has taken me 3 years to graduate community college. \n\nI’m going to university but due to going to CC I don’t have research experience and getting into a research program and hitting the ground running quickly junior year isn’t likely. \n\nAnother thing is not all my credits are transferring perfectly so even if I want to do it in 2 years the amount of classes I’d have to take will leave no time for research anyway and will likely hurt my GPA. \n\nIf it takes me 6 years to get my BS will that be an issue when applying to grad schools even if by taking the extra time I’m able to get 2 solid years of research experience?",
      "author": "Pixiwish",
      "created_utc": 1746735276,
      "upvotes": 9,
      "upvote_ratio": 1.0,
      "num_comments": 3,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1ki00i8/does_length_of_time_to_get_bs_affect_grad_school/"
    },
    {
      "id": "1khihyh",
      "title": "Job prospects after physics major vs computer science major?",
      "content": "I remember seeing somewhere that although actual physics jobs are pretty well out of reach, physics majors are often sought after for certain jobs where they just want to find people wwhao have proven they are smart, like finance. If I graduate a bachelor in physics, perhaps even physics + math, will I have guaranteed jobs lined up after graduation, even if I have no work experience?\n\nThings are so bad for computer science majors, I just can't do it. Finishing my third year with no work experience in sight, its so over if I don't start another major\n\nI tried the second half of first year physics this semester. I was so excited for this class. I was pre-reading lecture notes on the bus, doing the practice questions and assignment questions immediately after class, I really thought I was doing everything right. I took the first half of first year  physics last year (fall 2023)  and got a B, but I developed a great interest in physics and wanted to try the second half. So I went into the first lab thinking I was as prepared as anything. I nearly ran out of time in many of the labs for first half of physics in 2023, so I was a little nervous, but I thought I was prepared due to how much I felt I had mastered the concepts taught in class. But time went by so fast and soon 40 minutes of the lab were left, so I walked out of the lab and dropped the class. I don't get it! In that same semester I got an A+ in Calculus 2, so I know I am good at math. I just couldn't handle doing all that physics lab math under pressure. I have some issues meaning that asking for help in labs takes great courage for me, so I would try to asak TAs for help/to check my work as little as possible. I combination of my lack of ability to do mathw fast under pressure and nervousness about asking for help led to me not pursuing a minor in physics. Will I succeed at a major?",
      "author": "The_Laniakean",
      "created_utc": 1746682108,
      "upvotes": 16,
      "upvote_ratio": 0.9,
      "num_comments": 4,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1khihyh/job_prospects_after_physics_major_vs_computer/"
    },
    {
      "id": "1khak63",
      "title": "How do I know if I’m good at Physics?",
      "content": "I know you guys get a lot of these, but I'd be glad if I got some advice.\n\nI'm an 8th-grader, and as high school approaches, we're forced to pick our electives by tomorrow. My dream job is to become an inventor -- not because I'm good at inventing things or have experience, I just want to contribute to the world. I've heard that being an inventor or enrolling into universities in UK requires Physics, Computer Science, and Further Maths. I'm definitely not taking Further Maths because I'm terrifyingly terrible at Maths, but Physics? I could barely understand a word the teacher says in class (we're learning electric currents) and I don't know how to study Physics. My friends didn't understand either, but they're not planning to take Physics as they're not pursuing a job related to it. I know some geniuses in my class probably understood at first attempt, though. \n\nAfter doing some electric current research, somehow, I did decent on the test (I believe everyone got similar marks as the test was pretty easy). Still, I can't tell if I should pick Physics or not, given that I'm bad at Maths (I could use some practise?) and people claim that Physics has a lot of Maths. If being an inventor/computer scientist doesn't require Physics, I probably wouldn't take it. However, it highly correlated to the field I wish to work in, and I don't want to lose the chance to become an inventor if I didn't pick Physics and I'm not allowed to study Computer Science in university. \n\nOne extra factor to consider is how our school limits is to picking either Physics or English Literature (my favourite subject). I would've chosen English Literature if only I didn't suck at it. As a student who's generally above average in English, I get the lowest grades in class. This is not an exaggeration.\n\nHow much does Physics affect my career? Should I still pick it even if I'm bad at Maths? If yes, how do I polish my Physics / Maths skills?",
      "author": "sunocherie",
      "created_utc": 1746656991,
      "upvotes": 28,
      "upvote_ratio": 0.92,
      "num_comments": 11,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1khak63/how_do_i_know_if_im_good_at_physics/"
    },
    {
      "id": "1kgyevg",
      "title": "Giving my all, yet it never seems enough.",
      "content": "\nHi everyone,\n\nI’m a university student majoring in physics. I have this friend who’s really smart and kind of a genius. We took Calculus II and Physics II together. He always gets everything right away during lectures and even answers the professor’s questions on the spot. Most of us often go to him when we don’t understand something, and he explains it super well.\n\nHe pretty much gets perfect scores on all exams — midterms and finals — and only lost points once because of a mistake in the question itself. \n\nIn Physics II, there was a super hard question on the exam, and he was literally the only one who solved it.\n\nMeanwhile, I work so much harder than him, but I still make silly mistakes. I asked him for advice, and honestly, I already do most of what he suggested. Still, I just can’t seem to reach his level.\n\nFor context — I’m not jealous or bitter. I genuinely like learning and improving myself, and I’m always eager to take his advice.\n\nBut lately, I’m starting to worry that my struggles are because of my own issues. I was born prematurely (8 months) and diagnosed with ADHD and Dyspraxia.\n\nI’m starting to lose hope. No matter how hard I try, I keep making tons of mistakes, and I take forever to fully understand topics. It’s exhausting to put so much effort in and still not see results like my friend does.\n\nHas anyone else been through something similar? How do you deal with this kind of frustration and stay motivated?\n\n to be clear, I’m not jealous — I honestly just \n want to improve, maybe I’m not explaining it well.\n",
      "author": "FHDs23",
      "created_utc": 1746627276,
      "upvotes": 51,
      "upvote_ratio": 0.98,
      "num_comments": 8,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kgyevg/giving_my_all_yet_it_never_seems_enough/"
    },
    {
      "id": "1kgx942",
      "title": "What level of mathematics do i need to know in order to solve physics olympiad problems ?",
      "content": "what i know -\n\nalgebra (polynomials , quadratic eqns , matrices , determinants , combinatorics)\n\ntrigonometry\n\nvectors \n\ncoordinate geometry (2 dimensional as well as 3 dimensional)\n\ncalculus (limits , derivatives , monotonicity ,maxima-minima , def + indef integration) (only single variable)\n\n  \nbut sometimes i come across problems like these in which higher mathematics is used \n\n[from Kevin Zhou's handouts \\(Elec-1\\)](https://preview.redd.it/f91o1m682dze1.png?width=636&format=png&auto=webp&s=c907c6694db3dc4ed945b2454dd6e7d1938dac83)\n\nso can someone please tell me how much more mathematics i need to know for physics olympiad problems ? ",
      "author": "TrickyRegret400",
      "created_utc": 1746624213,
      "upvotes": 25,
      "upvote_ratio": 1.0,
      "num_comments": 14,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kgx942/what_level_of_mathematics_do_i_need_to_know_in/"
    },
    {
      "id": "1kgwg0g",
      "title": "Industry prospects in Nuclear physics?",
      "content": "Hello, I am a physics second year undergrad at a T5 university, however I do not want to pursue academia but I definitely want to pursue a phd. I am not the smartest physics student out there (<3.5 GPA) so I wrote off any sort of theoretical work I’d like to do and found that I’m happy as an experimentalist. I’ve worked at a lab at my university and at a fusion lab at Oxford. I think I’m really beginning to settle into this energy industry niche. \n\nMy question is, are there really industry jobs in things like nuclear energy? Most of the companies seem to be small, non reputable startups. \n\nI have explored  found other firms like energy consulting and project managing but most of those positions are open to engineers. Should I apply for an engineering phd program? How hard is that as I have taken no engineering courses?",
      "author": "Spiritual_Dot3250",
      "created_utc": 1746621907,
      "upvotes": 14,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kgwg0g/industry_prospects_in_nuclear_physics/"
    },
    {
      "id": "1kg9grl",
      "title": "Worried about my chance of getting into grad school after college due to low gpa, no research experience",
      "content": "I’m a sophomore right now about to finish the year with a 3.35 gpa. My goal is to get into a medical physics masters program, but I’m really worried about my chances after the past two years. I’ve tried really hard to find research as well, and found it to be very competitive. What can I do to maximize my chances of getting into grad school after college. I’m already working on getting my gpa up. I don’t know what I will do if I can’t get into a grad school.",
      "author": "Free_Distance5835",
      "created_utc": 1746550387,
      "upvotes": 23,
      "upvote_ratio": 0.96,
      "num_comments": 8,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kg9grl/worried_about_my_chance_of_getting_into_grad/"
    },
    {
      "id": "1kg6ho5",
      "title": "[magnetism] find the magnetic field at focus of the parabolic wire",
      "content": "Where did i go wrong? Cant find out\n(Actual answer is in the third photo)\nI've showed my attempt in the second photo. ",
      "author": "MattMurdock07",
      "created_utc": 1746543231,
      "upvotes": 9,
      "upvote_ratio": 0.92,
      "num_comments": 11,
      "flair": "HW Help",
      "url": "https://www.reddit.com/gallery/1kg6ho5",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1kg6ho5/magnetism_find_the_magnetic_field_at_focus_of_the/"
    },
    {
      "id": "1kfyi5v",
      "title": "Majoring in physics, worth it?",
      "content": "Is majoring in physics or nuclear physics worth it? Are there jobs? Are the salaries good? Are there courses that I can take to strengthen my CV if I get into it?",
      "author": "icetwist-",
      "created_utc": 1746515983,
      "upvotes": 37,
      "upvote_ratio": 0.9,
      "num_comments": 28,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kfyi5v/majoring_in_physics_worth_it/"
    },
    {
      "id": "1kfxsat",
      "title": "Math Path to General Relativity",
      "content": "Hello all! Just a bit curious:\n\nI’m super interested in general relativity, and I know that one has to be very antiquated with differential geometry and tensors for it. My question is: what is the path I should take leading up to these concepts? I tried to learn DG last Summer, but my skills were not up to the book’s standards. What line of classes / topics should I study (in math) so I can eventually learn GR?\n\nFor reference, I’m going to take PDEs and linear algebra soon.\n\nThanks!",
      "author": "Pilk-Drinker",
      "created_utc": 1746512883,
      "upvotes": 31,
      "upvote_ratio": 1.0,
      "num_comments": 8,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kfxsat/math_path_to_general_relativity/"
    },
    {
      "id": "1kfwpce",
      "title": "Preparing for an MSc in Physics",
      "content": "So, I am a 4th year undergraduate student in Computer Science & Engineering, and I cleared a few exams for Master's admission to Physics in my country. I am getting a few decent colleges, and plan to start MSc this August. Now, I have self studied undergraduate physics, but there are a few gaps I'd like to fix before starting my MSc. Seeing as I have 2-3 months left, which skills should I pick up on, keeping in mind, that I ultimately intend to do a PhD in US/Europe? I wish to build a really strong profile. Also, anything in particular that I could look at which would make my transition to MSc easier?",
      "author": "Acrobatic_Badger_843",
      "created_utc": 1746508440,
      "upvotes": 16,
      "upvote_ratio": 1.0,
      "num_comments": 4,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kfwpce/preparing_for_an_msc_in_physics/"
    },
    {
      "id": "1kfx84o",
      "title": "Which String Theory book is easier, Becker Becker Schwarz or Polchinski.",
      "content": "I'm going to be taking graduate String theory next semester as an undergrad. I know Polchinski is the more complete resource. But I'm just looking to have a functional understanding of the subject before the class starts. I will be using Zweibach as a supplement and one of those two textbooks as the main source.",
      "author": "FineCarpa",
      "created_utc": 1746510561,
      "upvotes": 10,
      "upvote_ratio": 0.92,
      "num_comments": 1,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kfx84o/which_string_theory_book_is_easier_becker_becker/"
    },
    {
      "id": "1kfxlkt",
      "title": "Suggestions for good pedagogic textbooks on gravitational waves",
      "content": "I am a physics student set to start on my MSc degree in September 2025. I will be going into the field of gravitational wave physics and I was hoping to get some suggested textbook material to prepare me for the same.\n\nI have a good understanding of general relativity and I am looking for a textbook solely focusing on gravitational waves. I know many would suggest Maggiore's textbooks but when I tried reading them I found it to be quite terse.\n\nI do not mind the math (in fact I prefer mathematical details) but after a few pages I lose track of where the author is going. It all seems like a big \"thought vomit\". I have realized that I tend to grasp textbooks that are written in a more pedagogic tone.\n\nWould anyone have any alternate suggestions for a good gravitational wave textbooks? If not, how can I more effectively use the Maggiore textbooks? Any help would be appreciated.",
      "author": "Artemis_Skrull",
      "created_utc": 1746512097,
      "upvotes": 5,
      "upvote_ratio": 1.0,
      "num_comments": 2,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kfxlkt/suggestions_for_good_pedagogic_textbooks_on/"
    },
    {
      "id": "1kfi9dz",
      "title": "Is presenting research at conferences worth it ?",
      "content": "For context, I’m a current BS student in physics, and I’m doing research in ML at my uni. I plan to go into industry in the future. I’ve never presented at a conference before, but since I’m not pursuing academia, is it actually beneficial to present my research at a conference ? Does it add anything to my career prospects ? Anyone have experiences presenting research at conferences ?",
      "author": "[deleted]",
      "created_utc": 1746467960,
      "upvotes": 20,
      "upvote_ratio": 1.0,
      "num_comments": 5,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kfi9dz/is_presenting_research_at_conferences_worth_it/"
    },
    {
      "id": "1kfgxsn",
      "title": "Questions about taking Relativity as a maths student",
      "content": "Hi everyone,\n\nI’m a maths student going into my third year at university, and I’m trying to decide which modules to take. One of the options is Relativity, and I’m really on the fence about it so I’d love to hear from people who’ve studied it or work in related areas. I’ve taken classical and quantum mechanics and electromagnetism before.\n\nA few questions I have:\n\t\n•\tHow similar is relativity (special and/or general) to classical mechanics? Does it build on similar intuition or is it a very different way of thinking?\n\n•\tHow difficult is relativity compared to other areas of physics? (e.g. electromagnetism, quantum mechanics, fluid dynamics?)\n\n•\tIf you’ve studied relativity, did you find it interesting or rewarding? Would you recommend it?\n\n•\tWhat kind of mathematical tools does it rely on? \n\nI’m mainly interested in learning cool concepts, but I don’t want to bite off something unmanageable or too disconnected from my skills.\n\nAny insights or advice would be appreciated.\n\nThanks in advance.",
      "author": "YouTube-FXGamer17",
      "created_utc": 1746464850,
      "upvotes": 19,
      "upvote_ratio": 0.96,
      "num_comments": 9,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kfgxsn/questions_about_taking_relativity_as_a_maths/"
    },
    {
      "id": "1kf6cab",
      "title": "Just can't seem to feel like I'm smart/experienced enough",
      "content": "Hey everyone, I'm sure you get these types of posts all the time, but I really just need to get this out somewhere because I feel like I have nobody else to talk to about this.\n\nSo for some background, I'm a physics major (specifically in astronomy/astrophysics) just finishing up my first year and heading into the summer. I was extremely lucky to have received a scholarship that includes a summer research position, and I will be working alongside one of the professors at my school on some astrophysics research. He has been extremely nice, and sent many resources so that I could be as prepared as possible for when I start working (tuesday).\n\nI have been trying to get through one of the textbooks he sent, but I feel like nothing makes sense. I'm reading, but I don't exactly feel like I'm *learning* anything that would make me valuable. There are so many variables, calculations, and approximations that almost feel like come out of thin air, I feel like while I am making progress, it's so slow it almost isn't even worth it. He told me to ask him questions on anything I don't understand, but I don't even know where to start. Overall, I just feel like I don't know enough to feel useful at all. Sorry if my post is a little nonsensical, It's 4am over here and I'm stressing because I can't understand what I'm doing..",
      "author": "tonalli_",
      "created_utc": 1746432800,
      "upvotes": 36,
      "upvote_ratio": 0.97,
      "num_comments": 9,
      "flair": "Rant/Vent",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kf6cab/just_cant_seem_to_feel_like_im_smartexperienced/"
    },
    {
      "id": "1kf2vr6",
      "title": "Physics pivot into electrical engineering",
      "content": "Hi finishing my first year as a physics major BA. I was wondering about the possibility of pivoting into electrical engineering BSE. Obviously a lot more intensive but i feel like the content learned is so kuch more vaible for for industry applications. Like i feel like if anything i am getting better physics intuition in EE classes such as “quantum circuits and systems” + “quantum engineering” rather than say intro to quantum mechanics I+ II. I love physics so much but i want to be able to reap deliverables and not just be able to make a chalkboard look pretty. Sorry to be crass ( and maybe ignorant?) but im open to being convinced into staying in physics. Just playing devil’s advocate and weighing options. \n\nDid any of you physics majors avoid or embrace a pivot into engineering? And how did it go? Any advice is welcomed!!!!",
      "author": "Frequent-Suit551",
      "created_utc": 1746418497,
      "upvotes": 19,
      "upvote_ratio": 0.96,
      "num_comments": 15,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kf2vr6/physics_pivot_into_electrical_engineering/"
    },
    {
      "id": "1keoedu",
      "title": "Dropped out and made an app instead!!",
      "content": "Hey guys, I was studying my MSc but then decided to take a bit of a risky and went down a more of a computer sciencey route instead, and made this app!\n\nDef not encouraging anyone else to do the same, but would just say, do what you love! If you're interested about the app too, I made this [demo](https://www.youtube.com/watch?v=ehGolVAHm8U) that explains it more and here's the [App Store](https://apps.apple.com/gb/app/showcase-co/id6740991352?platform=iphone) link! Do feel free to ask me any questions!",
      "author": "theWinterEstate",
      "created_utc": 1746377402,
      "upvotes": 29,
      "upvote_ratio": 0.57,
      "num_comments": 33,
      "flair": "Off Topic",
      "url": "https://v.redd.it/w7mopc96osye1",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1keoedu/dropped_out_and_made_an_app_instead/"
    },
    {
      "id": "1kemapr",
      "title": "Explore Physics beyond academics.",
      "content": "Hello! I don't know if this is the right place to ask, but lately I have been feeling the urge to further my knowledge in physics and mathematics beyond what I studied in high school. Later, I took up computer science as my major in college, and I have lost touch with core physics. I want to start exploring and studying more. Most of the resources I find are either for academic purposes or are bound to certain topics. How can I go beyond this? Are there any communities I can look for? Since I'm not doing this for academics, I don't have the pressure to succeed on exams; I can explore advanced topics. How can I get started?",
      "author": "Conscious_Package_69",
      "created_utc": 1746372034,
      "upvotes": 32,
      "upvote_ratio": 0.92,
      "num_comments": 12,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kemapr/explore_physics_beyond_academics/"
    },
    {
      "id": "1kekxny",
      "title": "Need advice about research project",
      "content": "Im a first year physics student. And im expecting doing a summer project (although its not really limited to any time of year) in one of my professors group.(part of LIGO) He basically told me that theory is probably a little bit over my head (but he still open for ideas). And so he told me i can go into programming/observational based projects.\n\nI compiled a list of 10 ideas i find interesting. I would love to hear some ideas and input into them if you are familiar with some of them.\n\n1.quantify how well GW measurements can constrain various cosmological parameters.\n\n2.search how primordial BH using LIGO data.\n\n3.simulate inspirals and merges of compact objects.\n\n4.simulate GL from SMBH, and how the surrounding curvature of spacetime distorts the image.\n\n5.use weak GL to simulate mapping of dark matter.\n\n6.build a simple model of a stellar spectrum based on blackbody radiation.\n\n7.simulate or analyze how an exoplanet atmosphere absorbs certain wavelengths.\n\n8.longterm stability of exoplanet orbits, and what configuration will be stable/chaotic.\n\n9. Simulate a globular cluster or dwarf galaxy, core collapse or tidal stripping.\n\n10. Spiral arm formation from disk instability. How galactic disk form arms.\n\nAlso if you have other ideas i would like to hear :)",
      "author": "itiswensday",
      "created_utc": 1746368459,
      "upvotes": 7,
      "upvote_ratio": 1.0,
      "num_comments": 4,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kekxny/need_advice_about_research_project/"
    },
    {
      "id": "1kehkju",
      "title": "[ELECTROSTATICS] Electric Field Lines",
      "content": "This picture (#1) is from a question based on electric field lines, there is an uniform electric field, which means there is an infinitely long plane. We see a distortion in two electric field lines at point B due to two postive charges being placed. From what I know about electric field lines, electric field lines are curves whose tangent at any point is the vector resultant of all electric fields acting at that point.\n\nIn #2,I've drawn first electric field line (the topmost one), the positive charge (that causes the distortion) is placed on the central line. I've drawn the vectors with blue and resultant with red.\n\nThe positive charge exerts a field radially outward. At the central line, the field exerted by the positive charge should be along the central line (the postive charge is placed on the central line) but is not because if it were, the distorted curve wouldn't be formed and the charge should continue on the central line and  it would eventually meet the postive charge which isn't possible, so I'm missing something because to turn the particle down a curved path, we'd need a field in a direction other than along or away from the central line. My main question being how does the test charge go from moving in a straight line to going along a curved path (because electric field lines also, show the path of a positive test charge) because the positive charge is only exerting a field along the central line at the central line and the field due the plane is also along the central line.\n\nI feel so lost, I've spent the entire morning thinking about this. Please help me out\n\n[#2](https://preview.redd.it/ysnthhq78rye1.jpg?width=3564&format=pjpg&auto=webp&s=a0c8a0a73afcf5c1994e3c0b0a0f2b75b6485e1e)\n\n[#1](https://preview.redd.it/4sqj6fq78rye1.jpg?width=1032&format=pjpg&auto=webp&s=4149f619f330c785e124f747a64d3058679a6a7f)\n\n",
      "author": "mritsz",
      "created_utc": 1746357883,
      "upvotes": 6,
      "upvote_ratio": 1.0,
      "num_comments": 4,
      "flair": "HW Help",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kehkju/electrostatics_electric_field_lines/"
    },
    {
      "id": "1kdnaqa",
      "title": "I don't feel like I am made for this field...",
      "content": "I understand that this is a common feeling. But I really don't know what choice to make, or if there even is one. To get good advice I'll try to be precise.\n\n1. [Academic Context] I am a third year undergrad, BS in Physics from India. I'll be in my fourth year next semester. My current CGPA is a 6.2/10 at the Indian Institute of Technology Kanpur, QS ranked 263. I don't have any research ex as of now, but I will be doing a project this summer which might net me an LOR. \n\n\n2. [Personal Context] My excuse for poor grades is that I'd been depressed for most of my time here (and before that too). I got myself diagnosed clinically at the end of my second year. My parents had a bad marriage, my dad was verbally abusive and had a short temper. With the antidepressants I was on, I had my worst semester to date with a 4.5/10 and failing 12/61 of my credits. In the winter after the semester, my father died unexpectedly. Things were awful enough to change to different antidepressants. These seem to work better now, and I feel mostly decent about my output this semester, though no stellar comebacks.\n\n\n3. [Physics] The only time in these 3 or 4 years I've felt happy, is when I was studying Physics, attending colloquiums or talks, and some lectures from brilliant lecturers. I'm interested in Topological Phases of matter, and broader condensed matter too. I would like to work at the interface of CS, Math and Physics in the field of Quantum Computing.  But I understand that theoretical positions for this field are scarce and hugely competitive.  \n\n\n\n4. [How I feel about things] The situation sucks. I don't feel like I'm smart enough for this. Even with the new meds, while I can focus much better, I can't compete with other students.  \n\nI don't know what kind of advice I'm expecting honestly. If I knew what to ask for maybe I'd have it already. Thank you.\n\nTLDR: 6.2/10. CGPA from India. Am I cooked in terms of getting into gradschool?",
      "author": "DVnyT",
      "created_utc": 1746257204,
      "upvotes": 28,
      "upvote_ratio": 0.98,
      "num_comments": 7,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kdnaqa/i_dont_feel_like_i_am_made_for_this_field/"
    },
    {
      "id": "1kd4w0u",
      "title": "Trump’s 2026 budget includes major funding cuts to NSF, Office of Science, NASA, NIST, NOAA, and more",
      "content": "I’m so mad right now. NSF funding is cut in half, NASA cut by a quarter, others only have the amounts listed. This will have a massive impact on physics research in the US.",
      "author": "EffectiveFood4933",
      "created_utc": 1746202369,
      "upvotes": 236,
      "upvote_ratio": 0.99,
      "num_comments": 35,
      "flair": "Rant/Vent",
      "url": "https://static01.nyt.com/newsgraphics/documenttools/2484367fae1c9899/749c3b87-full.pdf",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1kd4w0u/trumps_2026_budget_includes_major_funding_cuts_to/"
    },
    {
      "id": "1kde8zi",
      "title": "I'm most likely going to fail my physics class, how can I pass it the second attempt?",
      "content": "So I am currently taking Physics I for scientists and engineers and I have been confused and lost pretty much the entire time. I want to be good at physics but there is just so much information in the class that if you get behind you're behind the rest of the semester. I find physics interesting and I am currently thinking about pursuing astrobiology as my phd. \n\nI am nearing the end of the semester (finals are next week) and with how things are going, I am most likely going to fail my physics class and will have to retake it over the summer. How can I properly study and make sure that I remember how to do the problems and become better at physics?",
      "author": "HellDonut",
      "created_utc": 1746226335,
      "upvotes": 8,
      "upvote_ratio": 0.91,
      "num_comments": 10,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kde8zi/im_most_likely_going_to_fail_my_physics_class_how/"
    },
    {
      "id": "1kdh0e8",
      "title": "Need Input between UCSD and UCI",
      "content": "Hi, \n\nThis recent application cycle I was accepted as a transfer into both UCSD (BA General Physics) and UCI (Physics)! I’m very excited for what the future holds but I need some outside input about which school I should attend.. (questions at bottom)\n\nUCSD(Warren College): The school has a great location, seems to be better than Irvine in terms of “prestige”.  The housing seems to be atrocious though, and upon reviewing class work I need to take (Physics 4 series!!), I am most certain it will take me more than 2 years (and tbh closer to 3) to complete my program. \n\nUCI: location is still solid in OC. Housing seems to be a bit less stressful too. Upon reviewing and talking to the college of sciences here they said they would allow me to switch to Applied Physics (which I would most likely do), and then maybe pursue that concentration in engineering. I don’t know what the timeline would be, but I’m assuming less than UCSD. \n\n\n\nNOTE: I’ll be honest I don’t have an intention to jump into grad school. If an opportunity presents itself down the line I would love to consider it but that just isn’t in my sights currently (but it doesn’t mean that can’t change)! I’m located in SoCal (fairly close to both schools), and to keep things short I am very grateful to have the familial support to extend beyond a two year timeline if needed (I have suffered from burnout in the past).\n\n\nFinally: I would just love to hear all sorts of input. I wanna enter the workforce. What will set me up for that? How’s housing between the two? Which is more competitive academically? Clubs? I want to hear everything! And also be given new insights/perspectives/ask myself new questions about what I want. \n\nThank you for the read and if I need to clarify something don’t hesitate to ask",
      "author": "TanCascade",
      "created_utc": 1746234525,
      "upvotes": 5,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kdh0e8/need_input_between_ucsd_and_uci/"
    },
    {
      "id": "1kcq863",
      "title": "How to start job search (Bachelors only)?",
      "content": "I went back to school in my 30s for a Bachelors in Physics, because why not?  Life happened and I now have a beautiful daughter who arrived with my degree. \n\nWhere do I even start? I’m not in the top of my\nclass by a long shot, but my work ethic is strong. \n\nSpread my resume on indeed and other sites and just hope for a hit?  I know it’s bad timing with research cuts and fewer government jobs etc, but I just need a place to start.\n\nAny advice? ",
      "author": "awolzen",
      "created_utc": 1746152567,
      "upvotes": 18,
      "upvote_ratio": 1.0,
      "num_comments": 6,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kcq863/how_to_start_job_search_bachelors_only/"
    },
    {
      "id": "1kc9p54",
      "title": "For all you physics students how do you take your notes?",
      "content": "What I tend to do is that I do the reading ahead of time, then attend the lecture and try to understanding the reading that I've covered. Though I noticed that I am a slow reader and it takes forever for me to get through 1 section in a textbook.",
      "author": "danielmhdi",
      "created_utc": 1746108663,
      "upvotes": 57,
      "upvote_ratio": 1.0,
      "num_comments": 12,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kc9p54/for_all_you_physics_students_how_do_you_take_your/"
    },
    {
      "id": "1kc3aaj",
      "title": "How often do you guys struggle with not understanding in physics?",
      "content": "I know this question sounds kinda weird, but going over intro electromagnetism which is a class where most physics majors drop out and honestly most of the things aren't clicking for me atm. I understand maths and I am quite comfortable with vectors and vectors calculus. This is feeling of not fully understand a topic normal among physics majors or physicist?\n\n",
      "author": "Far-Zone-8924",
      "created_utc": 1746085959,
      "upvotes": 44,
      "upvote_ratio": 0.97,
      "num_comments": 32,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kc3aaj/how_often_do_you_guys_struggle_with_not/"
    },
    {
      "id": "1kbypjr",
      "title": "I want to be a physicist by myself",
      "content": "I always wanted to be a physicist. That's why I took physics in University. But I ended up a CGPA with 2.87 out of 4. Throughout the my Uni life, I was depressed and not gonna lie that I was kinda escaping from everything in my Uni life. Moreover my university kinda forced courses like Quantum physics,theory of relativity,solid state,statistical mechanics to memorize. Electronics course was maybe the only thing we could understand properly. For clarify some of us and seniors try to learn by themselfs and took online courses to understand. My physics journey is stopped and with the result like this I probably don't have much scope in my carrier,moreover My family is in financial crisis and I have to take government job exam. If I want to be a physicist by myself now,where I will be learning by myself by reading books and research paper, watching videos,can i do that myself,without professional bodies and association with University. Can anyone do that?\nI am from Bangladesh.Pardon my grammertical mistakes.",
      "author": "Me_Not_Me20",
      "created_utc": 1746068290,
      "upvotes": 41,
      "upvote_ratio": 0.86,
      "num_comments": 23,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kbypjr/i_want_to_be_a_physicist_by_myself/"
    },
    {
      "id": "1kc7fro",
      "title": "I chose nuclear physics and astrophysics over renewable energy technology. Was it a good choice?",
      "content": "I picked nuclear physics and astrophysics instead of renewable energy. Some friends and seniors say renewable energy has better job chances, while mine is more research focused. But I enjoy what I chose. Are there any career options in this field other than teaching?\n",
      "author": "_Closedheimer",
      "created_utc": 1746102309,
      "upvotes": 5,
      "upvote_ratio": 0.78,
      "num_comments": 3,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kc7fro/i_chose_nuclear_physics_and_astrophysics_over/"
    },
    {
      "id": "1kbrx1l",
      "title": "Online Master's in Physics With Astronomy Concentration",
      "content": "I am currently working full-time as a data scientist. I am feeling like I need a career change and have always been passionate about astronomy. I minored in astronomy in undergrad and did some research as well, but never pursued it further.\n\nI would like to get an online master's degree while I work full-time, and I have heard that if I do want to go into astronomy, it is advisable to get a physics master's with a concentration in astronomy. Then, I can try to apply for a full astronomy PhD.\n\nI would like to do an online master's so that I can continue to work, and in case I do not enjoy the field as much as I thought I would. Do you have any recommendations on programs that might offer what I am looking for? I have had trouble finding this on my own, if it does exist.",
      "author": "NewDawn729",
      "created_utc": 1746048498,
      "upvotes": 9,
      "upvote_ratio": 0.85,
      "num_comments": 2,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kbrx1l/online_masters_in_physics_with_astronomy/"
    },
    {
      "id": "1kbtrvo",
      "title": "Need a little Help regarding physics as a Passion or not ?",
      "content": "I am interested in physics (especially astrophysics) from High School (was good at it, topped every physics class and highest score in any competitive exam in physics section from my class). I didn't pursue in my college beacuse, I knew I wasn't a extraordinary genius and physics prodigy (Jeff Bezos video where he described same situation). I purswd Electronics in undergrad but I have recently done some internship and am sure that it is not as intresting as one thought, hoped.\nI want to known that how can I be sure that physics is my true passion without doing masters, as I have only done couple of courses of physics and audited some other not nearly very consistent level.\nShould I consider doing a long term project in the domain to grasp a idea what the feel to be in long term research physics. If yes, any suggestions what possible project I can do independently as I have just recently graduated.\nIf No, any other of your thoughts on my situation.\nThanks in advance. ",
      "author": "Friendly_War_1912",
      "created_utc": 1746053417,
      "upvotes": 5,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kbtrvo/need_a_little_help_regarding_physics_as_a_passion/"
    },
    {
      "id": "1kbofal",
      "title": "Is mastering out from the physics phd program worth it as an international student?",
      "content": "I came to the US to do my phd in physics, I wanted to do condensed matter experiment but I was surprised to see that the work environment was not encouraging or patient enough. I have tried two labs where both PIs didn't think I was a good \"fit\". In my point of view I think they wanted an independent researcher while I was looking for mentoring and apprenticeship. \n\nThe summer is about to start and I have no prospective PIs to work with in that field. I was considering mastering out because they told me I had no passion.. even though all I want is a chance to learn. Perhaps I didn't show it enough.  I am feeling like the reasonable decision would be to quit before it's too late. But I know this would be a risk too. I would have to go back to my home country and i won't find work.\n\nHas anyone gone through a similar experience? any advice?",
      "author": "Equivalent_Big9067",
      "created_utc": 1746039593,
      "upvotes": 7,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "flair": "Research",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kbofal/is_mastering_out_from_the_physics_phd_program/"
    },
    {
      "id": "1kbfvuq",
      "title": "Beginner level physics but it something doesn't make sense",
      "content": "For context I'm in beginning physics at my school since you have to take it before you can take AP. I don't understand why I can't grasp anything fully in class but when I do problems from the Halliday-Resnick textbooks, I do fine which apparently they use in AP. In school our physics is just algebra-based, but no teacher who has taught the course in our school has had experience in teaching physics. I'm literally left so confused in class. Is this normal? Like have people understood physics when they've done it at a higher level? I feel kinda dumb in the class but I can do it at home. It just doesn't make sense to me how that can work.",
      "author": "Advanced_Zucchini672",
      "created_utc": 1746018037,
      "upvotes": 10,
      "upvote_ratio": 1.0,
      "num_comments": 11,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kbfvuq/beginner_level_physics_but_it_something_doesnt/"
    },
    {
      "id": "1kb2cj4",
      "title": "Collapse Geometry Stern Gerlach Attempt",
      "content": null,
      "author": "Advanced-Iron-4664",
      "created_utc": 1745969692,
      "upvotes": 51,
      "upvote_ratio": 0.86,
      "num_comments": 10,
      "flair": "Update",
      "url": "https://i.redd.it/jiyfqz6a0vxe1.gif",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1kb2cj4/collapse_geometry_stern_gerlach_attempt/"
    },
    {
      "id": "1karuvd",
      "title": "Lancaster and Blundell (authors of 'QFT for a Gifted Amateur') just published a similar book on General Relativity!",
      "content": "[https://tomlancaster.webspace.durham.ac.uk/grgabook/](https://tomlancaster.webspace.durham.ac.uk/grgabook/)",
      "author": "Pristine-Amount-1905",
      "created_utc": 1745943245,
      "upvotes": 20,
      "upvote_ratio": 0.96,
      "num_comments": 5,
      "flair": "Update",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1karuvd/lancaster_and_blundell_authors_of_qft_for_a/"
    },
    {
      "id": "1kar8ac",
      "title": "I want to earn small on the side using Internet",
      "content": "I am currently doing BS physics and I am currently in the middle of my 6th semester. I want to earn money on the side as to not burden my parents anymore and also so I could pay for my different hobies and also any material that I have to buy relating to studying.\n\nI have developed a lot of skills during my bachelors, some of which are:\n\n1: Coding (Python).\n\n2: Got a very good understanding of Mechanics, Modeling, Calculus, ODE and PDE, Relativity, etc\n\nI am also used to teaching my fellow class mates and juniors so I have a bit teaching experience.",
      "author": "BlitzRex54",
      "created_utc": 1745941710,
      "upvotes": 5,
      "upvote_ratio": 0.67,
      "num_comments": 6,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kar8ac/i_want_to_earn_small_on_the_side_using_internet/"
    },
    {
      "id": "1kakgck",
      "title": "Looking for a summer school about graduate level theoretical physics",
      "content": "Exactly what the title says. I'm a physics masters student currently working on string theory and trying to learn pretty much everything I come across. I know several summer schools but they sometimes can be hard to find on the internet. \n\nNote: They can be in the US or Eurasia but Eurasia is better if we think about the political situation in the US.",
      "author": "fizikmizik",
      "created_utc": 1745921780,
      "upvotes": 8,
      "upvote_ratio": 0.84,
      "num_comments": 8,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kakgck/looking_for_a_summer_school_about_graduate_level/"
    },
    {
      "id": "1ka7fue",
      "title": "Why Do I feel so Stupid Doing Classical Mechanics",
      "content": "Despite understanding basic concepts and knowing how to visualize vectors, I feel like my soul is being crushed. \n\nWhy am I feeling this dumb 😭 I was competent at math but now I feel like a moron. \n\nWhy tf is physics cooking my brain into a crisp \n\nEdit: THANK YOU for your kind comments and support :)  ",
      "author": "Consistent31",
      "created_utc": 1745876485,
      "upvotes": 85,
      "upvote_ratio": 0.99,
      "num_comments": 39,
      "flair": "Rant/Vent",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1ka7fue/why_do_i_feel_so_stupid_doing_classical_mechanics/"
    },
    {
      "id": "1kae5gc",
      "title": "Community college or 4 year university in preparation for PhD",
      "content": "Hey everyone, I am looking in the future where I want to pursue a PhD in something like Plasma Physics. Going to community college will save me something like 70k-90k in student loans I would have to take, but I would miss out on research opportunities for my first year. If not CC then I would go to UCSD most likely. Is missing out on the connections with professors and research worth the thousands of dollars I would save?",
      "author": "JoeJoeTheBaar",
      "created_utc": 1745896247,
      "upvotes": 16,
      "upvote_ratio": 1.0,
      "num_comments": 8,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kae5gc/community_college_or_4_year_university_in/"
    },
    {
      "id": "1ka9nqo",
      "title": "Is it normal to feel stupid doing Physics problems?",
      "content": "Hey there... I'm a junior in HS and I'm just so frustrated with Physics right now- my IB Physics SL exam is literally tomorrow, and I feel like I'm really not connecting the concepts enough, or understanding it, or generally *getting* it. I feel lost and I don't get the feeling in any of my classes (computer science, chemistry, and math, etc.) but it's like no matter how hard I study I just can't grasp the information to answer any actual problems. ",
      "author": "ARC000X",
      "created_utc": 1745882501,
      "upvotes": 20,
      "upvote_ratio": 0.96,
      "num_comments": 4,
      "flair": "Rant/Vent",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1ka9nqo/is_it_normal_to_feel_stupid_doing_physics_problems/"
    },
    {
      "id": "1kaeodn",
      "title": "Advice for a physics student who is looking to go to grad school in a few years.",
      "content": "Hey,\n\nSo here is my story - so like I graduated high school early like 2-3 years - and I might graduate college when I'm 20 I'm currently 19 - I took a gap year after graduating high school to volunteer, honestly.. but here is the thing I'm at a state school that isn't a top tier school for undergrad I don't think matters though? so my thing is like how would I go about applying for grad school in the future - I'm going to start doing research with my professors next semester and like what else would you guys recommend? I mean, I'm interested in astrophysics and theoretical physics .. \n\nMy undergraduate major is physics, and I am also minoring in philosophy and math.\n\nSo yeah, I want advice! And not sure if this is the right place to post this.\n\nThank you!",
      "author": "Elijah908",
      "created_utc": 1745898016,
      "upvotes": 9,
      "upvote_ratio": 0.84,
      "num_comments": 3,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1kaeodn/advice_for_a_physics_student_who_is_looking_to_go/"
    },
    {
      "id": "1k9b77x",
      "title": "Is my derivation for complex wave number correct?",
      "content": "I was studying electromagnetic waves in conductors from Griffiths. There, they directly wrote down the solution for the complex wave number without showing the steps. Our professor taught the full steps in class, but they were a bit lengthy.\nI have skipped the obvious algebraic steps and found my approach to the solution easier than the professor's.\n\nI have also attached the actual text from the book.",
      "author": "Peter-Parker017",
      "created_utc": 1745779435,
      "upvotes": 29,
      "upvote_ratio": 1.0,
      "num_comments": 2,
      "flair": "Need Advice",
      "url": "https://www.reddit.com/gallery/1k9b77x",
      "is_self": false,
      "permalink": "/r/PhysicsStudents/comments/1k9b77x/is_my_derivation_for_complex_wave_number_correct/"
    },
    {
      "id": "1k95zb3",
      "title": "GUYS I HAVE MY FINAL E&M TEST SOON!!! Any tips, advice, or general things to remember?",
      "content": "aaaaaggghhh \n\nany advice/tips are greatly appreciated :)",
      "author": "defenestration368",
      "created_utc": 1745766134,
      "upvotes": 30,
      "upvote_ratio": 0.94,
      "num_comments": 15,
      "flair": "Need Advice",
      "url": null,
      "is_self": true,
      "permalink": "/r/PhysicsStudents/comments/1k95zb3/guys_i_have_my_final_em_test_soon_any_tips_advice/"
    }
  ]
}